Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/action-types.po
Languages: de

source: You can now use the calculated *Total price* variable else where in the process. Add the existing *Total price* field as a read-only field to the *Check total price* user task. Finally, add the *Total price* field to the *Send quotation* email task’s template, to send the quotation.
de: Sie können die Output-Variable der Entscheidung nun auch an anderen Stellen im Prozess einsetzen. Wir fügen das Feld *Total Price* als schreibgeschütztes Feld der Aufgabe *Check Total Price* ein. Als letzten Schritt, fügen wir das Feld *Total Price* in die Vorlage der E-Mail-Aufgabe *Send quotation* ein.

source: Signavio - Set model state
de: Signavio - Modellzustand setzen

source: A `Set model state` action in the Workflow Accelerator process builder
de: Eine `Modellzustand setzen`-Aktion

source: When you use `Signavio Process Manager <http://www.signavio.com/products/process-editor/>`_ for process modelling, you can use Workflow Accelerator to manage process diagram approvals. Signavio Process Manager triggers these process diagram approval workflows, which run in Workflow Accelerator and in turn update the process model in Signavio Process Manager.
de: Wenn Sie den `Signavio Process Manager <https://www.signavio.com/de/products/process-editor-de/>`__ zur Prozessmodellierung verwenden, können Sie mit Signavio Workflow Accelerator Diagrammfreigaben verwalten. Nachdem Nutzer Freigabe-Workflows im Signavio Process Manager ausgelöst haben, wird die Freigabe in Signavio Workflow durchgeführt. Durch die Freigabe ändert sich wiederum der Status des Diagramms im Process Manager.

source: To use the `Set model state` task, you need to have access to `Signavio Process Manager <http://www.signavio.com/products/process-editor/>`_. This task only works in a process that has the `Signavio approval` trigger.
de: Um die `Modellzustand setzen`-Aktion auszulösen, benötigt Ihr Signavio Workflow Accelerator-System Zugriff auf den `Signavio Process Manager <https://www.signavio.com/de/products/process-editor-de/>`__. Die Aktion funktioniert ausschließlich in Prozessen, die den `Signavio Freigabe`-Auslöser haben.

source: The `Set model state` action automatically updates the ‘diagram state’ in Signavio Process Manager, e.g. to mark the diagram as *approved* or *in progress*. You typically use this as part of a process that performs a management approval that marks the diagram as *accepted* or *rejected*.
de: Die `Modellzustand setzen`-Aktion aktualisiert den Diagrammzustand im Signavio Process Manager automatisch, zum Beispiel um ein Diagramm als *freigegeben* oder *in Bearbeitung* zu kennzeichnen. Typischerweise wird diese Aktion als Teil eines Prozesses verwendet, mit dem eine Management-Freigabe durchgeführt wird und der ein Diagramm als *akzeptiert* oder *abgelehnt* markiert.

source: A process diagram approval workflow that uses `Set model state` actions
de: Ein Freigabe-Workflow, der die `Modellzustand setzen`-Aktion verwendet.

source: Select a `Set model state` action to configure which process `Model state` the `Set model state` action will set.
de: Wählen Sie eine `Modellzustand setzen`-Aktion aus und konfigurieren Sie den Zustand, der von der Aktion gesetzt werden soll.

source: Configuring a `Set model state` action to set a Signavio Process Manager diagram’s status
de: Konfigurieren Sie eine `Modellzustand setzen`-Aktion, um den Zustand eines Diagramms im Signavio Process Manager zu ändern.

source: Signavio Process Manager defines these `Model state` options. See `Managing approval workflows <https://editor.signavio.com/userguide/en/workspace_admin/manage_software_config/config_workflows.html#managing-approval-workflows>`_ for instructions on how to set this up.
de: Die Modellzustandsoptionen werden im Signavio Process Manager definiert. Unter `Freigabe-Workflows verwalten <https://editor.signavio.com/userguide/en/workspace_admin/manage_software_config/config_workflows.html#managing-approval-workflows>`__ finden Sie die entsprechende Konfigurationsanleitung.

source: Map variables
de: Variable zuweisen

source: A `Map variables` task in the process editor
de: Eine `Variable zuweisen`-Task im Prozesseditor

source: The `Map variables` action copies the value of one :ref:`variable <variables>` to another. You can use this to set the value of a process variable automatically, instead of manually using a :ref:`form <forms>`.
de: Die `Variable zuweisen`-Aktion kopiert den Wert einer :ref:`Variablen <variables>` in eine andere Variable. Sie können hiermit die Werte von Prozessvariablen automatisch setzen anstatt sie manuell über ein :ref:`Formular <forms>` festlegen zu müssen.

source: In some processes, the person who started the case should participate in the process by adopting one of the process’ :ref:`roles <roles>`. Consider an application process, where the person who starts the case must then complete a task to provide additional information.
de: In einigen Prozessen soll die Person, die den Fall gestartet hat, im Prozess eine der :ref:`Prozessrollen <roles>` übernehmen. Als Beispiel kann ein Bewerbungsprozess dienen, in dem die Person, die den Fall erstellt hat, im Laufe des Prozesses zusätzliche Informationen bereitstellen muss.

source: Configuring a `Map variables` task in the process editor
de: Eine `Variable zuweisen`-Task im Prozesseditor konfigurieren

source: In this example, the `Provide additional information` action assigns the task using an `Applicant` role. When the applicant starts a case, the `Map variables` task automatically sets this role to the value of the `Case creator`. This automatically assigns the `Provide additional information` task, and any other tasks that use the same role, to the person who started the case.
de: In diesem Beispiel ordnet die `Zusätzliche Informationen bereitstellen`-Aktion den Task über eine `Bewerber`-Rolle zu. Wenn der Bewerber einen Fall startet, setzt der `Variablen zuordnen`-Task diese Rolle auf den Wert der Variable `Ersteller`. Damit werden der `Zusätzliche Informationen bereitstellen`-Task und alle anderen Tasks der Rolle automatisch der Person zugewiesen, die den Fall erstellt hat.

source: Document template
de: Dokumentvorlage

source: If you are modelling a workflow, there is often the need to collect the information input entered by users of the workflow tasks. Workflow Accelerator can add these data dynamically to a Microsoft Word document, which is then used as a basis for a later audit, for example for further decisions. Because data are collected in a Word file, the content can be modified subsequently. To do this, add the action type 'Document template' in your workflow. With this action, a task is assigned to users including the request to specify the necessary information in a custom task form. Workflow Accelerator applies the information that is retrieved from this task form to the uploaded template.
de: Wenn Sie einen Workflow modellieren, besteht in der Praxis oft der Bedarf, auch Informationen, die Benutzer der Workflow- Aufgaben eingeben, zu sammeln. Diese Daten können anschließend in einem Dokument dynamisch eingefügt und zur späteren Überprüfung, z.B. für weiterführende Entscheidungen zugrunde gelegt werden. Da es sich um Word-Dokumente handelt, ist auch eine spätere Bearbeitung möglich. Zu diesem Zweck fügen Sie in Ihrem Workflow den Aktionstyp „Vorlage“ ein. Mit dieser Aktion wird dem Nutzer eine Aufgabe mit der Aufforderung zugeordnet, die erforderlichen Informationen in einem benutzerdefinierten Aufgabenformular anzugeben. Die Informationen aus dem benutzerdefinierten Aufgabenformular werden durch Workflow Accelerator in die hochgeladene Vorlage eingefügt.

source: Suppose your company has set up a workflow for contracts or quotations, in which several roles define the relevant document data in different Workflow Accelerator tasks. The contract or quotation is created based on a standard template, so that required data from the workflow are assigned accordingly in an output form. At the end of the process, the output document containing all relevant information is made available to a sales person, who has then the ability to make any personal additions before the contract or quotation will be sent to the customer.
de: Nehmen wir an in Ihrem Unternehmen wird ein Workflow für Kaufverträge oder Kostenvoranschläge etabliert, in welchem mehrere Abteilungen durch die Zuweisung von Workflow-Aufgaben relevante Daten hinterlegen müssen. Der Vertrag/ Kostenvoranschlag wird basierend auf einer Standardvorlage erstellt, sodass erforderliche Daten aus dem Workflow entsprechend in einem Ausgabeformular zugeordnet werden. Dem Vertriebsmitarbeiter liegt zum Ende des Prozesses das Outputdokument mit allen relevanten Informationen vor, sodass dieser noch die Möglichkeit hat, persönliche Ergänzungen vorzunehmen, bevor der Vertrag/ Kostenvoranschlag dem Kunden zugeschickt wird.

source: Content controls
de: Inhaltssteuerelemente

source: A prerequisite for the implementation of this feature is that the applied template is a Microsoft Word document that contains the required content controls. You will find a detailed description on how to implement content controls in a Word document here: https://support.office.com/en-us/article/Create-forms-that-users-complete-or-print-in-Word-040c5cc1-e309-445b-94ac-542f732c8c8b
de: Voraussetzung für die Ausführung dieses Features ist, dass die angewendete Vorlage ein Microsoft Word-Dokument ist, das die erforderlichen Inhaltssteuerelemente enthält. Eine ausführliche Beschreibung zu diesen Elementen finden Sie hier: https://support.office.com/de-de/article/Erstellen-von-Formularen-die-in-Word-ausgef%C3%BCllt-oder-gedruckt-werden-k%C3%B6nnen-040c5cc1-e309-445b-94ac-542f732c8c8b?omkt=de-DE&ui=de-DE&rs=de-DE&ad=DE

source: Please note that currently only text and plain text are supported as types of content controls.
de: Bitte beachten Sie, dass derzeit nur Text und Rich Text als Inhaltssteuerelemente-Typen unterstützt werden.

source: Content controls, which have been created in the document template, each represent a form field. To map and display form fields correctly in Workflow Accelerator, it is mandatory to specify a title to each content control. The title is set as a property of the control.
de: Inhaltssteuerelemente, die in der Dokumentenvorlage angelegt worden sind, repräsentieren jeweils ein Formularfeld. Damit Formularfelder in Workflow Accelerator korrekt gemappt und angezeigt werden können, ist es unerlässlich, jedem Inhaltssteuerelement einen Titel zuzuweisen. Der Titel wird dabei als Eigenschaft des Elements festgelegt.

source: Rich text fields support no line breaks. But you can use line breaks for plain text fields with the property 'Allow carriage returns (multiple paragraphs)'.
de: Rich Text-Felder unterstützen keine Zeilenumbrüche. Für nur-Text-Felder mit der Eigenschaft „Wagenrückläufe zulassen (mehrere Absätze)“ können Sie Zeilenumbrüche verwenden.

source: Configuring a `Document template` action in the process editor.
de: “Dokument erstellen”-Aktionen im Prozesseditor konfigurieren.

source: Select a `Document template` action in the process editor to configure the following options.
de: Wählen Sie eine `Dokument erstellen`-Aktion um Prozesseditor aus und konfigurieren Sie die folgenden Einstellungen.

source: Upload the template. This action creates a new file from a document template.
de: Laden Sie eine Vorlage hoch. Durch diese Aktion wird eine neue Datei aus einer Dokumentvorlage erzeugt.

source: Inputs tab
de: Eingaben Tab

source: Specify the desired data and link either with static values or existing fields of the workflow.
de: Geben Sie die gewünschten Daten an und verlinken diese entweder mit statischen Werten oder existierende Felder des Workflows.

source: Outputs tab
de: Ausgaben Tab

source: Select the output value "Document" and enter the desired name.
de: Wählen Sie aus Ausgabewert „Dokument“ aus und tragen Sie die gewünschte Bezeichnung ein.

source: Each field in the subprocess can be used in this process once you added it as an output.
de: Jedes Feld im Subprozess kann auch in diesem Workflow benutzt werden, sobald Sie es als Ausgabewert hinzugefügt haben.
