Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/action-types.po
Languages: de

source: Next to `Folder name template`, you can optionally specify a subfolder name to create inside the target folder. This name template can include process variables, so you can create new subfolders dynamically to organise your files. For example, if your process variables include a unique customer ID, then you can use that to save each customer’s files in a separate folder. Use a forward slash (``/``) to separate nested subfolder levels.
de: Im Feld `Vorlage für Ordnername` können Sie den Namen eines Unterordners spezifizieren, der im von Ihnen gewählten Verzeichnis angelegt werden soll. Für den Namen können Sie auch Felder aus dem Prozess verwenden, um so dynamisch Ordner anzulegen. Wenn Sie zum Beispiel eine Kundennummer aufnehmen, können Sie Dokumente, die Sie einem Kunden zuordnen möchten immer im entsprechenden Ordner ablegen. Wenn Sie Felder durch einen Schrägstrich (``/``) voneinander trennen, legt Signavio Workflow sogar ganze Hierarchien von Ordnern für Sie an.

source: Next to `Files to upload`, you can select the variable field containing one or more files to upload. If the process did not already include a file variable, Workflow Accelerator automatically creates a variable called 'File'. If the process variables did include a file or list of files, Workflow Accelerator preselects it.
de: Neben `Hochzuladende Dateien` können Sie eine oder mehrere Dateien auswählen, die Sie hochladen möchten. Falls der Prozess noch keine Datei-Variable besitzt, erstellt Signavio Workflow automatisch eine Variable mit dem Namen 'Datei'. Falls die Prozessvariablen eine Datei oder eine Liste von Dateien beinhalteten, markiert Signavio Workflow Accelerator diese.

source: Google Drive - Print file
de: Google Drive - Datei drucken

source: A Google Drive *Print file* task in the process editor
de: Eine Google Drive *Datei drucken*-Aktion im Prozesseditor

source: The Google Drive `Print File` action uses `Google Cloud Print <http://www.google.com/cloudprint/learn/>`_ to print a file that a case participant has uploaded to a case.
de: Die Google Drive `Datei drucken` Aktion benutzt `Google Cloud Print <http://www.google.com/cloudprint/learn/>`_ um Dateien zu drucken, die in einem Fall hochgeladen wurden.

source: After creating a Google Drive `Print file` action, the configuration panel shows a button to start configuring the account. This configuration has the same steps as in the :ref:`Upload file configuration <upload-file-configuration>` (above).
de: Nachdem Sie die Google Drive *Datei drucken*-Aktion erstellt haben, wird Ihnen - analog zu den anderen Google Drive-Aktionen - eine Schaltfläche angezeigt, über die Sie ein Google Drive Konto wie unter :ref:`Datei hochladen - Konfiguration <upload-file-configuration>` beschrieben hinterlegen können.

source: When you have authenticated with a Google account and granted permission, you can configure the `Print file` action.
de: Wenn Sie einen Google Drive Account hinterlegt haben, können Sie die `Datei drucken`-Aktion konfigurieren.

source: Print file action
de: Datei drucken Aktion

source: Once you have configured your Google Drive account, the `Print file` action configuration panel displays the account, the printer settings, and the selected file to print.
de: Nachdem Sie Ihren Google Drive Account hinterlegt haben können Sie in der `Datei drucken` Aktion die Druckereinstellungen und die Datei, die gedruckt werden soll, konfigurieren.

source: Google Drive `Print file` authenticated configuration
de: Google Drive `Datei drucken` Konfiguration

source: In the section `Files to upload` you can select the file variable that holds the file you want to print.
de: Im Abschnitt `Zu druckende Dateien` wählen Sie die Dateien aus, die Sie drucken möchten.

source: Google Drive - Add row to sheet
de: Google Drive - Zeile in Tabelle hinzufügen

source: A Google Drive *Add row to sheet* task in the process editor
de: Eine Google Drive *Zeile in Tabelle hinzufügen*-Aktion im Prozesseditor

source: The Google Drive *Add row to sheet* action adds a row to a Google Sheets spreadsheet. You can use this to save the values of process variables at process milestones, and build a custom overview of cases.
de: Eine Google Drive *Zeile in Tabelle hinzufügen*-Aktion fügt eine Zeile zu einem Google Sheets Tabellenblatt hinzu. So können Sie Prozessvariablen beim Erreichen von Meilensteinen abspeichern und eine individuelle Übersicht über Ihre Fälle erstellen.

source: After creating a Google Drive *Add row to sheet* action, the configuration panel shows a button to start configuring the account. This configuration has the same steps as in the :ref:`Upload file configuration <upload-file-configuration>` (above).
de: Nachdem Sie die Google Drive *Zeile in Tabelle hinzufügen*-Aktion erstellt haben, wird Ihnen - analog zu den anderen Google Drive-Aktionen - eine Schaltfläche angezeigt, über die Sie ein Google Drive Konto wie unter :ref:`Datei hochladen - Konfiguration <upload-file-configuration>` beschrieben hinterlegen können.

source: When you have authenticated with a Google account and granted permission, you can configure the *Add row to sheet* action.
de: Sobald Sie sich mit Ihrem Google-Account authentifiziert und den Zugriff bestätigt haben, können Sie die *Zeile in Tabelle hinzufügen*-Aktion konfigurieren.

source: Add row to sheet action
de: Zeile in Tabelle hinzufügen-Aktion

source: Once you have configured your Google Drive account, the *Add row to sheet* action configuration panel displays the account, the spreadsheet, the worksheet within the spreadsheet, and the worksheet columns.
de: Sobald Sie Ihren Google Drive-Account hinterlegt haben, zeigt das *Zeile in Tabelle hinzufügen*-Aktion-Konfigurationspanel den Account, die Tabellenmappe, das Datenblatt der Mappe und die Tabellenspalten an.

source: Google Drive *Add row to sheet* authenticated configuration
de: Google Drive *Zeile in Tabelle hinzufügen*: Konfigurationseinstellung nach erfolgreicher Authentifizierung

source: Each column name, such as *Customer name* in this example, comes from a column heading in the spreadsheet. For each column, select one of the :ref:`variables <variables>` from the list.
de: Die Spaltennamen, wie im Beispiel *Kundenname*, werden auf Basis der Tabellenspalten generiert. Wählen Sie für jede Spalte eine :ref:`Variable <variables>` aus der Liste aus.

source: Google Drive - Add calendar event
de: Google Drive -Termin zum Kalender hinzufügen

source: A Google Drive *Add calendar event* task in the process editor
de: Eine Google Drive *Termin zum Kalender hinzufügen*-Aktion im Prozesseditor

source: The Google Drive *Add calendar event* action adds an event to a Google Calendar. You can use this to schedule meetings or time to work on a task, based on the values of process variables.
de: Die Google Drive Aktion *Termin zum Kalender hinzufügen* fügt einen Termin zu einem Google Kalender hinzu. Sie können diese Aktion verwenden, um Meetings oder Arbeitszeiten festzulegen. Die nötigen Informationen werden aus den Prozessvariablen erzeugt.

source: After creating a Google Drive *Add calendar event* action, the configuration panel shows a button to start configuring the account. This configuration has the same steps as in the :ref:`Upload file configuration <upload-file-configuration>` (above).
de: Nachdem Sie die Google Drive Aktion *Termin zum Kalender hinzufügen* erstellt haben, wird Ihnen - analog zu den anderen Google Drive-Aktionen - eine Schaltfläche angezeigt, über die Sie ein Google Drive Konto hinterlegen können, wie im Kapitel :ref:`Datei hochladen - Konfiguration <upload-file-configuration>` beschrieben.

source: When you have authenticated with a Google account and granted permission, you can configure the *Add calendar event* action.
de: Sobald Sie sich mit Ihrem Google-Account authentifiziert und den Zugriff bestätigt haben, können Sie die Aktion *Termin zum Kalender hinzufügen* konfigurieren.

source: Add calendar event action
de: Eine Aktion vom Typ 'Termin zum Kalender hinzufügen'

source: Once you have configured your Google Drive account, the *Add calendar event* action configuration panel shows the calendar event fields.
de: Nachdem Sie Ihren Google Drive Account hinterlegt haben, zeigt das Konfigurationspanel der Aktion die Formularfelder zur Konfiguration des Termins, der zum Google Kalender hinzugefügt werden soll.

source: Google Drive *Add calendar event* authenticated configuration
de: Google Drive *Termin zum Kalender hinzufügen*: Konfigurationseinstellungen nach erfolgreicher Authentifizierung

source: In the configuration you can specify the following.
de: Im Konfigurationsdialog können Sie die folgenden Einstellungen konfigurieren.

source: Calendar
de: Kalender

source: The calendar within the selected Google account.
de: Der Kalender im gewählten Google Account.

source: Event summary (optional)
de: Terminbezeichnung (optional)

source: A text variable to use as the name of the new calendar event. If you don’t select a text variable, the event will have a blank name.
de: Eine Textvariable, die den Namen des neuen Kalendereintrags festlegt. Falls Sie keine Textvariable wählen, bleibt der Name des Termins im Kalender leer.

source: Start date
de: Startdatum

source: A date variable for the event’s start date and time.
de: Eine Datumsvariable, die die Tageszeit und das Datum enthält, an dem der Termin beginnt.

source: End date
de: Enddatum

source: A date variable for the event’s end date and time.
de: Eine Datumsvariable, die die Tageszeit und das Datum enthält, an dem der Termin endet.

source: Attendees (optional)
de: Teilnehmer (optional)

source: Email address variables for people to invite to the calendar event.
de: E-Mailadresse-Variablen, die die einzuladenden Teilnehmer auflisten.

source: Box Upload file
de: Box Dateiupload

source: A box upload file task in the process editor
de: Eine Box Datei-Upload Aktion im Prozesseditor

source: The `Box <http://www.box.com/>`_ `Upload file` action saves one or more files to a Box account that you select.
de: Die `Box <http://www.box.com>`_ `Dateiupload` Aktion speichert eine oder mehrere Dateien in einem von Ihnen konfigurierten Box Account.

source: After creating a Box `Upload file` action, the configuration panel shows a button to start configuring the account.
de: Nachdem Sie eine Box `Dateiupload` Aktion angelegt haben, sehen Sie im Konfigurationsdialog einen Knopf um Ihren Box Account mit Signavio Workflow zu verbinden.

source: When you click the `Configure a Box account` button, a pop-up window will open for you to authorise Workflow Accelerator to use your Box account. After logging in to your Box account, if you have not already logged in, Box shows an authorization page.
de: Wenn sie auf `Fügen Sie ein Box Konto hinzu` klicken, öffnet sich ein Popup-Fenster, dass Sie auffordert, Workflow Accelerator Zugriff auf Ihren Box Account zu geben. Dazu müssen Sie sich gegebenenfalls noch in Ihrem Box Account anmelden.

source: Box permission grant, after logging in to Box
de: Erlauben Sie Signavio Workflow den Zugriff auf Ihren Box Account.

source: After granting access, the pop up will close and Workflow Accelerator will have connected to your Box account.
de: Nachdem Sie Signavio Workflow Accelerator den Zugriff gestattet haben, schließt sich das Fenster. Signavio Workflow ist nun mit Ihrem Box Account verbunden.

source: Once you have configured your Box account, the `Upload file` action configuration panel displays the account and also shows the folders in `All Files` in your Box account.
de: Sobald Ihr Account konfiguriert ist, sehen Sie in der `Dateiupload` Aktion den von Ihnen verknüpften Account, sowie die weiteren Konfigurationsmöglichkeiten.

source: Box authenticated configuration
de: Box `Dateiupload` Konfiguration

source: On the configuration panel, next to `Target folder`, you can now browse and select the folder you want to upload the file(s) to.
de: In der Konfiguration gleich neben `Zielordner` können Sie Ihre Ordner durchstöbern und den Ordner auswählen, in den die Dateien hochgeladen werden sollen.

source: JavaScript action
de: JavaScript-Aktion

source: The JavaScript action, called a *Script Task* in BPMN, allows developers to add JavaScript code to process execution.
de: Eine JavaScript-Aktion, in BPMN *Skript-Task* genannt, ermöglicht es Entwicklern JavaScript-Code als Teil eines Workflows ausführen zu lassen.

source: A JavaScript action in the process editor
de: Eine JavaScript-Aktion im Prozess-Editor

source: See :ref:`javascript` for a developer guide to using JavaScript actions.
de: Lesen Sie unter :ref:`javascript`, wie Sie JavaScript-Aktionen als Entwickler verwenden.

source: Sub-process
de: Subprozess

source: A sub-process in the process editor
de: Ein Subprozess im Prozesseditor

source: A sub-process action represents an entire process as a single task. You can use sub-processes to simplify complex process models, by collapsing each sub-process into a single action. Then you can open the sub-process to see the next level of detail. You can also use a sub-process to delegate responsibility for the process model to a different process owner.
de: Über Subprozess-Aktion wird ein ganzer Prozess zu einem einzigen Task zusammengefasst. Mit der Hilfe von Subprozessen können Sie komplexe Prozessmodelle vereinfachen. Wenn Sie den Subprozess öffnen, gelangen Sie dementsprechend auf die nächste Detailebene. Über Subprozesse können Sie zudem die Verantwortung für das Prozessmodell auf einen anderen Prozessverantwortlichen übertragen.

source: When Workflow Accelerator creates a sub-process, it starts a new case in the selected sub-process. After completing the sub-process case, Workflow Accelerator continues executing the parent case.
de: Wenn Signavio Workflow Accelerator eine Subprozessinstanz erstellt, wird ein neuer Fall im referenzierten Prozess gestartet. Nachdem dieser Prozess beendet ist, geht die Ausführung im Elternprozess weiter.

source: Configure the sub-process action in the process builder by selecting it, and choosing a process from the list. You cannot select the same process as the parent process, which would cause a loop, or an unpublished process.
de: Konfigurieren Sie den Subprozess, indem Sie das Element im Prozesseditor anklicken und einen Prozess aus der Liste auswählen. Es ist nicht möglich, einen Elternprozess auszuwählen, da dies eine Endlosschleife erzeugen würde. Zudem muss der referenzierte Prozess veröffentlicht sein.

source: Configuring a sub-process and mapping an *Invoice* variable to a trigger form field
de: Konfiguration eines Subprozesses und Mapping der Variablen *Rechnung* zu einem Auslöser-Formularfeld

source: If you select a sub-process with a trigger form, you can also select ‘input variables’ that Workflow Accelerator will use to auto-fill the trigger form fields when starting the sub-process case. In the example above, Workflow Accelerator will populate the sub-process’ *Unpaid invoice* trigger form field with the file stored in the parent process’ *Invoice* variable.
de: Falls Sie einen Subprozess mit einem Auslöser-Formular gewählt haben, können Sie auch Variablen auswählen, die Signavio Workflow benutzen soll, um die Auslöser-Formularfelder automatisch auszufüllen, wenn der Subprozess gestartet wird. Im oben stehenden Beispiel, wird Signavio Workflow Accelerator das Auslöser-Formularfeld *Unbezahlte Rechnung* des Subprozesses mit Hilfe der Datei ausfüllen, die im Hauptprozess als *Rechnung*-Variable definiert ist.

source: If you want to capture the result of running a sub-process, you can use the *Outputs* tab to add ‘outputs’. Adding an output creates a variable that gets its value from a field in the sub-process when the sub-process completes.
de: Falls Sie das Ergebnis eines Subprozesses festhalten möchten, können Sie den *Outputs*-Tab verwenden, um 'Outputs' hinzuzufügen. Wenn Sie einen Output definieren, wird eine in anderen Aktionen als Input auswählbare Variable erstellt, die ihren Wert aus einem Formularfeld des Subprozess-Outputs erhält, sobald der Subprozess beendet ist.

source: Adding an output variable that gets its value from a sub-process field
de: Eine Output-Variable, die ihren Wert aus einem Formularfeld des Subprozesses erhält, wird erstellt

source: In this example, the *Recover late payment* process has an *Amount recovered* variable. You can capture the value of this variable when the sub-process completes and use it later, in the parent process’ *Check amount recovered* task.
de: In diesem Beispiel hat der Prozess *verspätete Zahlung sicherstellen* eine *Erhaltene Zahlung*-Variable. Sie können den Wert dieser Variable festhalten, nachdem der Unterprozess beendet ist und die Information später als Input in andere Aktionen einfügen, wie z.B. hier in die Aufgabe *Erhaltene Zahlung überprüfen*.

source: DMN Rule Task
de: DMN Entscheidung

source: A DMN Rule task in the Workflow Accelerator process builder
de: Eine DMN Entscheidung (DMN Rule Task) im Signavio Workflow Accelerator Prozesseditor

source: DMN Rule Tasks execute Decision Model & Notation (DMN) business rules as part of a process. You can use rule tasks to embed complex business logic in a workflow, without adding complexity to the process model.
de: DMN Entscheidungen führen Decision Model & Notation (DMN) Geschäftsregeln als Teil eines Prozesses aus. Sie können Entscheidungen verwenden, um komplexe Entscheidungslogik in einen Workflow einzubetten, ohne den Prozess dabei komplexer erscheinen zu lassen.

source: To use DMN Rule Tasks, you need to have access to `Signavio Process Manager <http://www.signavio.com/products/process-editor/>`_.
de: Um DMN Entscheidungen zu verwenden, benötigen Sie Zugriff zum `Signavio Process Manager <http://www.signavio.com/products/process-editor/>`_ und zum `Signavio Decision Manager <http://www.signavio.com/products/decision-manager/>`_.

source: Adding a DMN Rule Task to a process model requires the following steps.
de: Verfahren Sie wie folgt, um eine DMN Entscheidung zu einem Prozessmodell hinzuzufügen.

source: Use Signavio Process Manager to create a DMN model.
de: Verwenden Sie den Signavio Process Manager, um einen BPMN-Prozess zu erstellen.

source: Use Signavio Process Manager to create a BPMN process model.
de: Verwenden Sie den Signavio Process Manager, um einen BPMN-Prozess zu erstellen.

source: In Signavio Process Manager, link a rule task to the DMN model.
de: Verlinken Sie eine Geschäftsregel im erstellten BPMN-Prozess mit dem erstellten DMN-Modell.

source: In Signavio Explorer, transfer the BPMN model to Workflow Accelerator.
de: Transferieren Sie nun das BPMN Modell im Explorer nach Signavio Workflow Accelerator.

source: Use Workflow Accelerator to configure the rule task’s inputs and outputs.
de: Verwenden Sie Signavio Workflow Accelerator, um die Inputs und Outputs der Entscheidung zu definieren.

source: A simple price calculation example illustrates how to use DMN with Workflow Accelerator. Suppose you have a price quotation process that involves and order line price calculation, and that the price depends on a discount based on the number of items. Model this calculation in Signavio Process Manager by creating the following *Calculate price* model.
de: Das einfache Beispiel eines Kalkulationsprozesses zeigt, wie Sie DMN in Signavio Workflow Accelerator verwenden können. Nehmen wir an, Sie haben einen Preiskalkulationsprozess, der Informationen aus dem Bestellprozess einbezieht und einen Rabatt auf Grund der Artikelanzahl berechnet. Zunächst muss diese Kalkulation im Signavio Process Manager modelliert werden, indem das Modell *Calculate Price* erstellt wird.

source: A DMN model in Signavio Process Manager
de: Ein DMN-Modell im Signavio Decision Manager

source: This decision model has two numeric inputs, *Unit price* and *Number of units*. The *Discount* rule uses the *Number of units* to calculate a discount. The model has one output, *Total price*, which it calculates from the two inputs and the discount.
de: Dieses DMN-Modell hat zwei numerische Inputs, *Unit price* und *Number of units*. Die Entscheidung *Discount* verwendet die *Number of units*, um den Output zu berechnen. Das Modell hat einen Output, den *Total price*, der aus den beiden Inputs und dem Rabatt berechnet wird.

source: Next, model the price quotation process in Signavio Process Manager, by creating the following model. Link the *Calculate price* rule task to the *Calculate price* DMN model that you created earlier.
de: Danach wird der Prozess *Price Quotation* im Signavio Process Manager erstellt. Wir verlinken das DMN-Modell *Calculate Price* mit der Geschäftsregel im BPMN-Diagramm.

source: A BPMN process model, with a *Calculate price* rule task, in Signavio Process Manager
de: Ein BPMN-Modell mit der Geschäftsregel *Calculate price* im Signavio Process Manager

source: This process model starts with a *Calculate price* rule task, which calculates a total price, followed by a user task to check the result and an send task to send the quotation. Now save the model, so you can transfer it to Workflow Accelerator.
de: Dieses Prozessmodell startet mit der Geschäftsregel *Calculate price*. Hier wird der Gesamtpreis der angeforderten Waren kalkuliert. Die nächste Aufgabe ist die Überprüfung des Angebots. Am Schluss wird das Preisangebot an den Kunden versendet. Das Modell muss nun gespeichert werden, um zu Signavio Workflow Accelerator transferiert werden zu können.

source: Next, select the BPMN model in the Signavio Explorer, and on the *Workflow Accelerator* menu, select *Execute in Workflow Accelerator*. On the dialogue box that opens, select *Transfer*, followed by *Open the workflow in Workflow Accelerator*.
de: Wählen Sie das BPMN-Diagramm nun im Explorer aus und klicken Sie im *Workflow Accelerator*-Menü, auf den Button *In Workflow Accelerator ausführen*. Klicken Sie anschließen auf *Transferieren* - *Workflow in Workflow Accelerator öffnen*.

source: In Workflow Accelerator, you now need to edit the process to make it ready for execution. In the process builder, select *Trigger* and add a trigger form. On the trigger form, add two *Number* fields and name them *Unit price* and *Number of units*.
de: Nun muss der Prozess in Signavio Workflow angepasst werden, um ihn hier ausführen zu können. Wählen Sie im Signavio Workflow Accelerator Prozesseditor den *Auslöser*-Tab und fügen Sie ein Auslöser-Formular hinzu. In diesem Fall fügen wir zwei *Zahl*-Formularfelder hinzu und nennen sie *Unit Price* und *Number of units*.

source: Select *Actions* and then select the *Calculate price* rule task to open its configuration panel. The *Inputs* shows the DMN model’s two inputs. For each input, select the process variable of the same name, that you added to the trigger form.
de: Wählen Sie den *Aufgaben*-Tab und selektieren Sie die Entscheidung, hier *Calculate Price*, um das Konfigurationspanel zu öffnen. Um die *Inputs* zu definieren, wählen Sie für jeden Input das gerade definierte Auslöser-Formularfeld.

source: Configuring a rule task’s inputs in Workflow Accelerator
de: Inputkonfiguration einer Entscheidung in Signavio Workflow Accelerator

source: Select the *Outputs* tab to configure the output variable the rule task creates. The output variable has the default name *Total price* from the DMN model.
de: Wählen Sie den *Outputs*-Tab der Konfigurationseinstellungen, um die Output- Variable festzusetzen, die von der Entscheidung erstellt wird. Die Output-Variable übernimmt zunächst den im Decision Manager konfigurierten Namen , hier *Total Price*.

source: Configuring a rule task’s outputs in Workflow Accelerator
de: Outputkonfiguration einer Entscheidung in Signavio Workflow Accelerator
