Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/action-types.po
Languages: de

source: Action Types
de: Aktions-Typen

source: The :ref:`process builder <processes>` displays actions as rounded rectangles. Actions typically have a configuration panel that opens when you select the action.
de: Aktionen werden im :ref:`Prozess-Editor <processes>` als Rechtecke mit abgerundeten Ecken dargestellt und haben typischerweise ein Konfigurationspanel, das sich beim Auswählen der Aktion öffnet.

source: User task
de: Aufgaben

source: A user task in the process editor
de: Eine Aufgabe im Prozess-Editor

source: A user task indicates that someone will perform a task. In the configuration form, you can specify the following optional details.
de: Aufgaben werden in Ihrer Organisation ausgeführt von Personen. Für eine Aufgabe stehen die folgenden Konfigurationsmöglichkeiten zur Verfügung.

source: *General* - assign a task to a user or a :ref:`process role <roles>`.
de: *Allgemein* - ein Task kann einem Nutzer oder einer :ref:`Prozessrolle <roles>` zugewiesen werden.

source: *Form* - add a form to a task; submit the form to complete the task.
de: *Formular* - Sie können ein Formular zu einer Aufgabe hinzufügen. Mit dem Absenden des Formulars wird die Aufgabe erledigt.

source: *Reminders* - task deadline notifications.
de: *Erinnerungen* - Senden Sie Erinnerungen und legen Sie Fälligkeiten fest.

source: *Escalations* - automatic task reassignment.
de: *Eskalation* - Weisen Sie die Aufgabe automatisch anderen Personen zu.

source: *Access Rights* - task permissions for users and groups.
de: *Zugriffsrechte* - Definieren Sie Zugriffsrechte für Nutzer und Gruppen.

source: General
de: Allgemein

source: Use the *General* tab to specify the task’s default assignee or candidates. You can select either individual users or organisation groups as candidates.
de: Unter *Allgemein* können Sie Verantwortliche für Aufgaben festlegen oder eine Liste von Kandidaten definieren. Kandidaten können entweder mehrere Nutzer oder Nutzergruppen sein.

source: Configuring user task assignment in the process editor
de: Zuweisung einer Aufgabe im Prozesseditor konfigurieren

source: You an also specify a role for the task’s assignment, like a BPMN swim lane, so that Signavio Workflow Accelerator automatically assigns related tasks to the same person.
de: Sie können auch Rollen für die Zuweisung nutzen. Diese ähneln den Lanes aus BPMN. Pro Fall weist Signavio Workflow Accelerator die Aufgaben einer Rolle der gleichen Person zu.

source: Task name template
de: Vorlage für Aufgabennamen

source: You can use task name templates to create dynamic task names from :ref:`variables <variables>`. Enter the task name template on the user task’s configuration panel’s *General* tab. In the text field, type a `#` to select a variable.
de: Sie können Vorlagen für Aufgabennamen verwenden, um dynamische Aufgabennamen auf Basis von :ref:`Variablen <variables>` zu erstellen. Geben Sie die Vorlage über das *Allgemein*-Tab des Konfigurationspanels ein und geben Sie `#` ein um die gewünschte Variable auswählen zu können.

source: Using a task name template to configure dynamic task names
de: Verwenden Sie Vorlagen für Aufgabennamen um dynamische Aufgabennamen zu konfigurieren

source: Use task name templates to avoid a :ref:`tasks` view that fills up with identically-named tasks.
de: Verwenden Sie Vorlagen für Aufgabennamen um zu verhindern, dass sich die :ref:`tasks` - Ansicht mit identisch bezeichneten Aufgaben füllt.

source: Form
de: Formular

source: Use the form builder to create a user task form for entering and updating data as part of the user task.
de: Benutzen Sie den Formulareditor, um neue Daten aufzunehmen oder bestehende zu verändern.

source: Reminders
de: Erinnerungen

source: Use the user task’s `Reminders` configuration panel tab to set up task deadline notifications. If you configure a `Due date` or `Reminder` period, then Workflow Accelerator will send email when the deadline expires.
de: Unter `Erinnerungen` können Sie die Fälligkeit für einzelne Aufgaben festlegen. Wenn Sie eine `Fälligkeit` oder `Erinnerung` festlegen, wird Signavio Workflow Accelerator für die von Ihnen konfigurierte Periode Erinnerungen versenden.

source: Configuring user task reminders in the process editor
de: Erinnerungen im Prozesseditor konfigurieren

source: The three settings work as follows.
de: Die drei Einstellungen funktionieren wie folgt:

source: *Due date* specifies an automatic :ref:`task due date <tasks-due-dates>` relative to the task’s creation date, which results in a :ref:`case-task-due` notification, and changes how the task appears in the :ref:`Inbox <tasks-inbox>`
de: Die *Fälligkeit* legt für die Aktivität ein :ref:`Fälligkeitsdatum <tasks-due-dates>` fest, das auf dem Erstelldatum der Aufgabe basiert. Wenn das Fälligkeitsdatum erreicht ist, verschickt das System eine :ref:`Benachrichtigung <case-task-due>` und hebt den Task in der :ref:`Aufgaben-Inbox <tasks-inbox>` besonders hervor.

source: *Reminder* works separately from the due date and only sends a :ref:`reminder <task-reminder>` notification, which you can use to remind task assignees and candidates earlier than the task deadline
de: Die *Erinnerung* ist dazu da, um schon vor dem Fälligkeitsdatum eine :ref:`Erinnerung <task-reminder>` zu versenden.

source: *Continue reminding* further configures the *Reminder* by repeating the :ref:`reminder <task-reminder>` notification up to 25 times
de: Über *Erneut erinnern alle* legen Sie fest, mit welchem Intervall :ref:`Erinnerungen <task-reminder>` wiederholt werden sollen - bis zu 25 mal.

source: Workflow Accelerator sends these notifications to the task’s assignee if the task has an assignee, or to all of the task’s candidates if the task it not assigned. If the task remains unassigned and does not have any candidates, Workflow Accelerator sends the notification to the process’ owner.
de: Signavio Workflow Accelerator sendet die Erinnerungen an den Verantwortlichen, wenn die Aufgabe einer Person zugewiesen ist. Ist die Aufgabe noch nicht zugewiesen, bekommen alle Kandidaten eine Benachrichtigung. Sollte die Aufgabe niemandem zugewiesen sein und sind auch keine Kandidaten konfiguriert, so bekommt der Prozess-Eigentümer die Benachrichtigung.

source: Escalations
de: Eskalation

source: You can also use the :ref:`Reminders <reminders>` configuration panel tab to configure escalations. Use escalations to automatically reassign a user task when a deadline expires.
de: Sie können die Konfiguration für :ref:`Erinnerungen <reminders>` auch dazu nutzen, um Eskalationen zu definieren. Mit Eskalationen werden Aufgaben nach Ablauf einer von Ihnen festgelegten Zeitspanne neu zugewiesen.

source: Configuring user task escalation in the process editor
de: Eskalationen im Prozesseditor konfigurieren

source: On the :ref:`Reminders <reminders>` configuration panel, select *Escalations*.
de: Wählen Sie im :ref:`Erinnerungen <reminders>`-Konfigurationspanel *Eskalation* aus.

source: In the *After* field, set a period to wait after the task creation date, at which point Workflow Accelerator will automatically reassign the task.
de: Legen Sie im Feld *Nach* fest, wie lange das System warten soll, bis es die Aufgabe automatisch neu zuweisen soll.

source: In the *Escalate to* field, select a user or candidate group to escalate to, who will receive a :ref:`task escalation <task-escalation>` notification.
de: Legen Sie im Feld *Eskalieren an* fest, zu welchem Nutzer oder welcher Nutzergruppe die Aufgabe eskaliert werden soll. Die Nutzer erhalten im Falle einer :ref:`Eskalation <task-escalation>` eine entsprechende Benachrichtigung.

source: Sometimes, you don’t know who will take over a task that has passed its escalation deadline, so you choose one person in the process model. Instead, you can escalate task assignment to multiple people, or select a group.
de: Manchmal wissen Sie nicht, wer eine Aufgabe, deren Eskalationsdeadline überschritten ist, übernehmen soll. In solchen Fällen können Sie die Aufgabenzuweisung an mehrere Personen oder eine Gruppe eskalieren.

source: Access Rights
de: Zugriffsrechte

source: Use the `Access Rights` tab to set permissions for viewing, assigning and completing the task. See :ref:`Restricting access to user tasks <user-task-access>` for details.
de: Mit den `Zugriffsrechten` können Sie beeinflussen, wer eine Aufgabe sehen und bearbeiten kann. Nähere Informationen hierzu finden Sie unter :ref:`Zugriff auf Aufgaben einschränken <user-task-access>`.

source: Multi-user task
de: Mehrbenutzer-Aufgabe

source: A multi-user task in the process editor
de: Eine Mehrbenutzer-Aufgabe im Prozess-Editor

source: A multi-user task indicates that a group of people will each perform the same :ref:`user-task`. You can use this to model multiple approvals, where several people in a group must approve a proposal.
de: Eine Mehrbenutzer-Aufgabe gibt an, dass eine Gruppe von Benutzern die gleichen :ref:`user-task` ausführt. Sie können diese Aufgabe verwenden, um eine Mehrfach-Genehmigung zu modellieren, in der mehrere Personen in einer Gruppe einen Vorschlag genehmigen müssen.

source: In the configuration panel, you can set the same configuration as for a user task, plus the following additional configuration.
de: Im Konfigurationspanel können Sie die gleichen Einstellungen wie bei einer Benutzeraufgabe vornehmen, außerdem sind die folgenden zusätzlichen Einstellungen möglich:

source: *General* - assign tasks to users and groups
de: *Allgemein* - weisen Sie Benutzern und Gruppen eine Aufgabe zu

source: *Results* - specify how form fields map to lists of values
de: *Ergebnisse* - geben Sie an, wie Formularfelder den Wertelisten zugeordnet werden

source: Use the *General* tab to specify the users to create tasks for. The multi-user task creates a task for each user or group member.
de: Benutzen Sie den *Allgemein*-Tab, um Benutzer zu definieren, für die die Aufgaben angelegt werden. Die Mehrbenutzer-Aufgabe legt für jeden Benutzer oder jedes Gruppenmitglied eine Aufgabe an.

source: User and group configuration for a multi-user task
de: Benutzer- und Gruppenkonfiguration für eine Mehrbenutzer-Aufgabe

source: You can also specify parallel or sequential *Execution type*. If you select *Parallel*, the multi-user task will create all of the tasks at the same time, for their assignees to complete in any order. If you select *Sequential*, the multi-user task will create one task at a time, and wait for its assignee to complete it before creating another.
de: Sie können zudem parallele oder sequentielle *Ausführungstypen* definieren. Wenn Sie *Parallel* wählen, wird die Mehrbenutzer-Aufgabe von allen Nutzern zur gleichen Zeit abgearbeitet. Wenn Sie *sequentiell* auswählen, bekommt jeweils nur ein Nutzer eine Aufgabe zu einem Zeitpunkt. Sobald dieser seine Aufgabe abgearbeitet hat, wird erst die Aufgabe für den nächsten Nutzer erstellt.

source: Results
de: Ergebnisse

source: Use the *Results* tab to map each form field to a list of values. This list collects the values entered by the people who complete the tasks that this multi-user task generates.
de: Benutzen Sie den *Ergebnisse*-Tab, um Formularfeldern einer Werteliste zuzuordnen. Diese Liste sammelt die Werte, die von den Nutzern der Mehrbenutzer-Aufgabe eingegeben worden sind.

source: Form field result mapping for a multi-user task
de: Ergebniszuordnung eines Formularfelds für eine Mehrbenutzer-Aufgabe

source: In this example, the multi-user task’s form includes a single Yes/No checkbox field with the label *Approved*. The mapping to *Approvals* creates a variable with the same type as the *Approved* form field, but which allows multiple values. Completing the tasks that the multi-user task generated adds the *Approved* values (Yes or No) to the *Approvals* list.
de: In diesem Beispiel enthält das Formular der Mehrbenutzer-Aufgabe eine einzige Ja/Nein-Checkbox mit dem Label *Genehmigt*. Die Zuordnung zu *Genehmigungen* erzeugt eine Variable mit dem gleichen Typ wie bei *Genehmigt*, jedoch sind hier mehrere Werte erlaubt. Wenn die Aufgaben, die durch die Mehrbenutzer-Aufgabe erzeugt sind, erledigt werden, werden die *Genehmigt*-Werte (Ja oder Nein) zu der *Genehmigungen*-Liste hinzugefügt.

source: To use the results of a multiple approval, use a :ref:`javascript-action` to implement whatever logic consolidates the list of results in the list into a single decision.
de: Um die Ergebnisse einer Mehrfach-Genehmigung anzuwenden, können Sie eine :ref:`javascript-action` einsetzen, um beispielsweise eine Logik zu hinterlegen, die die Ergebnisse der Werteliste zu einem Ergebnis aggregiert.

source: Send email
de: E-Mail senden

source: A send email task in the process editor
de: Eine E-Mail senden Aktion im Prozess-Editor

source: The send email action sends an email to the specified user. In the configuration you can specify the following.
de: Die *E-Mail senden*-Aktion sendet eine E-Mail an einen spezifischen Nutzer. In der Konfiguration können Sie Folgendes hinterlegen:

source: Sender name
de: Absendername

source: By default, Workflow Accelerator sends the email with the `From` field set to *Workflow Accelerator*. You can set this field to set the `From` field to your company or department name.
de: Sie können in das *Absendername*-Feld zum Beispiel den Namen Ihrer Firma oder Abteilung eintragen. Standardmäßig verschickt Signavio Workflow Accelerator Emails mit dem Absendernamen *Signavio Workflow Accelerator*.

source: To
de: An

source: The people who Workflow Accelerator sends the email to. You can enter one or more plain email addresses, or select email :ref:`variables <variables>` or users in the organization. Note that if you enter a plain email address, you must then select it from the pick list.
de: Die Adressen beziehungsweise Personen, an die Signavio Workflow Accelerator die Email verschickt. Hier können Sie eine oder mehrere Emailadressen direkt eintragen, eine :ref:`Variable <variables>` verwenden oder Benutzer Ihrer Organisation auswählen. Wählen Sie nach der Eingabe das gewünschte Feld der Auswahlliste.

source: Reply to
de: Antwort an

source: Workflow Accelerator sends emails from the address `notifications@workflow.signavio.com` (Europe server), respectively `notifications@workflow-us.signavio.com` (US server) , which you cannot reply to. If you set this field to an alternative email address, you override the address for replies to the email.
de: Signavio Workflow Accelerator verschickt die Emails über die Adresse `notifications@workflow.signavio.com` (Server Europa), beziehungsweise `notifications@workflow-us.signavio.com` (Server US). Sie können dieser Adresse nicht antworten. Wenn Sie über das `Antwort an`-Feld eine Adresse hinterlegen, werden Antworten automatisch an diese Adresse verschickt.

source: Subject
de: Betreff

source: The email subject line. To use :ref:`variables <variables>` in the subject, type a `#` and select a field from the list. If the list contains too many variables, you can just keep typing after the `#` to filter the list. You can use the arrow keys to move the section, and *Enter* to select a field. To remove a variable, just delete it the same way you delete normal text.
de: Die Betreffzeile der Email. Um :ref:`Variablen <variables>` zu verwenden, geben Sie ein `#`-Zeichen ein und wählen Sie ein Feld aus der Liste aus. Fall die Liste zu lang ist, tippen Sie nach der `#` einfach weiter, um die Ergebnisse zu filtern. Sie können mit den Pfeiltasten den gewünschten Vorschlag auswählen und die Auswahl mit *Enter* bestätigen. Eine Variable können Sie wie normalen Text wieder entfernen."

source: Attachments
de: Dateianhänge

source: To add attachments, click the *Attachments* field and select a file field from the list. The list includes trigger email attachments and file upload form fields.
de: Um Anhänge hinzuzufügen, wählen Sie das *Anhänge*-Feld aus und selektieren Sie ein Dateienfeld der Liste. Die Liste enthält Email-Anhänge von Auslösern und Dateiupload Formularfelder.

source: Body text
de: Inhaltstext

source: You can use variables in the main email body by typing a `#`, just like in the *Subject*. You can use `Markdown <http://daringfireball.net/projects/markdown/basics>`_ to format the email body by formatting text or including hyperlinks, headings or lists. Select the `Preview` tab to see how Workflow Accelerator will format your email.
de: Wie in der Betreffzeile können Sie im Inhaltstext Variablen mit dem `#`-Zeichen referenzieren. Mit `Markdown <http://daringfireball.net/projects/markdown/basics>`_ können Sie die den Text formatieren und zum Beispiel Überschriften, Listen und Links einfügen. Wählen Sie den `Vorschau`-Tab aus, um zu sehen, wie der formatierte Text aussieht.

source: Create document
de: Dokument erstellen

source: A create document action in the process editor
de: Eine “Dokument erstellen”-Aktion im Prozesseditor

source: The `Create document` action allows you to create a file that contains case information.
de: Mit der `Dokument erstellen`-Aktion können Sie Dateien erstellen, die Fallinformation enthalten.

source: When you use the :ref:`Send email action <send-email>` or :ref:`Upload file <google-drive>` to save information from a case, you use a file variable for email attachments or the file to save. You normally provide these files via a form. You can also use the `Create document` action to create a new file using data from other variables.
de: Sie können über eine :ref:`Email senden <send-email>`- oder eine :ref:`Datei hochladen <google-drive>`-Aktion Fallinformationen als Dokumente speichern. Alternativ können Sie die `Dokument erstellen`-Aktion verwenden, und so ein neues Dokument direkt erstellen.

source: Consider a shipping process whose trigger form includes details of a ‘recipient’ to ship a product to and a shipping address. This process can use a `Create document` action to prepare a shipping label for printing:
de: Nehmen wir zum Beispiel einen Versandprozess, dessen Auslöser den Kundennamen und die Lieferadresse enthält. Dieser Prozess kann eine `Dokument erstellen`-Aktion verwenden, um die Paketbeschriftung automatisch zu generieren:

source: Configuring a create document action in the process editor
de: “Dokument erstellen”-Aktionen im Prozesseditor konfigurieren

source: Select a `Create document` action in the process editor to configure the following options.
de: Wählen Sie eine `Dokument erstellen`-Aktion um Prozesseditor aus und konfigurieren Sie die folgenden Einstellungen:

source: Document name
de: Dokumentname

source: Defines the name of the file variable that will store the created document.
de: Definiert den Namen der Dateivariable, die das erstellte Dokument enthält.

source: File name
de: Dateiname

source: Defines the document’s filename. Type `#` to include placeholders for variables.
de: Definiert den Namen des Dokuments. Geben Sie ``#`` ein, um Platzhalter für Variablen zu verwenden.

source: File format
de: Dateiformat

source: Choose between Microsoft Word, plain text, and comma-separated values (CSV) file types.
de: Wählen Sie zwischen Microsoft Word, Klartext und kommaseparierten Werten (CSV) aus.

source: Use the text area to enter a template for the new document. Type `#` to include placeholders for variables, as you would in a :ref:`Send email action <send-email>`’s template.
de: Verwenden Sie das Textfeld, um ein Template für das neue Dokument einzugeben. Referenzierten Sie Platzhaltervariablen mit `#`, genau so wie im Template der :ref:`Email senden <send-email>`-Aktion.

source: Note that the `Create document` action does not currently support formatting text.
de: Hinweis: Die `Dokument erstellen`-Aktion unterstützt momentan keine Textformatierung.

source: Google Drive - Upload file
de: Google Drive - Datei hochladen

source: A Google Drive *Upload file* task in the process editor
de: Eine Google Drive *Datei hochladen*-Aktion im Prozesseditor

source: The Google Drive `Upload file` action sends one or more files to an account of your choice.
de: Die Google Drive `Dateiupload` Aktion sendet eine oder mehrere Dateien zu einem Google Drive Konto Ihrer Wahl.

source: Configuration
de: Konfiguration

source: After creating a Google Drive `Upload file` action, the configuration panel shows a button to start configuring the account.
de: Nach Erstellung einer Google Drive `Dateiupload` Aktion, wird im Konfigurationspanel ein Button angezeigt um das Konto auszuwählen.

source: When you click on the button `Configure a Google Drive account`, a pop-up window will appear that helps you integrate Workflow Accelerator with your Google Drive account.
de: Wenn Sie den Knopf `Fügen Sie ein Google Drive Konto hinzu` klicken, öffnet sich ein Dialog, der Sie durch die weiteren Schritte leitet, um die Integration zwischen Signavio Workflow Accelerator und Google Drive aufzusetzen.

source: Google will check that you have already logged in to Google. This check has three possible outcomes:
de: Google prüft nun ob Sie bereits eingeloggt sind. Die Überprüfung hat drei mögliche Resultate führen kann:

source: If you have already authenticated with a single user to Google, the set-up process skips the log in page and you go straight to the :ref:`permission screen <drive-permission>` below.
de: Wenn Sie bereits eingeloggt sind und genau ein Google Konto besitzen, werden Sie direkt aufgefordert Signavio Workflow :ref:`gewisse Aktionen zu erlauben <drive-permission>`.

source: If you haven’t authenticated with Google, you will see a log in window:
de: Falls Sie noch nicht eingeloggt sind, sehen Sie ein Login-Fenster:

source: If you have authenticated with multiple Google accounts, select the account you want to use.
de: Falls Sie mehrere Konten bei Google Drive hinterlegt haben, wählen Sie nun das gewünschte Konto aus.

source: After you have completed authentication, you’ll see the following page that allows you to give Workflow Accelerator access to your Google account.
de: Nachdem Sie erfolgreich authentifiziert wurden, sehen Sie den folgenden Dialog, über den Sie Signavio Workflow Accelerator Zugriff auf bestimmte Aktionen innerhalb Ihres Google Kontos gestatten.

source: Google Drive permission grant
de: Zugriffsbeschränkungen in Google Drive

source: After accepting the permissions, the pop up will disappear and Workflow Accelerator will have completed connecting to your account.
de: Nachdem der Zugriff gewährt wurde, schließt sich das Popup-Fenster. Damit ist die Verknüpfung zu Ihrem Konto eingerichtet.

source: Upload file action
de: Dateiupload Aktion

source: Once you have configured your Google Drive account, the `Upload file` action configuration panel displays the account and also shows the folders in `My Drive` in your Google Drive account.
de: Wenn Sie Ihr Google Drive-Konto verknüpft haben, zeigt das Konfigurationspanel alle Verzeichnisse innerhalb Ihres Kontos an.

source: Google Drive `Upload file` authenticated configuration
de: Google Drive `Datei-Upload` Konfiguration

source: Other people in your organization can see that you have configured an account, but they cannot see your email address or browse your account folders.
de: Andere Personen in Ihrer Organisation werden sehen können, dass Sie Ihren Box Account hinterlegt haben. Es ist diesen jedoch nicht möglich, Ihre Emailadresse einzusehen oder die Ordner Ihres Accounts einzusehen.

source: In the `Target folder` section you can now browse and select the folder you want to upload the file(s) to.
de: Unter `Zielordner` legen Sie fest, wo Ihre Dateien gespeichert werden sollen.
