Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/cases.po
Languages: de

source: Cases
de: Fälle

source: You can use a case as a small collaboration space for a particular goal. For example, ‘Hire employee’ or ‘Sign contract’. Cases typically represent more work than a simple task for a single person, but less than a whole project.
de: Sie können Fälle als Arbeitsbereich für ein bestimmtes Ziel verwenden. Dies können zum Beispiel Aufgaben wie 'Mitarbeiter einstellen' oder 'Vertrag unterschreiben' sein. In der Regel sind Fälle umfangreicher als normale Aufgaben die von einer Person erledigt werden können und kleiner als ein Komplettes Projekt.

source: A case breaks the goal down into concrete action items (or tasks) so you can collaborate with other people. The case brings together a set of tasks, a discussion and documents, and allows participants to share any relevant context information for the tasks.
de: Fälle können ein größeres Ziel in kleinere Teilaufgaben zu zerlegen, um die Zusammenarbeit mit Kollegen zu vereinfachen. In einem Fall können so alle relevanten Informationen rund um das Thema zusammengetragen und diskutiert werden.

source: Starting an ad-hoc case
de: Erstellen eines Ad-Hoc-Falles

source: Signavio Workflow Accelerator supports two types of cases: cases that relate to a process and ad-hoc cases. An *ad-hoc case* does not have a predefined process. It creates a collaboration space that you can use to reach a one-off goal.
de: Signavio Workflow Accelerator unterstützt zwei Arten von Fällen: Fälle, die mit einem Prozess verknüpft sind und Ad-Hoc Fälle. Ein *Ad-Hoc Fall* besitzt keinen vorgefertigten Prozess. Er ermöglicht einen Raum für Zusammenarbeit bei einzigartigen Zielsetzungen. Der Fall beinhaltet eine Anzahl von Aktionen, eine Plattform für Diskussionen und Dokumente und erlaubt Beteiligten, jeglichen für Aktionen relevanten Kontext untereinander zu teilen.

source: To create a new ad-hoc case, navigate to *Cases*; on the *Cases of* menu, select *Cases without a process*, then click *Start new case*.
de: Um einen neuen Ad-Hoc Fall zu erstellen, navigieren Sie oben zum Tab *Fälle*, im *Fälle von*-Menü wählen Sie *Fälle ohne Prozess*. In der Auswahl erscheint *Ad-Hoc Aufgabenlisten*, klicken Sie *Neuen Fall starten*.

source: Start a new task
de: Eine neue Aufgabe starten

source: Then the case header appears.
de: Nach diesem Schritt erscheint der Kopfteil des neuen Falls.

source: Enter case name
de: Einen Namen eintragen

source: Next, type the case title and hit Enter. Workflow Accelerator now creates the new case.
de: Als Nächstes benennen Sie den neuen Fall und drücken Sie anschließend auf Enter. Der neue Fall wird nun angelegt.

source: New case
de: Neuer Fall

source: Starting a new process case
de: Erstellen eines neuen Prozessfalles

source: A *process case* uses the latest version of the workflow defined by a published process. It creates a collaboration space for working towards a predefined goal.
de: Ein *Prozessfall* verwendet immer die neuste veröffentlichte Prozessversion. Der Fall erstellt einen Raum, in dem zusammen auf ein gemeinsames Ziel hingearbeitet werden kann.

source: You can create a new process case by selecting the *Start new case* button in one of three places:
de: Sie können einen neuen Fall erstellen, indem Sie den Button *Neuen Fall starten* an einem dieser 3 Orte in der Applikation klicken:

source: in the process builder, on the :ref:`versions` page, next to the latest published version
de: im Prozesseditor im Tab :ref:`versions`, rechts neben der neusten veröffentlichten Version

source: on the *Processes* page, next to the name of each published process
de: im Tab *Prozesse,* rechts neben dem Namen bei jedem veröffentlichten Prozess

source: on the :ref:`cases overview <cases-overview>` page, for the selected process.
de: im Tab :ref:`Fälle, <cases-overview>` des ausgewählten Prozesses rechts oben.

source: If the process does not define a trigger, then you enter a case name as when :ref:`start-adhoc`. Other trigger types generate their own case names, or use a :ref:`case name template <details>`.
de: Falls der Prozess keinen vordefinierten Auslöser besitzt, geben Sie einen Fallnamen ein, wie beim :ref:`start-adhoc`. Andere Auslöser-Typen generieren ihre eigenen Fallnamen oder verwenden eine :ref:`Vorlage für Fallnamen <details>`.

source: Browsing cases
de: Fälle durchsuchen

source: The *Cases* view shows an overview of cases for a single process. To open the Cases view, select *Cases* from the main menu.
de: Die *Fälle*-Ansicht zeigt alle Fälle zu einem bestimmten Prozess. Um Sie zu öffnen, wählen Sie *Fälle* im Hauptmenü aus.

source: The Cases view - cases of the ‘Hire employee’ process
de: Die Fälle-Ansicht - Fälle des 'Mitarbeiter einstellen' Prozesses

source: The table shows cases for the *Hire employee* process. You can use the menu above the table to select a different process, ad hoc cases that don’t have a process, or cases of a deleted process. Each case in the table show the case name, grey and green task status bars, and additional columns that show the values of workflow :ref:`variables <variables>`.
de: Die Tabelle zeigt alle Fälle für den Prozess *Mitarbeitereinstellung*. Sie können das Menü am oberen Rand dazu benutzen, um Fälle eines anderen Prozesses, Fälle die keinem Prozess zugeordnet sind oder Fälle gelöschter Prozesse einzusehen. Zu jedem Fall sehen Sie den Fallnamen, die Statusbalken für die abgeschlossenen, sowie noch offenen Aufgaben und weitere Spalten, die aktuelle Werte von :ref:`Variablen <variables>` im Workflow anzeigen.

source: The grey and green status bars show information about completed and open tasks when you hover the mouse cursor over them.
de: Die grauen und grünen Statusbalken zeigen Ihnen zusätzliche Informationen zu offenen und schon erledigten Aufgaben an, wenn Sie mit der Maus darüber fahren.

source: Hover over the grey bar to see a case’s completed tasks.
de: Fahren Sie über den grauen Balken, um bereits abgeschlossene Aufgaben zu sehen.

source: Hover over the open bar to see a case’s open tasks.
de: Fahren Sie über den grünen Balken, um noch offene Aufgaben im Fall zu sehen.

source: These status bars appear to the left of the workflow data columns, which you can customize.
de: Rechts von den Statusbalken finden Sie Datenspalten, die Sie auch anpassen können.

source: Use the linked case name to open the case’s details page.
de: Benutzen Sie den verlinkten Fallnamen um die Details-Seite des Falls aufzurufen.

source: Viewing case details
de: Falldetails ansehen

source: The case details view shows the case name, with case participants’ avatar pictures underneath, and the case’s task list.
de: Die Fall-Detailansicht zeigt den Fallnamen mit den Profilbildern der Prozessbeteiligten darunter und die Aufgabenliste des Falles an.

source: Case details view, showing one task and the event stream
de: Die Fall-Detailansicht zeigt eine Aufgabe und den Ereignisfeed an

source: Each case has an event stream that acts as an audit log and includes the information that case participants share during collaboration, such as comments, documents and links.
de: Jeder Fall besitzt einen Ereignisfeed das als Audit-Log dient und die Informationen beinhaltet, die Fallbeteiligte während ihrer Zusammenarbeit teilen, z.B. Kommentare, Dokumente und Links.

source: Other open activities
de: Weitere Aktivitäten

source: The *Tasks* list shows the case’s open and closed tasks. In most cases, completing the last task will close the case. However a case must sometimes wait for a sub-process, or some other activity that doesn’t correspond to a task in the *Tasks* list.
de: Die *Aufgaben*-Liste zeigt offene und geschlossene Aktivitäten eines Falls an. In den meisten Fällen wird nach der Ausführung der letzten Aktivität der Fall geschlossen. Allerdings muss ein Fall manchmal auf einen Unterprozess oder auf andere Aktivitäten warten, die nicht der *Aufgaben*-Liste entsprechen.

source: The case view lists the following types of open activity under the *Other open activities* heading, underneath the *Tasks* list:
de: Die Fallansicht listet die folgenden Arten von offenen Aktivitäten unter der Überschrift *Andere offene Aktivitäten* unter der *Aufgaben*-Liste auf:

source: :ref:`intermediate-timer-event` - which you can :ref:`skip manually <tasks-skip-timer>`
de: :ref:`intermediate-timer-event`, welches Sie :ref:`manuell überspringen <tasks-skip-timer>` können

source: For example, consider a customer invoice process that includes a payment recovery sub-process.
de: Betrachten Sie beispielsweise einen Kunden Rechnungsprozess, der den Subprozess „Rückerstattung“ enthält.

source: The case details view, showing a link to a sub-process under ‘Other open activities’
de: Die Fall-Detailansicht zeigt einen Link zu einem Unterprozess under *Weitere Aktivitäten* an

source: This *Invoice customer* example shows the following event stream, in chronological order.
de: Im Beispiel *Zahlung sicherstellen* treten die folgenden Ereignisse in chronologischer Reihenfolge auf.

source: The case started by sending an invoice by email.
de: Der Fall beginnt mit dem Senden einer Rechnung per Email.

source: The case created a *Check payment* task.
de: Im Fall wird automatisch eine *Zahlung überprüfen*-Aktivität erstellt.

source: Someone completed the *Check payment* task, with the result *Unpaid*.
de: Der *Zahlung überprüfen*-Task wird mit dem Ergebnis *nicht bezahlt* beendet.

source: The case sent a payment reminder email to the customer.
de: Das System verschickt eine Zahlungserinnerung per Email.

source: The case started a *Payment recovery* sub-process.
de: Der Fall startet den Unterprozess *Zahlung einziehen*.

source: At this stage, the case will wait for the *Payment recovery* sub-process before it creates the next task in the invoice process. Until then, the *Tasks* list will continue to only show the completed task, and the *Other open activities* list shows a link to the sub-process case.
de: Nun wartet das System auf den Abschluss des Unterprozesses, bevor es die nächste Aktivität des Falls erstellt. Bis dann wird die *Aktivitäten*-Liste lediglich abgeschlossene Aktivitäten anzeigen, während die *Weitere Aktivitäten*-Liste einen Link zum Fall des Unterprozesses enthält.

source: Configuring case view table columns
de: Die Spalten in der Fälle-Ansicht anpassen

source: The *Cases* view’s table includes columns for workflow :ref:`variables <variables>`, which usually correspond to form fields on a trigger form or in a user task. You can select which fields the Cases view shows as table columns, so you can have a clear overview of the process’ cases.
de: Die Tabelle in der *Fälle*-Ansicht enthält :ref:`Variablen <variables>` aus Ihrem Workflow. Normalerweise sind dies Formularfelder aus dem Auslöser oder Aufgaben. Sie können Konfigurieren welche Felder hier ausgewählt werden, damit Sie immer einen klaren Überblick über die Fälle Ihrer Prozesse haben.

source: To customize the table columns, open the Cases view and click the top-right *Configure columns* button.
de: Um die Spalten anzupassen, öffnen Sie die Fälle-Ansicht und klicken Sie auf *Spalten konfigurieren* in der oberen rechten Ecke.

source: Configuring table columns
de: Tabellen-Spalten konfigurieren

source: Use the drag icon on the far left of the list of columns to change the column order, and click the delete icon on the far right to remove a column. You can also use the text box to edit the column’s heading.
de: Sie können die Reihenfolge einfach per Drag & Drop ändern, wenn Sie die einzelnen Einträge am äußeren linken Rand anfassen und nach oben oder unten ziehen. Klicken Sie auf das 'X' Symbol am rechten Rand um eine Spalte zu entfernen. Selbst den Titel einer Spalte können Sie einfach ändern, indem Sie den gewünschten Titel in das Textfeld eintragen.

source: Below the list of columns, you’ll find a menu for selecting additional column to add to the table.
de: Unter der Liste mit den aktuell gewählten Spalten befindet sich ein Menü, mit dem Sie weitere Spalten zur Tabelle hinzufügen können.

source: Adding a column to the table
de: Eine Spalte zur Tabelle hinzufügen

source: The menu lists all of the workflow variables that the table does not currently include. In this example, the *Interviewer* variable has the type *User*, which means that you can access additional fields for the user’s email address, first name, ID and last name.
de: Das Menü listet alle verfügbaren Variablen auf, die momentan noch nicht in der Tabelle angezeigt werden. Da die *Interviewer*-Variable vom Typ *Nutzer* ist, stehen hier zusätzliche Felder wie zum Beispiel die E-Mail Adresse oder der Vor- und Nachname des jeweiligen Nutzers zur Verfügung.

source: Commenting on a case
de: Einen Fall kommentieren

source: Working on a case often includes collaboration with other people. You can use the case view to discuss the case with other people, which results in a discussion in the event stream.
de: Bei der Bearbeitung eines Falls arbeiten Sie oft mit anderen Personen zusammen. Über die Fallansicht können Sie den Fall mit Arbeitspartnern diskutieren. Die Diskussion wird als Ereignisfeed angezeigt.

source: Comments on a case - discussion with context
de: Kommentare eines Falls - Diskussion im Fallkontext

source: By using case comments instead of email, participants ensure that discussions retain the full context for everyone involved.
de: Durch die Verwendung von Fallkommentaren anstatt von E-Mails stellen Sie sicher, dass der volle Kontext der Diskussion für alle Beteiligten über den Fall hinweg einsehbar bleibt.

source: In the event stream, reply to existing comments to keep the discussion structured. Hover over the user avatar to see the user’s full name:
de: In dem Ereignisfeed können Sie auf existierende Kommentare antworten, um die Diskussion zu lenken. Wenn Sie mit dem Mauszeiger über das Anzeigebild eines Nutzers gehen, wird dessen vollständiger Name angezeigt:

source: Hover over the relative time to see the comment’s full time stamp:
de: Bewegen Sie den Mauszeiger über die Zeitangabe, um die genaue Datums- und Zeitangabe des Kommentars einzusehen:

source: To add a comment, type in the text box above the event stream. Everyone who has access to the case can follow the discussion. Keeping the discussion ‘inside’ the case preserves the context, which makes it easier to follow than an email conversation.
de: Um einen Kommentar hinzuzufügen, geben Sie den Text in das Textfeld über dem Ereignisfeed ein. Alle Personen, die Zugang zum Fall haben, können die Diskussion mitverfolgen. Dadurch, dass Sie die Diskussion 'direkt im Fall' halten, bleibt der Kontext erhalten. Dies erleichtert das Zuordnen von Information, insbesondere im Vergleich zu E-Mail Konversationen.

source: Sometimes, you want to direct a comment to a specific person. While entering a comment, you can ‘mention’ someone by typing a ``@`` and choosing their name from the list. When you mention someone in a comment, Workflow Accelerator sends them an email notification to bring them into the discussion.
de: In bestimmten Fällen wollen Sie einen Kommentar an eine spezifische Person adressieren. Dies erreichen Sie, indem im Textfeld ein ``@`` eingeben und den gewünschten Namen aus der anschließend angezeigten Liste auswählen. Wenn Sie jemanden in einem Kommentar erwähnen, sendet Signavio Workflow Accelerator dieser Person eine Emailbenachrichtigung.

source: Mentioning someone in a comment
de: Jemanden in einem Kommentar erwähnen

source: You can also mention two specific groups, corresponding to people working on the case. Enter ``@all`` to mention all participants in the case. Enter ``@open`` to mention the assignees of open tasks within the case.
de: Sie können zudem zwei spezifische Gruppen erwähnen, die den Fall bearbeiten (sollen). Geben Sie ``@all`` ein, um alle Personen, die in den Fall involviert sind, zu erwähnen. Geben Sie ``@open`` ein, um alle Personen zu erwähnen, denen offene Aufgaben zugewiesen sind.

source: You can also use `Markdown`_ formatting in comments, for things like text styles, headings and lists.
de: Sie können zudem `Markdown`_ in den Kommentaren verwenden, um zum Beispiel Überschriften und Listen einzufügen.

source: Using Markdown formatting in a case comment
de: Markdown zur Formatierung von Kommentaren verwenden

source: You may find Markdown most useful for adding links to external information that relates to the case.
de: Markdown ist besonders nützlich um Links zu externen Informationsquellen zu erstellen.

source: A hyperlink in a case comment
de: Einen Link in einem Kommentar verwenden

source: Attaching documents to a case
de: Ein Dokument an einen Fall anhängen

source: As well as commenting on a case, to share information with the case’s participants, you can attach documents. For example, cases in a job vacancy process might require candidate CVs. Anyone can access the case can download a case’s documents, which makes them more useful than email attachments.
de: Um Informationen zu kommunizieren, können Sie zudem Dokumente an einen Fall anhängen. Zum Beispiel ist es in einem Bewerbungsprozess sinnvoll, den Lebenslauf des Bewerbers im Fall zu hinterlegen. Jede Person, die auf den Fall Zugreifen kann, kann direkt dort den Lebenslauf herunterladen und einsehen. Dies verhindert umständliches Suchen im Email-Archiv.

source: To attach a document to a case, select the the `Upload a document` option next to where you add comments.
de: Um ein Dokument an einen Fall anzuhängen, wählen Sie die `Ein Dokument hochladen`-Option neben dem Kommentarfeld aus.

source: A document attached to a case
de: Ein an einen Fall angehängtes Dokument

source: The case’s event stream shows the document, with its file name and size. Click the icon on the right to open the document.
de: Der Ereignisfeed des Falls zeigt das Dokument mit Dateinamen und -Größe. Klicken Sie auf das *Link*-Symbol rechts um das Dokument zu öffnen.

source: If cases regularly require the same document as part of the process, you can make this clearer to people who work on cases by adding a file upload form field to a :ref:`user task form <user-task-form>`.
de: Wenn Fälle regelmäßig einen bestimmten Dokumenttyp erfordern (zum Beispiel *Lebenslauf*), ist es sinnvoll hierfür explizit ein Dateiupload-Formular zum entsprechenden :ref:`Aufgabenformular <user-task-form>` hinzuzufügen.

source: Closing a case manually
de: Fälle manuell schließen

source: You normally close a case by completing all of its tasks. However, sometimes you want to abandon a case and stop working on a it. To do this you can manually close a case.
de: Normalerweise wird ein Fall geschlossen wenn alle Aufgaben erledigt wurden. Allerdings kann es vorkommen, dass Sie einen Fall vorzeitig schließen möchten, da nicht weiter an ihm gearbeitet werden soll. In diesem Fall können Sie den Fall manuell schließen.

source: Closing a case
de: Einen Fall schließen

source: To close a case, select the ellipsis menu at the top-right of the case view, select *Close this case*, and click again to confirm.
de: Um einen Fall zu schließen, öffnen Sie das Fall-Menü in der oberen rechten Ecke der Fall-Ansicht und klicken Sie auf “Fall schließen”. Um die Aktion zu bestätigen, klicken Sie direkt danach noch einmal auf die Schaltfläche.

source: Deleting a case
de: Einen Fall löschen

source: You do not normally delete cases in Workflow Accelerator: you close cases that you have finished working on. However, you sometimes do need to delete cases, such as the test cases that you create while developing the initial versions of a process model.
de: Normalerweise werden Fälle in Signavio Workflow Accelerator nicht gelöscht, sondern geschlossen, wenn sie beendet worden sind. Dennoch kann es hin und wieder nötig sein, einen Fall zu löschen, wie z.B. Testfälle, die Sie während der Modellierung des Prozesses laufen lassen, um den korrekten Ablauf eines Falles zu prüfen.

source: To delete a case, open the case and use its right-hand actions menu to select `Delete case`.
de: Öffnen Sie zum Löschen den entsprechenden Fall und wählen Sie über das Aktionsmenü auf der rechten Seite `Löschen` aus.

source: Exporting cases data
de: Falldaten exportieren

source: You can export the information about a process’ cases to a `CSV file <https://en.wikipedia.org/wiki/Comma-separated_values>`_ that you can open in a spreadsheet. To export case data, open the :ref:`Cases overview <cases-overview>`, select a process, and then select *Export as CSV*. You may find this useful for reporting or auditing, for example.
de: Sie können Informationen über die Fälle eines Prozesses als `CSV-Tabelle <https://de.wikipedia.org/wiki/CSV_(Dateiformat)>`_ exportieren. Um Falldaten zu exportieren, öffnen Sie die :ref:`Fallübersicht <cases-overview>`, wählen Sie einen Prozess aus und klicken Sie auf *Als CSV exportieren*. Auf Basis der Exports können Sie zum Beispiel Reports erstellen und Audits vorbereiten.

source: CSV export options
de: CSV-Exportoptionen

source: Use the CSV export options to specify the ordering of exported cases, whether to filter by status (open or closed), and the output format. Try a different output format option if you have problems loading the exported CSV file into another application, such as Microsoft Excel. The output format options determine which characters the CSV output uses to quote and separate characters and lines:
de: Benutzen Sie die CSV-Exportoptionen, um die Reihenfolge der exportierten Fälle und das Ausgabeformat festzulegen. Sie können auch bestimmen, ob nach Status (offen oder geschlossen) gefiltert werden soll. Probieren Sie verschiedene Ausgabeoptionen aus, falls die exportierten CSV-Dateien nicht korrekt in anderen Applikationen, wie Microsoft Excel, angezeigt oder geladen werden. In den Ausgabeoptionen können Sie bestimmen, welche Zeichen das CSV-Ausgabesystem für Zitate und zur Trennung von Werten und Zeilen verwendet:

source: *Standard* - conventional CSV format
de: *Standard* - Konventionelles CSV-Format

source: *Excel* - Microsoft Excel compatibility mode
de: *Excel* - Microsoft Excel Kompatibilitätsmodus

source: *Excel (Northern Europe)* - better Excel compatibility for some European countries
de: *Excel (Northern Europe)* - Bessere Excel-Kompatibilität für einige europäische Länder

source: *Tabs* - separate values with tabs instead of commas.
de: *Tabs* - trennen Sie die Werte mit Tabs (Tabulatortaste) anstelle von Kommas.

source: The CSV export uses *UTF-8 text encoding*. Select *UTF-8* when opening the CSV in Microsoft Excel, for example, to preserve characters such as letters with accents.
de: Der CSV-Export verwendet *UTF-8 Text Encoding*. Wählen Sie *UTF-8*, wenn Sie die CSV-Datei in Microsoft Excel öffnen, z.B. um spezielle Zeichen, wie Buchstaben mit Akzent, beizubehalten.
