Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/integration.po
Languages: de

source: In a JavaScript action, you might need to select a Workflow Accelerator user based on external data, to assign a role. To do this, you can use the built-in ``users`` API to find a user by their email address.
de: In einer JavaScript-Aufgabe möchten Sie unter Umständen einen Nutzer auf Basis externer Daten auswählen, um so eine Rolle zuzuweisen. Hierfür können Sie die ``Nutzer``-Schnittstelle verwenden, um den Nutzer über dessen Emailadresse zu finden.

source: This example uses the value of a previously-supplied ``reviewerEmailAddress`` :ref:`type-email-address` variable to set a ``reviewer`` :ref:`type-user` variable.
de: In diesem Beispiel verwenden wir den Wert der zuvor zur Verfügung gestellten :ref:`type-email-address`-Variable ``reviewerEmailAddress``, um die :ref:`type-user`-Variable ``reviewer`` zu setzen.

source: Calling an external web service
de: Einen externen Web Service aufrufen

source: You can use variables to send process data to an external web service, using the `request module <https://github.com/mikeal/request/blob/master/README.md>`_. For example, the following script sends the value of the ``startDate`` variable in an HTTP POST request to an external web service.
de: Die verschiedenen Felder können Sie jetzt nutzen, um zum Beispiel einen externen Service anzusprechen. Wir stellen Ihnen hierfür das `request-Modul <https://github.com/mikeal/request/blob/master/README.md>`_ zur Verfügung. Das folgende Skript sendet Beispielsweise den Wert der Variable ``startdatum`` per HTTP POST Request an einen externen Web-Service.

source: This example uses a test endpoint configured using `Mocky <http://www.mocky.io/>`_ to return an HTTP response. This has the following result in the Workflow Accelerator test console:
de: Der Endpunkt im Beispiel wurde bei `Mocky <http://www.mocky.io/>`_ so konfiguriert, dass er eine HTTP Response zurück gibt. In der Signavio Workflow Accelerator-Konsole würden Sie dann die folgenden Ergebnisse sehen:

source: Updating a variable via an external web service
de: Den Wert eines Feldes mit Hilfe eines externen Web Services setzen

source: The two log statements, starting with *HTTP 200*, show the HTTP response from the web service. The response body (as set-up in Mocky) contains JSON data that includes an updated value for the ``startDate`` variable, changing the date from ``2017-08-01`` to ``2017-08-02``.
de: Die beiden mit *HTTP 200* beginnenden Logeinträge zeigen die Antwort des Web-Services. Der Response Body (der in Mocky konfiguriert wurde) beinhaltet JSON-Daten, die einen neuen Wert für das Feld ``startdatum`` beinhalten und es von ``2016-02-05`` zu ``2016-07-02`` ändern.

source: The script then parses this JSON response using ``JSON.parse`` and updates the ``startDate`` variable in Workflow Accelerator, as shown in the *Updated value* column in the test console's variables table.
de: Unser Skript parst den Wert der Response mittels ``JSON.parse`` und aktualisiert anschließend das ``startdatum`` Feld in Signavio Workflow Accelerator. Dieses Verhalten sehen Sie auch in der Spalte *Neu zugewiesener Wert* in der Test-Konsole.

source: Signavio Workflow Accelerator integrates with Salesforce workflows. You can configure this so that changes in Salesforce will automatically trigger Workflow Accelerator processes.
de: Signavio Workflow ist mit Salesforce Workflows integriert. Sie können diese Workflows so konfigurieren, dass Änderungen in Ihrem Salesforce automatisch Workflows in Signavio Workflow Accelerator auslösen.

source: Workflow Accelerator configuration
de: Salesforce konfigurieren

source: Before you can set-up Salesforce integration, you need to create an endpoint in Workflow Accelerator that Salesforce can send information to. Set this up in Workflow Accelerator as follows.
de: Bevor Sie anfangen können, müssen Sie zunächst einen Endpunkt für Salesforce in Signavio Workflow einrichten. Hierdurch wird es Salesforce ermöglicht Daten an Signavio Workflow Accelerator zu übermitteln. Gehen Sie wie folgt vor:

source: In the top-right user menu, select `Services & Connectors`.
de: Wählen Sie im Nutzermenü oben rechts `Services & Konnektoren` aus.

source: Under the Salesforce heading, enter a new trigger type name and select `Create`.
de: Um einen neuen Auslöser zu anzulegen, tragen Sie einen Namen für die Aktion (z.B. Neuer Lead wurde erzeugt) ein und wählen dann `Erstellen`.

source: Copy the generated `Endpoint URL`, or leave this window open for later.
de: Kopieren Sie den Wert `Endpunkt-URL` oder lassen Sie diese Seite für später offen. Wir werden diesen Wert im weiteren Verlauf der Konfiguration noch benötigen.

source: Salesforce configuration
de: Salesforce Konfiguration

source: Before you can enable Salesforce triggers, you need to configure Outbound messages - a kind of Salesforce workflow action. Set this up in Salesforce as follows.
de: Bevor Sie Salesforce Trigger benutzen können, müssen Sie `ausgehende Nachrichten` in Salesforce konfigurieren. Solche Nachrichten sind ein Typ von Workflow Aktionen innerhalb von Salesforce. Gehen Sie hierzu wie folgt vor:

source: Select the Setup menu item, and select `Build` → `Create` → `Workflow & Approvals` → `Workflow Rules`.
de: In Ihrem Salesforce-Account unter `Setup` wählen Sie `Einrichten` → `Erstellen` → `Workflow & Genehmigungen` → `Workflow-Regeln`.

source: Create or edit a new or existing workflow rule, and in the `Workflow Actions` section, select `Edit`.
de: Legen Sie eine neue Workflow-Regel an oder bearbeiten Sie eine Bestehende.

source: On the `Specify Workflow Actions` page, select `Add Workflow Action` and then `New Outbound Message`.
de: Im dritten Schritt `Workflow-Aktionen angeben` wählen Sie unter `Workflow-Aktion hinzufügen` den Eintrag `Neue ausgehende Nachricht`.

source: On the `Configure Outbound Message` page, configure the new `Outbound Message`, to define which object fields to send to Workflow Accelerator.
de: Im folgenden Konfigurationsdialog spezifizieren Sie nun die Daten, die an Signavio Workflow Accelerator übermittelt werden sollen. Alle Daten, die Sie hier auswählen sind später als Prozessvariablen in Workflows, die diesen Auslöser nutzen verfügbar.

source: In the `Endpoint URL` field, paste the `Endpoint URL` from the Workflow Accelerator configuration you created earlier.
de: Hier müssen Sie nun auch die Endpunkt-URL, die Sie vorher in Signavio Workflow Accelerator erzeugt haben eintragen.

source: Select `Save`. Do not forget to activate the workflow rule as soon as you have finished the configuration. To do this, click the `Activate` button at the top of the `Workflow Rule Detail` page.
de: Vergessen Sie nicht die Regel zu speichern und zu aktivieren, nachdem Sie die Konfiguration abgeschlossen haben.

source: On the `Outbound message` page, next to `Endpoint WSDL`, select the `Click for WSDL` link, which opens a web service definition file.
de: Lassen Sie sich nun noch die Details zu Ihrer `ausgehenden Nachricht` anzeigen. Neben dem Punkt `Endpunkt WSDL` klicken Sie auf `Zur WSDL-Anzeige hier klicken`.

source: Save the ``workflowOutboundMessage.wsdl`` file, which you will use to configure Workflow Accelerator, next.
de: Diese Datei benötigt Signavio Workflow Accelerator zur Kommunikation mit Salesforce. Speichern Sie diese bitte zunächst auf Ihrem PC.

source: Finish Workflow Accelerator configuration
de: Signavio Workflow AcceleratorKonfiguration

source: For the final configuration step, use the web service definition file to configure the Salesforce service in Workflow Accelerator.
de: Im letzten Schritt müssen Sie nun die WSDL-Datei, die Sie von Salesforce bekommen haben, in Signavio Workflow Accelerator hochladen.

source: In the top-right user menu, select `Services & Connectors`, and then select the Salesforce trigger type you created earlier.
de: Navigieren Sie nun im Nutzermenü oben rechts zu `Organisationseinstellungen` und dann zu `Services & Konnektoren`. Wählen Sie nun den Salesforce-Auslöser aus, den Sie zuvor erstellt haben.

source: Select `Upload document`, and select the ``workflowOutboundMessage.wsdl`` file you saved earlier.
de: Klicken Sie auf `Datei hochladen` und wählen Sie die Datei, die Sie zuvor gespeichert haben.

source: Now you can use the new :ref:`Salesforce trigger <trigger-salesforce>` in Workflow Accelerator.
de: Der :ref:`Salesforce-Auslöser <trigger-salesforce>` steht nun in all Ihren Prozessen zur Verfügung.
