Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/integration.po
Languages: de

source: Custom data connectors
de: Konfigurierbare Datenschnittstellen

source: When you define a process in Signavio Workflow Accelerator, you often include your own data in the process definition, such as the list of options for a form field. This works well for small lists that don’t change often or that belong to the process, such as a list of document statuses in a document approval process. However, fixed lists in the process definition become difficult to maintain when the data changes frequently or includes a large number of items, such as a list of products or customers.
de: Wenn Sie einen Prozess im Signavio Workflow Accelerator definieren, fügen Sie normalerweise Ihre eigenen Daten in die Prozessdefinition ein, zum Beispiel in die Optionsliste für ein Formularfeld. Dies eignet sich für kleine Listen, die sich nicht häufig ändern oder die bereits zum Prozess gehören, wie eine Liste mit dem jeweiligen Stand in einem Freigabeprozess für ein Dokument. Jedoch sind diese Listen in der Prozessdefinition schwer zu warten, wenn sich die Daten häufig ändern oder eine große Anzahl von Elementen umfasst, beispielsweise in einer Produkt- oder Kundenliste.

source: With Workflow Accelerator, you can also integrate dynamic structured data from other IT systems into your workflows. The workflow system fetches data from a third-party system using a *connector*, which a customer or a partner implements and hosts.
de: Mit Signavio Workflow Accelerator integrieren Sie Daten aus anderen IT-Systemen dynamisch in Ihre Workflows. Das Workflow-System extrahiert die Daten aus einem Drittsystem mit einer *Datenschnittstelle*, die Sie oder einer Ihrer Business-Partner bereitstellen.

source: A connector provides a web service that translates between the external system and Workflow Accelerator. The connector implements a defined interface, which Workflow Accelerator uses to access data in a format it can use. Workflow Accelerator and the connector communicate over *HTTP* or *HTTPS*, which makes it possible to implement connectors in any programming language.
de: Eine solche Datenschnittstelle bietet einen Webdienst an, der zwischen dem externen System und Signavio Workflow übersetzt”. Dadurch kann Signavio Workflow auf die Daten in einem passenden Austauschformat zugreifen. Signavio Workflow Accelerator und die Schnittstelle kommunizieren dabei über *HTTP* oder *HTTPS*. Entsprechend können Schnittstellen in einer beliebigen Programmiersprache umgesetzt werden.

source: Using a connector
de: Eine Datenschnittstelle verwenden

source: A connector can provide data to :ref:`user-task` form fields. For example, you can create a connector that provides a list of customers, which adds a *Customer* type in the form builder:
de: Ein Schnittstelle kann Daten zu :ref:`user-task` Formularfeldern liefern. Beispielsweise können Sie eine Datenschnittstelle erstellen, die eine Liste von Kunden bereitstellt, die einen *Kunden*-Typ zum Formular-Generator hinzufügt:

source: A *Customer* connector type in the form builder, at the bottom of the list of field types
de: Eine *Kundenschnittstellen-Typ* im Formular-Ersteller

source: A connector reference field:
de: Ein Datenschnittstellen-Referenzfeld:

source: makes it possible to select from a dynamic list of records
de: Ermöglicht es, aus einer dynamischen Liste von Einträgen zu wählen

source: supports auto-complete so you can work with a large number of records
de: Unterstützt die Auto-Vervollständigung, sodass Sie mit einer großen Anzahl an Einträgen arbeiten können

source: can include structured data for each record.
de: Kann strukturierte Daten für jeden Eintrag enthalten

source: Implementing a connector
de: Eine Datenschnittstelle implementieren

source: To implement a connector, you publish three different kinds of resource.
de: Um eine Datenschnittstelle zu implementieren, müssen Sie drei verschiedene Ressourcen veröffentlichen:

source: :ref:`connector-descriptor` - defines one or more record types, each of which defines a list of fields.
de: :ref:`connector-descriptor` – definiert eine oder mehrere Eintragstypen, der jeder für sich eine Liste von Feldern definiert

source: :ref:`connector-type-options` - a list of records for each record type the connector defines.
de: :ref:`connector-type-options` – eine Liste von Einträgen für jeden Typ, der die Datenschnittstelle definiert

source: :ref:`connector-type-option` - a single record from the :ref:`connector-type-options` list.
de: :ref:`connector-type-option` - einen einzelnen Eintrag aus der :ref:`connector-type-options`-Liste.

source: :ref:`connector-record-details` (optional) - all fields for one record from the list of records.
de: :ref:`connector-record-details` – Alle Felder für einen Eintrag aus der Liste der Einträge

source: Workflow Accelerator accesses the connector on the web, via the public Internet, or via a private intranet for an on-premise installation. Workflow Accelerator calls the connector’s URL the *endpoint URL*.
de: Signavio Workflow Accelerator verbindet sich mittels eines öffentlichen Internetzugangs mit der Datenschnittstelle, oder mittels eines privaten Intranets für eine On-Premise-Installation. Dann ruft es die URL der Datenschnittstelle – die *Endpoint-URL* auf.

source: For example, consider a connector that accesses a fictional customer database, that you publish at the endpoint URL ``https://example.org/connector``. In this example, each customer record has the following fields.
de: Ein Beispiel: Sie verwenden eine Datenschnittstelle einer fiktiven Kundendatenbank, die Sie auf der Endpoint-URL ``https://example.org/connector`` veröffentlichen. In diesem Beispiel hat jeder Kunde die folgenden Felder:

source: Example - customer record fields
de: Beispiel - Kunden-Datensatz

source: Property
de: Eigenschaft

source: Description
de: Beschreibung

source: Unique identifier
de: Ermöglicht die eindeutige Identifikation

source: Full name
de: Vor- und Nachname

source: Email address
de: Email-Adresse

source: Type of subscription - bronze, silver or gold
de: Typ des Abonnements – Bronze, Silber oder Gold

source: Default customer discount
de: Preisnachlass

source: Registration date
de: Datum der Registration

source: A complete example customer record, formatted as *JSON*, would then look like this::
de: Ein vollständiger als *JSON* formatierter Beispieleintrag würde so aussehen:

source: This example now includes enough information to implement a complete connector.
de: Dieses Beispiel enthält jetzt genug Informationen, um einen vollständige Datenschnittstelle zu implementieren.

source: Connector descriptor
de: Deskriptor der Datenschnittstelle

source: A connector needs a descriptor to provide basic information, such as its name and description, as well as detailed information about the structure of the data the connector provides. When you implement a connector, you must make the descriptor available as the following HTTP resource.
de: Eine Datenschnittstelle benötigt eine Beschreibung, um grundlegende Informationen bereitzustellen – wie zum Beispiel Name und Bezeichnung sowie detaillierte Informationen über die Struktur, die von der Datenschnittstelle bereitgestellt wird. Wenn Sie eine Datenschnittstelle implementieren, müssen Sie den Deskriptor als die folgende HTTP Ressource bereitstellen:

source: ``/`` - the connector’s *endpoint URL*
de: ``/`` – die Endpoint-URL der Datenschnittstelle

source: Request methods
de: Abfragemethode

source: GET - fetches the connector descriptor
de: GET - „fetched“ den Deskriptor der Datenschnittstelle

source: Response content type
de: Content-Typ der Antwort

source: Response body
de: Antwort

source: A JSON object with the following fields.
de: Die Antwort muss ein JSON-Objekt mit den folgenden Feldern enthalten.

source: Connector descriptor properties
de: Deskriptor der Datenschnittstelle

source: Unique alphanumeric key (characters a-z, A-Z, 0-9) that identifies the connector
de: Eindeutige Identifikationsnummer (von A-Z oder 0-9), um die Datenschnittstelle zu identifizieren

source: The connector name shown in the user interface
de: Der Name der Datenschnittstelle, der im Userinterface angezeigt wird

source: Detailed connector description
de: Detaillierte Beschreibung der Datenschnittstelle

source: List of one or more descriptors for record types
de: Die Liste für eine oder mehrere Deskriptoren der Eintragstypen

source: The connector version, which should increase if the provided data structure changes
de: Die Datenschnittstelle, die darüber informiert, wenn sich die Datenstruktur verändert

source: The connector protocol version, currently ``1``.
de: Die Protokollversion der Datenschnittstelle, momentan ``1``

source: For example, the JSON response body for a connector descriptor without any type descriptors would look like this::
de: Die Antwort von JSON für einen Deskriptor der Datenschnittstelle, in der die Beschreibung der einzelnen Typen fehlen, würde folgendermaßen aussehen:

source: In our example, you would retrieve the connector descriptor by sending the HTTP request ``GET https://example.org/connector/``.
de: In unserem Beispiel würden Sie die Beschreibungen der Datenschnittstelle abrufen, wenn Sie den HTTP-Request ``GET https://example.org/connector/`` absenden.

source: A **record type descriptor** describes the format of the data the connector provides, such as the format of a customer record. In the JSON response, the ``typeDescriptors`` property’s value contains an array of record type descriptor JSON objects.
de: Ein **Eintragstyp des Deskriptors** charakterisiert die Formatierung der Daten in der jeweiligen Schnittstelle, zum Beispiel die Formatierung der Kundeneinträge. In der Antwort von JSON enthält der ``typeDeskriptor`` ein Feld von Eintragstypen-Beschreibung als JSON-Objekte:

source: Record type descriptor properties
de: Optionen für Eintragstypen

source: Unique alphanumeric key (characters a-z, A-Z, 0-9) that identifies the record type within the connector descriptor, used in :ref:`connector-type-options` and :ref:`connector-record-details` URLs
de: Ein eindeutiger alphanumerischer Schlüssel (wie A-Z oder 0-9), der die Eintragstypen inmitten der Schnittstellenbeschreibungen identifiziert, wie in :ref:`connector-type-options` und den :ref:`connector-record-details` URLs.

source: The type name shown in the form builder user interface
de: Der Typname, der im Formular-Ersteller des Nutzeroberfläche angezeigt wird

source: An array of :ref:`record field descriptors <connector-field-descriptor>`
de: Ein Feld von :ref:`Deskriptoren der Eintragssfelder <connector-field-descriptor>`

source: Boolean value - ``true`` indicates that the connector provides a list of record options, used to provide a list in the user interface for user selection
de: Wahrheitswerte – ``true`` impliziert, dass die Schnittstelle eine Liste von Eintragsoptionen bereitstellt. Diese wird für eine Liste im Userinterface für die User-Auswahl verwendet.

source: Boolean value - ``true`` indicates that Workflow Accelerator can fetch single records by the ID used in the options list
de: Wahrheitswert – ``true`` impliziert, dass Signavio Workflow Accelerator einzelne Einträge mittels der ID abrufen kann, die in der Optionsliste verwendet werden.

source: For example, the JSON object for a customer record type descriptor, without any fields, would look like this::
de: Das JSON Objekt für die Typbeschreibung eines Kundeintrags, ohne Felder, würde beispielsweise so aussehen:

source: A **record field descriptor** specifies one field of a record type. A record type has a complex structure that includes one or more fields, such as a customer’s full name. Each field has a key, a name and a data type.
de: Ein **Deskriptor des Eintragsfeld** spezifiziert genau ein Feld des Eintragstyps. Ein Eintrag hat eine komplexe Struktur, die ein oder mehrere Felder einschließt, zum Beispiel den vollständigen Namen eines Kunden. Jedes Feld hat einen Schlüssel, einen Namen und einen Datentyp.

source: Record field descriptor properties
de: Eigenschaften des Deskriptors des Eintagsfelds

source: Unique alphanumeric key (characters a-z, A-Z, 0-9) that identifies the field type within the record type
de: Ein alphanumerischer Schlüssel ( von A-Z oder von 0-9), der die Feldtypen innerhalb der Einträge identifiziert

source: The field name shown in the user interface
de: Der Feldname, der im Userinterface angezeigt wird

source: A JSON object that describes field’s data type - see :ref:`connector-data-types`
de: Ein JSON-Objekt, dass die Felddatentypen beschreibt . Lesen Sie mehr unter :ref:`connector-data-types`.

source: Every record type automatically includes an ``id`` field with type ``text``, so you don’t have to define it explicitly.
de: Jeder Eintragstyp enthält automatisch seine ``id`` mit ``text``, damit Sie ihn nicht explizit definieren müssen.

source: An example for the ``fullName`` of our customer record type looks like this ::
de: Ein Beispiel für den ``fullName`` (Vor- und Nachnamen) von unserem Kundenaufzeichungstypen schaut folgendermaßen aus:

source: A complete example of our connector descriptor would look like this::
de: Ein vollständiges Beispiel von unserer Beschreibung der Schnittstelle würde folgendermaßen aussehen:

source: Record type options
de: Optionen für Eintragstypen

source: When you use a record type on a form, you will see a form field where you can enter a search query and select one of the options shown. Each result represents a record provided by the connector. In order to show a selection of different records to the user, a connector can provide a list of options for a record type.
de: Wenn Sie den Eintragstypen auf einem Formular benutzen, werden sie ein Formularfeld sehen, auf dem sie eine Suchanfrage durchführen und eine der angezeigten Optionen auswählen können. Jedes Ergebnis repräsentiert einen Eintrag, der von der Schnittstelle bereitgestellt wird. Um eine Auswahl für verschiedene Einträge für den Benutzer sichtbar zu machen, kann die Schnittstelle eine Liste mit Eintragstypen bereitstellen.

source: To make a list of options available to forms, in the :ref:`connector-descriptor`, set the ``optionsAvailable`` flag to ``true``. The connector must also make the options available as the following HTTP resource.
de: Um eine Liste der Optionen für Formulare zu erstellen, setzen Sie die ``optionsAvailable`` -Flag im :ref:`connector-descriptor` auf ``true``. Die Datenschnittstelle muss die Optionen ebenso für die folgenden HTTP Ressourcen bereitstellen:

source: URL (relative to the endpoint URL)
de: URL (Relativ zur Endpoint-URL)

source: ``/:type/options`` - with path parameter ``:type`` (a record type key)
de: ``/:type/options`` – mit den Pfadparameter ``:type`` - ein Schlüssel für den Eintragstypen

source: Query string (optional)
de: Ein String für die Suche (optional)

source: ``filter=:query`` - added when the user enters a search; ``:query`` encodes the search string
de: ``filter=:query`` – wird hinzugefügt, wenn der Benutzer eine Suchanfrage aufgibt; ``:query`` encodiert den Suchstring

source: GET - fetches the list of record type options
de: GET – fragt die Liste der Eintragstyp-Optionen an

source: An array of JSON objects, which should have a limited maximum length. Each object in the array must have the following fields.
de: Die Antwort muss ein Array mit JSON-Objekten enthalten, dessen Größe eingeschränkt ist. Jedes Objekt im Feld muss dafür die folgenden Felder aufweisen:

source: Record type options object properties
de: Optionen für Eintragstypen (einzelne Option)

source: Unique string record ID
de: Eindeutige ID des Stringeintrags

source: The text label shown in the user interface, which could aggregate multiple record fields like ``fullName (email)``
de: Das Label in der Nutzeroberfläche, das verschiedene Eintragsfelder zusammenträgt wie ``fullName (email)``

source: For example, a list of customer options, with URL ``https://example.org/connector/customer/options``, would look like this::
de: Eine Liste von Kundenoptionen mit der URL ``https://example.org/connector/customer/options`` würde beispielsweise so aussehen:

source: Record type option (single option)
de: Optionen für Eintragstypen (einzelne Option)

source: After someone selects an option, the case user interface may later display the selected option in other contexts. Connectors that set the ``optionsAvailable`` flag to ``true`` must also make it possible to look up a single option by its ID, in order to display the option name.
de: Nachdem eine Option ausgewählt wurde, zeigt die Nutzeroberfläche die Option möglicherweise in anderen Zusammenhängen an. Schnittstellen, bei denen die ``optionsAvailable``-Variable auf ``true`` gesetzt wurde, müssen es ermöglichen, eine einzelne Option über deren ID abzufragen.

source: ``/:type/options/:id`` - with path parameters ``:type`` (a record type key) and ``:id`` (the option ID)
de: ``/:type/:id`` – mit den Pfadparametern ``:type`` als ein Eintragstyp-Schlüssel und ``:id`` als als Eintragsidentifikationsnummer

source: GET - fetches a single record type option
de: GET – fragt eine einzelne Eintragstyp-Option an

source: A single JSON object, with the same fields as the objects in the :ref:`connector-type-options` response.
de: Ein einzelnes JSON-Objekt, das die selben Felder wie ein Objekt der :ref:`connector-type-options` hat.

source: For example, a single customer option, with URL ``https://example.org/connector/customer/options/1a2b3c``, would look like this::
de: Eine einzelne Kundenoption mit der URL ``https://example.org/connector/customer/options/1a2b3c`` würde beispielsweise so aussehen:

source: Record details
de: Eintragsdetails

source: When you use a connector form field to select a record, you can use the record’s data in the workflow. Workflow Accelerator only stores the record’s ID as a reference, and fetches the entire record when needed, when accessing the nested data.
de: Wenn Sie eine Schnittstelle verwenden, um einen Eintrag auszuwählen, können Sie die Daten des Eintrags im Workflow verwenden. Signavio Workflow Accelerator speichert ausschließlich die ID des Eintrags als eine Referenz, und greift erst auf den Eintrag zu, wenn er benötigt wird.

source: To make a record’s fields available, in the :ref:`connector-descriptor`, set the ``fetchOneAvailable`` flag to ``true``. The connector must also make the records available as the following HTTP resource.
de: Um ein Eintragsfeld verfügbar zu machen, setzen Sie das ``fetchOneAvailable`` -Flag im :ref:`connector-descriptor` auf ``true``. Die Schnittstelle muss die Einträge ebenso für diese HTTP Ressourcen bereitstellen:

source: ``/:type/:id`` - with path parameters ``:type`` - a record type key, and ``:id`` - a record ID
de: ``/:type/:id`` – mit den Pfadparametern ``:type`` als ein Eintragstyp-Schlüssel und ``:id`` als Eintragsidentifikationsnummer

source: GET - fetches details for a single record
de: GET - fragt die Details für die einzelnen Einträge an

source: A JSON object containing all fields of the record with the requested ID.
de: Ein JSON-Objekt, das alle Felder des Eintrags mit der angegebenen ID enthält.

source: For example, a customer record, with URL ``https://example.org/connector/customer/7g8h9i``, would look like this::
de: Ein Kundeneintrag mit der URL ``https://example.org/connector/customer/7g8h9i``, würde zum Beispiel folgendermaßen aussehen:

source: Selecting this customer record from the customer options list would give the workflow access to all of this customer’s fields.
de: Die Auswahl des Kundeneintrags aus der Optionsliste ermöglicht dem Workflow Zugriff auf alle Kundenfelder.

source: Data types and formats
de: Datentypen und Formate

source: A data type defines which kind of value and format a field in a record can have. A type descriptor represents a data type as a JSON object, whose ``name`` property contains the data type name.
de: Ein Datentyp definiert, welche Art von Werten und Formaten ein Feld des Eintrags haben kann. Eine Typenbeschreibung repräsentiert Datentype als JSON-Objekte, deren ``name``-Eigenschaften den Datentyp ``name`` enthält.

source: Data types may use additional properties for type-specific configuration. Furthermore, the expected format of a record value depends on the data type.
de: Datentypen können zusätzliche Eigenschaften für spezifische Konfigurationen aufweisen. Außerdem hängt das Format eines Eintragswerts vom Datentyp ab.

source: Choice type
de: Auswahltyp

source: A choice type represents a value from a fixed list of configured options.
de: Ein Auwahltyp repräsentiert einen Wert aus einer Liste von konfigurierbaren Optionen.

source: Values
de: Werte

source: A JSON array of choice option objects, each with ``id`` and ``name`` properties
de: Ein JSON-Array für die Auswahlobjekte mit ``id`` und ``name``

source: The ``id`` property stores a unique alphanumeric key (characters a-z, A-Z, 0-9) that identifies the option within the choice type; no two options may have the same ``id``. The user interface shows the ``name`` property’s value to the user.
de: Die ``id``-Eigenschaft enthält einen einzigartigen Schlüssel (von A-Z und 0-9), der die Optionen innerhalb des Auswahltyps identifiziert; keine zwei Optionen haben dabei dieselbe ``id``. Die Nutzeroberfläche zeigt die ``name``-Eigenschaft für den Benutzer an.

source: The data type JSON object for a choice type with three options looks like this::
de: Das JSON-Objekt für Auswahltypen mit drei Optionen sieht folgendermaßen aus:

source: A field value stores the ``id`` property’s value::
de: Ein Feldwert enthält den Wert der ``id``::

source: Date type
de: Datumstyp

source: A date represents either a date and time (such as *2012-02-14 09:20*), just a date (*2012-02-14*), or just a time (*09:20*).
de: Ein Datum ist entweder ein Datum und eine Zeit (etwa *2012-1-14 09:20*), nur ein Datum (*2012-02-14*), oder nur eine Zeit (*09:20*).

source: ``date``, ``time``, ``datetime``; specifies whether the value describes a date, a time of day or both (required)
de: ``date``, ``time``, ``datetime``; beschreibt, ob der Wert ein Datum, einen Zeitpunkt oder beides beschreibt (notwendig)

source: Date values must always use the ``YYYY-MM-DDThh:mm:ss.SSSZ`` `ISO 8601 <https://en.wikipedia.org/wiki/ISO_8601>`_ date format and the UTC time zone. For example::
de: Datumswerte müssen immer das ``YYYY-MM-DDThh:mm:ss.SSSZ`` `ISO 8601 <https://de.wikipedia.org/wiki/ISO_8601>`_ Datenformat und die jeweilige Zeitzone (UTC) verwenden. Zum Beispiel::

source: All date types use this format - ``datetime``, ``date`` and ``time``. For ``date`` and ``time`` values, execution only uses the first and last parts of the values, respectively.
de: Alle Datumstypen benutzen dieses Format - ``datetime``, ``date`` und ``time``. Für ``date``- und ``time``-Werte läuft die Ausführung dabei über den ersten und den letzten Teil dieser Werte.

source: Email address type
de: Typ der Email-Adresse

source: An email address type represents an email address.
de: Ein Typ der Email-Adresse repräsentiert eine Email-Adresse.

source: An email address value stores a plain string::
de: Ein E-Mail Adresswert enthält einen Plain-String::

source: Link type
de: Link-Typ

source: A link type represents an Internet address (a URL), such as a web site address.
de: Ein Link repräsentiert eine Internetadresse (als URL).

source: A link value stores a plain string::
de: Auch ein Linkwert enthält einen Plain-String::

source: Money type
de: Geldbetrag-Typ

source: A money type represents the combination of an *amount* and a *currency*.
de: Ein Geldbetrag-Typ beschreibt eine Kombination aus *amount* (Summe) und *currency* (Währung).
