Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/integration.po
Languages: de

source: A money value stores a JSON object with the fields ``amount`` and ``currency``. The ``amount`` property stores a number. The ``currency`` property stores an `ISO 4217 <https://en.wikipedia.org/wiki/ISO_4217>`_ currency code.
de: Ein Geldbetrags-Typ speichert ein JSON-Objekt in den Feldern ``amount`` und ``currency``. Die ``amount``-Eigenschaft speichert ein `ISO 4217 <https://de.wikipedia.org/wiki/ISO_4217>`_ Währungskürzel.

source: Number type
de: Nummern-Typ

source: A number type represents either an integer or decimal number.
de: Eine Nummern-Typ repräsentiert entweder einen Integer oder eine Dezimalnummer.

source: A number value stores a plain number, using a single ``.`` as decimal separator.
de: Ein Nummernwert speichert eine Nummer, und verwendet nur einen einzigen ``.`` als Komma.

source: Text type
de: Texttyp

source: A text type represents a string - either a single line of text or multiple lines. Optionally, to indicate that text may contain multiple lines, add the flag ``multiLine`` to the data type.
de: Ein Texttyp repräsentiert einen String – entweder über eine Zeile oder über mehrere Zeilen. Um optional anzuzeigen, dass der Text mehrere Zeilen enthält, können Sie das flag ``multiLine`` mit dem Datentypen verwenden.

source: (optional) if set to ``true`` the text field will allow multiple lines of input
de: (Optional) wenn Sie den Feldwert auf ``true`` setzen, kann der Text mehrere Zeilen enthalten

source: A text value stores a plain string::
de: Ein Textwert speichert einen String

source: Yes/No Checkbox type
de: Ja/Nein-Checkbox-Typ

source: A yes/no checkbox type represents a choice between the values ‘yes’ and ‘no’.
de: Ein Ja/Nein-Checkbox-Typ repräsentiert eine Auswahl zwischen den Werten ‘Ja’ und ‘Nein’.

source: A yes/no checkbox value stores a Boolean value - ``true`` or ``false``.
de: Damit speichert ein Ja/Nein-Checkbox einen Booleanwert zwischen ``true`` oder ``false``.

source: Configuring a connector
de: Eine Schnittstelle konfigurieren

source: To configure connectors, on the top-right menu, select *Services & Connectors*, then select the *Connectors* tab. When you have published your connector, you can add it here.
de: Um Schnittstellen zu konfigurieren, wählen Sie *Services & Konnektoren* im oberen rechten Menü aus. Wechseln Sie dann in das *Konnektoren*-Tab. Wenn Sie Ihre Datenschnittstelle schon veröffentlicht haben, können Sie diese hier hinzufügen.

source: Select *Add new connector* and enter the connector’s endpoint URL.
de: Klicken Sie auf **Neuen Konrektor hinzufügen** und tragen Sie die Endpoint-URL der Schnittstelle ein.

source: Adding a new connector with the endpoint URL ``https://example.org/connector``
de: Hinzufügen einer neuen Schnittstelle mit der Endpoint URL ``https://example.org/connector``

source: When you add a connector, Workflow Accelerator fetches the connector descriptor and shows a summary:
de: Wenn Sie eine Schnittstelle hinzufügen, übernimmt Signavio Workflow Accelerator die Beschreibung der Schnittstelle und zeigt eine Zusammenfassung dieser an:

source: Connector summary, including an overview of record and field types
de: Die Zusammenfassung der Schnittstelle enthält eine Übersicht der Einträge und Feldtypen

source: If you make changes to your connector, such as adding or renaming a field, you need to reload the configuration. On the connector’s top-right menu, select *Reload connector* to fetch the latest version of the descriptor.
de: Wenn Sie eine Veränderung an der Schnittstelle durchführen, wie zum Beispiel das Hinzufügen oder das Umbenennen von Feldern, müssen Sie die Konfiguration neu laden. Klicken Sie am rechten oberen Rand des Menüs auf **Konnektor aktualisieren**, um auf die aktuellste Version des Deskriptors zuzugreifen.

source: Deleting a connector
de: Löschen einer Schnittstelle

source: You can delete a connector if you no longer wish to use it. On the connector’s top-right menu, select *Delete connector* to remove its configuration from Workflow Accelerator. If you delete a connector by mistake, select *Add new connector* and enter the endpoint URL again.
de: Sie können eine Schnittstelle löschen, wenn Sie diese nicht länger benötigen. Klicken Sie in der oberen rechten Ecke des Menüs auf *Konnektor löschen*, um die Konfiguration von Signavio Workflow Accelerator zu entfernen. Wenn Sie eine Schnittstelle versehentlich löschen, klicken Sie auf **Neuen Konnektor hinzufügen** und tragen sie die Endpoint-URL erneut ein.

source: Authentication
de: Authentifizierung

source: Publishing a connector makes it publicly accessible, as well as any data that the connector provides. To prevent unauthorized access, the connector can implement authentication, so that only Workflow Accelerator can access the data. Connectors may use one of two authentication mechanisms.
de: Wenn Sie eine Schnittstelle veröffentlichen, machen Sie diese öffentlich verfügbar, genauso wie alle Daten, die diese Datenschnittstelle bereitstellt. Um nicht authorisierten Zugriff zu verhindern, können Sie für die Datenschnittstelle mit einen Authentifizierungsmechanismus konfigurieren, sodass nur Signavio Workflow Accelerator auf die Daten zugreifen kann. Die Datenschnittstelle kann die folgenden Authentifizierungsmechanismen verwenden:

source: Connectors can use `HTTP basic authentication <https://en.wikipedia.org/wiki/Basic_access_authentication>`_ to restrict access using a user name and password that you specify when configuring the connector. To implement HTTP Basic authentication, your connector endpoints must:
de: Datenschnittstellen können `HTTP Basic Authentication verwenden <https://de.wikipedia.org/wiki/HTTP-Authentifizierung#Basic_Authentication>`_ . Dabei verwenden Sie einen Benutzernamen und ein Password, das Sie einrichten, wenn Sie die Schnittstelle konfigurieren. Um die HTTP-Authentifizierung zu verwenden, müssen die Endpunkte Ihrer Datenschnittstellen:

source: send an HTTP *401 Unauthorized* response, with an empty response body, for any request that does not include valid credentials
de: eine HTTP *401 Unauthorized*-Antwort versenden. Der Response Body ist damit leer. Als Antwort auf jede Anfrage, die falsche Anmeldeinformationen enthält

source: check the credentials in the ``Authorization`` HTTP header field, when provided, by decoding the Base64-encoded user name and password and verifying their values.
de: die Anmeldeinformationen im ``Authorization`` HTTP-Header-Feld überprüfen, indem die Base64-enkodierten Benutzernamen und Passwort dekodiert und und ihre Werte verifiziert werden.

source: HTTP Basic authentication sends an unencrypted password over the network, so you should only allow access to private connectors via HTTPS.
de: HTTP-Authentifizierung sendet ein nicht verschlüsseltes Password über das Netzwerk. Daher sollten Sie den Zugang zu privaten Datenschnittstellen Zugriff ausschließlich über HTTPS gewähren.

source: To use basic authentication, use the *Authentication* field to select *HTTP Basic authentication*, and enter a user name and password:
de: Um HTTP Basic Authentication zu verwenden, verwenden Sie das *Authentication* Feld und wählen Sie *HTTP Basic Authentication* aus. Geben Sie dann einen Benutzernamen und ein Passwort ein:

source: Configuring basic authentication
de: HTTP Basic Authentication konfigurieren

source: When you configure a connector to use Basic authentication, Workflow Accelerator will pre-emptively include an ``Authorization`` header when sending requests to the connector endpoints. In Basic authentication, the header value consists of the authentication scheme name ``Basic`` followed by a space and the Base64-encoded user name and password, separated by a colon (``signavio:8n4f-Rm3V-Xz0r-Igew-L1fK``). This results in a request header that looks like::
de: Wenn Sie eine Datenschnittstelle konfigurieren, um HTTP Basic Authentication zu verwenden, wird Signavio Workflow Accelerator präventiv einen ``Authorization``-Header erstellen, wenn es Anfragen an die Endpunkte der Datenschnittstelle versendet. In der Basic Authentication besteht der Header-Wert aus dem Namen des Authentifizierungsschemas - ``Basic`` - auf das ein Leerzeichen und ein Base64-enkodierter Benutzername und ein Passwort folgt. Getrennt wird es durch einen Doppelpunkt (``Signavio:8n4f-Rm3V-Xz0r-Igew-L1fK'``). Dadurch entsteht ein Request-Header, der aussieht wie::

source: Sending this header with every request avoids an additional *401 Unauthorized* response and a new request for the authentication challenge.
de: Wenn Sie diesen Header bei jeder Anfrage mitsenden, vermeidet er eine zusätzliche *401 Unauthorized*-Antwort und eine neue Authentifizierungsanfrage.

source: Token authentication
de: Token-Authentifizierung

source: Similar to an API key, you can choose a password (token) that Workflow Accelerator will include in a request header field or URL query string, for every request it sends to the connector endpoints. In the connector configuration, you can choose between a request header field or a URL query string parameter, and specify the header or parameter name.
de: Ähnlich wie bei einem API-Schlüssel können Sie ein Kennwort (Token) auswählen, das Signavio Workflow Accelerator in einem Anfrage-Header-Feld oder einem URL-Abfrageparameter hinzufügt. Dies gilt für jede Anfrage, die er an den Endpunkt der Datenschnittstelle sendet. In der Schnittstellen-Konfiguration können Sie dafür zwischen einem Anfrage-Header-Feld oder einen URL-Abfrageparameter auswählen, und damit die Header- oder Parameternamen angeben.

source: Token authentication sends an unencrypted password over the network, so you should only allow access to private connectors via HTTPS.
de: Die Token-Authentifizierung sendet ein unverschlüsseltes Kennwort über das Netzwerk, sodass Sie Zugriff auf private Datenschnittstellen ausschließlich über HTTPS zulassen sollten.

source: The connector endpoints can then authenticate requests by checking the respective header field or query string parameter value.
de: Die Endpunkte der Datenschnittstelle können Anfragen authentifizieren, in dem sie die jeweiligen Header-Felder oder Abfrageparameter überprüfen.

source: To use a token in the request header, use the *Authentication* field to select *HTTP request header*, and enter a header name and header value.
de: Um einen Token im Request-Header zu verwenden, benutzen Sie das *Authentifizierungs*-Feld und wählen *HTTP Request-Header*. Dann geben Sie einen Header und Header-Wert ein.

source: Configuring request header authentication
de: Header-Authentifizierungsanfragen konfigurieren

source: HTTP headers only allow a restricted subset of ASCII characters in header names, which typically only use letters and dashes, such as `Auth-Token`. Header values only support ‘visible ASCII characters’, so to allow arbitrary authentication tokens, use a Base64-encoded value. Configuring token authentication results in a request header like::
de: HTTP-Header erlauben nur eine eingeschränkte Teilmenge von ASCII-Zeichen im Header-Namen. In der Regel verwenden Sie nur Buchstaben und Bindestriche, z. B. `Auth-Token`. Headerwerte unterstützen dabei nur 'sichtbare ASCII-Zeichen'. Um willkürliche Authentifizierungstoken zu ermöglichen, verwenden Sie einen Base64-enkodierten Wert. Das Konfigurieren von Token-Authentifizierungen resultiert in einem Request-Header wie::

source: For testing, developers may find it more convenient to retrieve the authentication from the URL query string. To use this option, select *URL query parameter* and enter a parameter name and value:
de: Zum Testen könnten Entwickler es bequemer finden, die Authentifizierung von der URL-Abfragezeichenfolgen abzurufen. Um diese Option zu verwenden, wählen Sie *URL Query Parameter* und geben Sie einen Parameternamen und Wert ein:

source: Configuring URL query string parameter authentication
de: Konfigurieren der Authentifizierung über URL-Abfrageparameter

source: This results in HTTP requests with a URL query string, like this::
de: Diese resultiert in HTTP-Anfragen, deren URL Query String folgendermaßen aussieht::

source: HTTP does not encrypt query string parameters, which typically appear in log files, so only use query string token authentication for testing a connector on a trusted network with the on-premise edition of Workflow Accelerator, and switch to a header field token for production use.
de: HTTP verschlüsselt keine Abfrageparameter, die typischerweise in Protokolldateien auftauchen. Benutzen Sie daher die Authentifizierung über Abfrageparameter ausschließlich zum Testen einer Datenschnittstelle auf einem vertrauenswürdigen Netzwerk mit der On-Premise Edition von Signavio Workflow Accelerator. Wechseln Sie für den Einsatz eines Produktes auf den Header-Token.

source: Connector examples
de: Beispiele von Datenschnittstellen

source: To help you develop your own connectors, Signavio has published several example connectors that show you what a connector implementation looks like. These examples use several different programming languages, including Java, Python, JavaScript, Scala and Go:
de: Um Ihnen zu helfen, Ihre eigenen Datenschnittstellen zu entwicklen, haben wir einige Beispiele veröffentlicht, die Ihnen zeigen, wie die Implementierung einer Datenschnittstelle aussieht. In den Beispielen verwenden wir verschiedene Programmiersprachen, insbesondere Java, Python, JavaScript, Scala und Go:

source: These examples have an open-source Apache License.
de: Die Beispiele wurden unter der Open-Source Apache Lizenz veröffentlicht.

source: You can integrate with external systems by writing JavaScript code in a :ref:`javascript-action`. Signavio Workflow Accelerator runs the code on the server, using `Node.js <https://nodejs.org>`_. As well as Node.js’ JavaScript API, scripts can use :ref:`additional libraries <javascript-libraries>`.
de: Sie können einen Workflow mit externen System über eine :ref:`JavaScript-Aktion <javascript-action>` integrieren. Signavio Workflow Accelerator führt den JavaScript-Code serverseitig mit `Node.js <https://nodejs.org>`_ aus. Neben der Node.js JavaScript-API können Sie :ref:`eine Reihe weiterer Bibliotheken <javascript-libraries>` verwenden (siehe unten).

source: JavaScript action configuration
de: Eine JavaScript-Aktion (Skript-Aufgabe) konfigurieren

source: After creating or selecting a JavaScript action, the configuration panel looks like this:
de: Nachdem Sie eine JavaScript-Aktion ausgewählt oder erstellt haben, sieht die Konfigurationsleiste zum Beispiel wie folgt aus:

source: JavaScript configuration panel
de: JavaScript Konfigurationsdialog

source: The top section of the panel contains the JavaScript text editor. By default, it already contains ``console.log('Hello World!');``. Use the `console <https://nodejs.org/dist/latest-v5.x/docs/api/console.html>`_ API for log output when testing scripts.
de: Der obere Teil des Dialogs enthält den JavaScript Editor. Standardmäßig ist bereits ``console.log('Hello World!');`` eingetragen. Verwenden Sie das `console Modul <https://nodejs.org/dist/latest-v5.x/docs/api/console.html>`_ beim testen von Scripts für den Log-Output.

source: JavaScript libraries
de: JavaScript-Bibliotheken

source: JavaScript actions support a number of popular JavaScript libraries. To import a package, use the ``require`` function:
de: Skript-Tasks unterstützen eine Reihe gängiger JavaScript-Bibliotheken. Um eine Bibliothek zu importieren können Sie unsere ``require``-Funktion verwenden.

source: You can also choose another name for the imported library:
de: Sie können für den Import auch einen anderen Namen wählen:

source: Supported JavaScript libraries
de: JavaScript-Bibliotheken

source: Library
de: Bibliothek

source: CSV generation, parsing, transformation and serialization
de: Generieren, parsen, transformieren und serialisieren von CSV-Dateien

source: Convenience functions for working with collections and values
de: Praktische Funktionen, um mit Collections und Werten zu arbeiten

source: Parse, validate, manipulate, and display dates; with `Twix <https://www.npmjs.com/package/twix>`_ date range, and `moment-business-days <https://github.com/kalmecak/moment-business-days>`_ support
de: Parsen, validieren, manipulieren und anzeigen von Daten; unterstützt `Twix <https://www.npmjs.com/package/twix>`_ Zeitspannen und `moment-business-days <https://github.com/kalmecak/moment-business-days>`_

source: Simplified HTTP request client
de: Einfacher HTTP-Request-Client

source: String validation and sanitization
de: String-Validierung und -Sanitisierung

source: The JavaScript action always imports the ``_`` (Lodash) and ``request`` packages, for backwards compatibility.
de: Die Bibliotheken ``_`` (Lodash) und ``request`` werden immer importiert, um Rückwärtskompatibilität garantieren zu können.

source: Testing scripts
de: Skripts testen

source: Use the `Test Runner` tab to test the script. Click `Start new test` to execute the JavaScript code. The test runner displays the results underneath:
de: Im unteren Teil können Sie ihr Script testen. Klicken Sie hierzu auf `Test starten`. Die Ergebnisse eines Testlaufs werden direkt darunter angezeigt.

source: JavaScript test output
de: JavaScript Test-Ausgabe

source: At the top, you see the test execution date and time. After running multiple tests, you can use this menu to select earlier test runs. The `Variable updates` section shows a table of :ref:`process variables <variables>`, with their test values and any updates. The `Logs` section shows console output and any errors.
de: Im oberen Bereich der Ansicht sehen Sie Datum und Zeit der Testausführung. Nachdem Sie mehrere Tests ausgeführt haben, können Sie über dieses Menü vergangene Testausführungen auswählen. Der Abschnitt `Variablenänderung` zeigt eine Tabelle mit :ref:`Prozess-Variablen <variables>` an und deren Werten und Änderungen an. Im `Logs`-Abschnitt werden Konsolen-Ausgaben und Fehler angezeigt.

source: Using process variables
de: Prozessvariablen verwenden

source: Next, we'll show how to work with data. Suppose that the process includes a form that has each type of field and looks like this:
de: Als nächstes zeigen wir Ihnen, wie Sie mit Daten arbeiten. Nehmen wir einmal an, im Prozess wäre ein Formular mit den folgenden Feldern definiert:

source: Form fields that declare process variables
de: Formularfelder, die Prozessvariablen deklarieren

source: On the JavaScript configuration panel, the `Add existing variable` pick list now shows the form field variables.
de: Wenn Sie die Konfiguration für die JavaScript Aktion erneut öffnen, können Sie sehen, dass im unteren Teil einige der Formularfelder als Variablen angezeigt werden.

source: Process variable selection
de: Prozessvariablen auswählen

source: Select the variables you want to access in the script. The script can access the variables using the `JavaScript variable` name from the `Variables` table. To access object variables’ fields, use the field names specified for the corresponding data type: :ref:`Case <case-variable>`, :ref:`type-email`, :ref:`type-file` or :ref:`type-user`.
de: Wählen Sie die Variablen aus, auf die Sie in der JavaScript-Aufgabe zugreifen möchten. Das Skript kann auf die Variablen über den `JavaScript-Variablen`-Namen zugreifen. Um auf die Felder von Objektvariablen zuzugreifen, verwenden Sie die Feldnamen, die in den entsprechenden Datentypen für :ref:`Fälle <case-variable>`, :ref:`E-Mails <type-email>`, :ref:`Dateien <type-file>` und :ref:`Nutzer <type-user>` spezifiziert sind.

source: In this example (below), you have selected all variables. For each variable that you select, you get an input field to specify a test value. Here you see all fields with a test value.
de: Für jede ausgewählte Variable wird ein Eingabefeld erstellt, in dem Sie Testwerte hinterlegen können. Im Beispiel haben alle Felder einen Testwert.

source: JavaScript test values
de: JavaScript-Testwerte

source: Clicking `Start new test` again to see the JSON structure of the variable data for the different variable types.
de: Geben Sie Testwerte ein und klicken Sie anschließend erneut auf `Test starten`. Sie können nun sehen, wie jedes Feld in der JavaScript-Aktion repräsentiert wird.

source: JavaScript JSON values
de: JavaScript JSON-Werte

source: The *contract* and *salesRepresentative* variables have complex types, :ref:`type-file` and :ref:`type-user`, so the table only shows an ID. The *Updated value* column shows the result of assigning new values to these variables in the script.
de: Die Variablen *vertrag* und *verwantwortlicherVertriebler* haben komplexe Datentypen - :ref:`type-file` und :ref:`type-user`. Daher zeigt die Tabelle lediglich die ID. Die Spalte *Neu zugewiesener Wert* zeigt das Ergebnis einer möglichen Neuzuweisung von Werten zu den Variablen im Skript.

source: You can use JavaScript actions to update process variables. Then, you need to make sure you *re-assign* a new value to the variable instead of mutating the variable itself. Otherwise, the system will ignore the update. For example, the system ignores ``contactEmails.push('joan.doe@example.org')``, but correctly processes ``contactEmails = [].concat([], 'joan.doe@example.org')``. This restriction doesn't apply to variables you only use in the context of the JavaScript action.
de: Sie können mit Hilfe von JavaScript-Aufgaben die Werte von Prozessvariablen anpassen. Weisen Sie hierfür der Variablen einen *neuen Wert* zu, anstatt den aktuellen Wert zu transformieren. Andernfalls ignoriert das System die Änderung. Zum Beispiel wird ``contactEmails.push(‘joan.doe@example.org’)`` nicht übernommen, während ``contactEmails = [].concat([], ‘joan.doe@example.org’)`` zum gewünschten Ergebnis führt. Diese Limitierung trifft nicht auf Variablen zu, die Sie lediglich im Kontext der JavaScript-Aufgabe verwenden.

source: To access :ref:`file <type-file>` content, you need to require the ``files`` API. In this example, ``contract`` is a file variable that references the file contents that the script reads.
de: Um auf :ref:`Datei <type-file>`-Inhalte zuzugreifen, können Sie die ``Files``-API verwenden. In diesem Beispiel ist ``contract`` eine Datei-Variable, die Sie in der entsprechenden JavaScript-Aufgabe anlegen müssen.

source: The following example loads a CSV file and parses its content:
de: Das folgende Beispiel lädt eine CSV-Datei und parst dessen Inhalt:

source: Updating case information
de: Fallinformationen aktualisieren

source: The process variables always include the built-in :ref:`Case <case-variable>` variable, which contains information about the current case. Sometimes, you want to update this case information using data from process variables. You can update some of the this case variable's fields, as follows.
de: Prozessvariablen enthalten immer eine :ref:`Fall <case-variable>`-Variable, die Informationen über den aktuellen Fall enthält. In bestimmten Fällen möchten Sie diese Informationen mit Daten von Prozessvariablen aktualisieren. Hierfür können Sie Felder der Fallvariablen wie folgt anpassen:

source: A :ref:`case name template <details>` can only use :ref:`form-trigger` fields to set the case name when the process starts. However, when you can set the case name directly in a JavaScript action, you don’t have this restriction.
de: Ein :ref:`Fallnamen-Template <details>` kann ausschließlich :ref:`form-trigger`-Felder verwenden, um den Fallnamen zu setzen, wenn der Prozess beginnt. Wenn Sie den Fallnamen jedoch über eine JavaScript-Aktion setzen, trifft diese Restriktion nicht zu.

source: Looking up Workflow Accelerator data
de: Signavio Workflow Accelerator-Daten abrufen
