Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/process-builder.po
Languages: de

source: To import a process model, on the `Processes` page, click the `Import BPMN` button and select the BPMN XML file.
de: Um ein Prozessmodell zu importieren, wechseln Sie in die `Prozesse`-Ansicht, klicken Sie auf `BPMN importieren` und wählen Sie eine BPMN 2.0 XML Datei aus.

source: The `Import BPMN` button on the `Processes` page
de: Die `BPMN importieren`-Schaltfläche der `Prozesse`-Ansicht.

source: Effektif does not support all BPMN 2.0 elements, so the process may appear differently in Effektif. In particular:
de: Effektif unterstützt nicht alle BPMN 2.0 Elemente. Ein importierter Prozess wird in Effektif unter Umständen also verändert dargestellt. Berücksichtigen Sie insbesondere Folgendes:

source: BPMN swim lanes become :ref:`roles <roles>` in Effektif
de: BPMN Swim Lanes werden in Effektif zu :ref:`Rollen <roles>`

source: tasks become :ref:`user tasks <user-task>` in Effektif
de: Task werden in Effektif zu :ref:`User Tasks <user-task>`

source: unsupported elements, such as timer events, are removed.
de: Nichtunterstützte Element, wie zum Beispiel Zeit-Startereignisse, werden entfernt.

source: A role is a process-specific name for whoever performs one or more process tasks. You can optionally configure a role with a list of canidates. Roles are equivalent to swimlanes in BPMN.
de: Eine Rolle ist ein prozessspezifischer Bezeichner für eine Person oder Organisationseinheit, die eine oder mehrere Prozessaufgaben ausführt. An einer Rolle kann eine Liste möglicher Kandidaten hinterlegt werden. Rollen entsprechen Swimlanes in BPMN.

source: For example, when you have a meeting, one person sometimes takes the role of chairperson. That person doesn’t have the job title *Meeting chair* - it’s just a role they’ve adopted for the length of the meeting.
de: Wenn Sie Beispielsweise ein Meeting durchführen, kann eine Person die Rolle der Meetingsleitung übernehmen - möglicherweise hat die Person die Rolle jedoch lediglich für die Zeit des Meetings inne.

source: A process in Effektif can define roles, in the same way that a business meeting ‘process’ has roles for whoever chairs the meeting (the ‘Chair’) and whoever takes minutes (the ‘Secretary’). The following meeting process model assigns the tasks on the top row to the *Chair* and the tasks on the bottom row to the *Secretary*.
de: Dementsprechend werden Rollen in Effektifprozessen verwendet. Das folgende Meeting-Prozessmodell ordnet die Aufgaben in der oberen Reihe der **Meetingsleitung** zu und die Aufgaben in der unteren Reihe der Meetingsassistenz.

source: A *Meeting* process, with tasks for *Chair* (top row) and *Secretary* (bottom row) roles
de: Ein *Meeting*-Prozess mit Aufgaben für die Rollen *Meetingsleitung* (obere Reihe) und *Meetingsassistenz* (untere Reihe)

source: In each meeting (each :ref:`cases <cases>` in Effektif), one person is assigned as chair, and one as secretary. These assignments generally don’t change during a meeting. Similarly, Effektif role assignments don’t change during a case: each new task with a role assignment is automatically assigned to the person who the role was assigned to.
de: Rollen können ad-hoc eingenommen werden. In jedem Meeting (jedem :ref:`Fall <cases>` in Effektif) wird einer Person die Aufgabe der Meetingsleitung übertragen und einer weiteren Person die Rolle der Meetingsassistenz. Während eines Falldurchlaufs ändern sich Rollenzuweisungen nicht: Jeder neue Task einer Rolle wird automatisch der entsprechenden Person zugewiesen.

source: In Effektif, a process role is a kind of workflow variable that is used for assigning tasks. A role is a variable of type user that stores a single user.
de: Eine Prozessrolle in Effektif ist eine Art Workflowvariable, die für die Zuweisung von Aufgaben verwendet wird. Eine Rolle ist eine Variable des Typs *Nutzer* - sie referenziert pro Aufgabe genau einen Nutzer.

source: These process roles are not the same as organization roles. For example, you can be a *Team lead* in your organization, which can be a position without an end date. A process role, such as *Meeting chair*, has a different scope and only applies for the duration of a single case.
de: Diese Prozessrollen entsprechen nicht zwingend Organisationsrollen. Sie können zum Beispiel in Ihrer Organisation die Rolle des *Team Leads* einnehmen und diese Rolle für unbegrenzte Zeit innehaben. Eine Prozessrolle wie *Meetingsleitung* wird hingegen lediglich im Kontext eines einzelnen Falles zugewiesen.

source: To assign a role to a user task, open the task’s configuration panel, select the `Assignment` tab, and use the `Assign using a role` menu on the right-hand side.
de: Um eine Rolle einer Nutzeraufgabe zuzuweisen, öffnen Sie die Konfigurationsleiste der Aufgabe, wählen Sie das `Allgemein`-Tab aus und verwenden Sie das `Zuweisen mittels einer Rolle`-Menü auf der rechten Seite.

source: To assign a role, use the menu to create a new role or select an existing role
de: Um eine Rolle zuzuweisen, verwenden Sie das Menü um eine neue Rolle zu erstellen oder eine Existierende auszuwählen.

source: You can also use the edit icon next to the role name to rename the role.
de: Sie können zudem das Editierungsicon neben der Rolle anwählen, um die Rolle umzubenennen.

source: Role candidates
de: Kandidaten für eine Rolle

source: You can use a role to assign multiple tasks a person from a group of candidates. For example, you might have a support process that includes three user tasks that are assigned to a support engineer.
de: Über eine Rolle können Sie mehrere Aufgaben einer Person aus einer Gruppe von Kandidaten zuweisen. In einem Supportprozess kann es zum Beispiel drei Nutzertasks geben, die einem Kundenbetreuer zugewiesen sind.

source: Instead, assign the three tasks to a new role called ‘Support engineer’, and add the relevant people as candidates for the role.
de: Weisen Sie die drei Aufgaben einer neuen Rolle zu. Nennen Sie die Rolle 'Kundenbetreuer' und fügen Sie relevante Personen als Kandidaten für die Rolle hinzu.

source: Creating the first task that has a role will notify all of the candidates for the role. When one of the candidates takes the task, the subsequent tasks with the same role will be assigned to the same person. That’s more efficient because this person has the context knowledge about that case.
de: Sobald die erste Aufgabe erstellt wird, die einer bestimmten Rolle zugewiesen ist, werden alle Kandidaten für diese Rolle informiert. Wenn eine Person die Aufgabe übernimmt, werden auch alle weiteren Aufgaben der Rolle dieser Person zugewiesen. Dies ist effizienter, da die entsprechende Person schon das kontextspezifische Fallwissen besitzt.
