Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/processes.po
Languages: de

source: Processes
de: Prozesse

source: A process defines a template for automating repetitive work, like a recipe that describes the actions that you perform to achieve a goal. For example, consider a `Hire employee <https://www.signavio.com/workflow-examples/hire-employee/>`_ process. Each time an organization hires someone, the recruitment team has to complete a number of tasks, including ‘Evaluate CV’, ‘Plan interview’ and ‘Interview candidate’. Each time someone starts the process, Workflow Accelerator creates a new case.
de: Ein Prozess beschreibt eine Vorlage für sich wiederholende Arbeitsabläufe, wie eine Anleitung, das die Aktionen beschreibt, die Sie durchführen müssen um ein bestimmtes Ziel zu erreichen. Stellen Sie sich z.B. einen `Einstellungsprozess <https://www.signavio.com/de/workflow-beispiele/hrmitarbeiter-einstellen/>`_ vor. Jedes Mal, wenn eine Organisation eine neue Person einstellt, muss das Personalteam gewisse Aufgaben erledigen, z.B. 'Lebenslauf evaluieren', 'Interview planen' und 'Interview ausführen'. Jedes Mal, wenn jemand diesen Prozess startet, erstellt Signavio Workflow Accelerator einen neuen Fall.

source: Use the process builder to create and configure executable processes. You can think of an executable process as a kind of software, but you will find it easier to build automation using processes. With Workflow Accelerator, non-technical people can create useful processes.
de: Mit dem Prozesseditor können Sie ausführbare Prozesse erstellen und bearbeiten. Ein ausführbarer Prozess ist eine IT-Lösung zur Ausführung eines Geschäftsablaufs. Die Automatisierung von Prozessen mit Signavio Workflow red:`form builder <form-builder>` ermöglicht es auch Fachanwendern ohne technisches Wissen und Zugriff auf eine IT-Entwicklungsabteilung, Prozesse zu erstellen und auszuführen.

source: Browsing processes
de: Prozesse auswählen

source: Select *Processes* in the main menu to browse your organization's processes. Each process has an icon that indicates what kind of :ref:`trigger <triggers>` it has, the process owner’s avatar and the process name. You can also add labels to categorize processes. If you have published a process, you can use the button to :ref:`start a new case <start-process>`.
de: Wählen Sie im Hauptmenü *Prozesse* aus, um die Prozesse Ihrer Organisation einzusehen. Jeder Prozess hat ein Icon, das den Typ des :ref:`Auslösers <triggers>` widerspiegelt und zeigt den Avatar des Process Owners, sowie den Prozessnamen an. Sie können zudem Labels hinzufügen, um die Prozesse zu kategorisieren. Falls Sie einen Prozess veröffentlicht haben, können Sie per Klick :ref:`einen neuen Prozess starten <start-process>`.

source: Filtering the processes list
de: Die Prozess-Liste filtern

source: To make it easier to browse a long processes list, you can filter the list so it only includes the processes you want. You can use a combination of several filters, to limit the list to processes that match the selection.
de: Um eine einfachere Übersicht über bestimmte Prozesse zu ermöglichen, können Sie die Prozessliste filtern. Hierfür können Sie eine Kombination verschiedener Filter verwenden.

source: *Labels* - select one or more labels
de: *Labels* - wählen Sie ein oder mehrere Labels aus

source: *Owner* - select a user
de: *Eigentümer* - Wählen Sie einen Nutzer aus

source: *Trigger* - select a trigger type: *Email*, *Form*, *Manual*, *Salesforce* or *Signavio Approval Workflow*
de: *Auslöser* - wählen Sie den Auslöser-Typ aus: *E-Mail*, *Formular*, *Manuell*, *Salesforce* oder *Prozess-Approval Workflow*

source: *More Filters* - select a publication status: *Published* or *Unpublished*
de: *Weitere Filter* - wählen Sie einen Veröffentlichungsstatus aus: *Veröffentlicht* oder *Nicht veröffentlicht*

source: To remove a filter, select it again.
de: Um einen Filter zu entfernen, wählen Sie ihn erneut aus.

source: Creating a process
de: Einen neuen Prozess erstellen

source: To create a process, select *Processes* in the main menu, then the *Create new process* button. In the text input field, enter a process name.
de: Um einen neuen Prozess zu erstellen, klicken Sie im *Prozesse*-Tab rechts oben auf *Neuen Prozess erstellen.* Geben Sie einen Prozessnamen in das dann erscheinende Feld ein.

source: Choosing a good process name
de: Einen guten Prozessnamen wählen

source: Use the following guidelines to choose a good process name, to make the list of processes easier to read and talk about.
de: Verwenden Sie die folgenden Richtlinien, um einen guten Prozessnamen zu wählen. Dies kann nützlich sein, um sich schneller im Tool zurecht zu finden und dabei helfen, Prozesse effektiver zu diskutieren.

source: Describe the process goal.
de: Beschreiben Sie das Prozessziel.

source: Use an imperative verb phrase that completes a sentence like *For your next job, you have to…*
de: Formulieren Sie eine klare Anweisung, die einen Satz wie *Bei dieser Aufgabe, müssen Sie...* vollendet.

source: Use more than one word, to get a descriptive name.
de: Verwenden Sie mehr als ein Wort, um einen Namen zu bekommen, der den Vorgang beschreibt.

source: Avoid using more than three or four words.
de: Verwenden Sie nicht mehr als drei oder vier Wörter.

source: Avoid vague words like ‘manage’, ‘do’, ‘process’ or ‘handle’.
de: Vermeiden Sie ungenaue Formulierungen wie 'Bearbeiten Sie...' , 'Verwalten Sie...' oder 'Machen Sie...'

source: *Hire employee*, for example, summarises a process better than *Recruitment*.
de: Die Beschreibung 'Mitarbeiter Einstellen' fasst einen Prozess z.B. besser zusammen, als 'Recruitment'.

source: If you group or annotate process names by adding prefixes or suffixes, consider using :ref:`process-labels` instead.
de: Falls Sie Ihre Prozesse über Präfixe oder Suffixe gruppieren oder kategorisieren, empfehlen wir Ihnen über die Verwendung von :ref:`Labels <process-labels>` nachzudenken.

source: Next steps for a new process
de: Weitere Schritte bei der Erstellung eines Prozesses

source: Once you have created a process, continue to build the process model using the following process builder sections.
de: In den folgenden Sektionen des Prozesseditors können Sie den Prozess nach seiner Erstellung weiter konfigurieren.

source: :ref:`triggers` determine how you start new cases for the process
de: Im Tab :ref:`triggers` definieren Sie, wann neue Fälle für den Prozess gestartet werden.

source: :ref:`actions` define the flow for tasks and other steps in the process
de: Im Tab :ref:`actions` definieren Sie den Sequenzfluss für Aufgaben und andere Prozessschritte.

source: :ref:`details` include process metadata and access control.
de: Der Tab :ref:`details` beinhaltet Prozess-Metadaten und die Zugangskontrolle.

source: When several departments in your organization create processes, the :ref:`processes list <processes-list>` becomes full of other people’s processes. Labels categorize processes so you can filter the list by label.
de: Wenn mehrere Abteilungen in Ihrer Organisation Prozesse erstellen, füllt sich die :ref:`Prozessliste <processes-list>` mit Prozessen, die nicht für alle Nutzer relevant sind. Mit Labels können Sie Prozesse kategorisieren und den Kategorien entsprechend filtern.

source: After creating a process, select *Click to add labels* to choose one or more labels from a list. The list starts with a set of default labels that administrators can :ref:`configure <labels>`. Select a label’s delete icon to remove it from a process.
de: Nachdem Sie einen Prozess erstellt haben, klicken SIe auf *Klicken, um Labels hinzuzufügen* und wählen Sie ein oder mehrere Labels aus der Liste aus. Die Liste enthält einige Standard-Labels und kann von den Administratoren Ihrer Organisation :ref:`konfiguriert werden <labels>`. Wählen Sie das *Entfernen*-Icon eines Labels aus, um es vom Prozess zu entfernen.

source: Triggers
de: Auslöser

source: A trigger in a process specifies how the process starts. Triggers do not have any relation to :ref:`start events <start-event>`.
de: Auslöser definieren wie ein Prozess gestartet wird. Bei Signavio Workflow gibt es keinen Zusammenhang zwischen Auslösern und Start Events, wie Sie sie vielleicht aus BPMN kennen. Weitere Informationen hierzu finden Sie unter :ref:`Startereignisse <start-event>`.

source: Manual trigger
de: Manuell

source: A manual trigger gives you the simplest way to start a process. With a manual trigger, you start processes manually in Signavio Workflow Accelerator, by selecting `Start new case` and then selecting the process to start.
de: Am einfachsten Starten Sie einen Prozess manuell. Klicken Sie hierfür auf `Neuen Fall starten` in der Prozessliste.

source: Form trigger
de: Formular

source: With a form trigger, you use a form to start a process. After selecting the form trigger, use the :ref:`form builder <form-builder>` to specify form fields.
de: Wenn Sie eine Formular-Auslöser erstellen, müssen Nutzer ein Formular ausfüllen, um neue Prozesse zu starten. Das Formular selbst können Sie dann mit dem :ref:`Formulareditor <form-builder>` erstellen.

source: Form trigger configuration - using the form builder to define a trigger form
de: Formular-Auslöser Konfiguration - Nutzen Sie den Formular-Editor um den Auslöser zu erstellen

source: For some processes, such as an HR request from an employee, the person who starts the case doesn’t have access to view the case. This means that after using a form trigger to start a case, they don’t see the case details view, and might not know that the case started successfully. For these processes, you can now use the *Confirmation Message* template to show a message to the case creator.
de: Für einige Prozesse - zum Beispiel für HR-Anfragen von Mitarbeitern - hat die Person, die den Fall startet, keine Berechtigungen, den Fall einzusehen. Dies bedeutet, dass diese Personen keine Falldetails einsehen können, nachdem Sie das Formular zum Starten des Falls ausgefüllt haben. Um in solchen Fällen zu verdeutlichen, dass der Fall erfolgreich gestartet wurde, können Sie *Bestätigungsnachrichten* verwenden, die dem Fallersteller anzeigen, dass ein Fall erfolgreich gestartet wurde.

source: Form trigger confirmation - shown to the case creator after starting a case
de: Formular-Auslöser Konfiguration - Nutzen Sie den Formular-Editor um den Auslöser zu erstellen

source: In the template, you can use placeholders to insert trigger form field values. If you do not define a confirmation message, then you won’t see a confirmation page when the case starts.
de: In Templates können Sie Platzhalter verwenden, um Werte aus Formularauslösern einzufügen. Falls Sie keine Bestätigungsnachricht konfigurieren, wird keine Bestätigungsseite angezeigt, bevor ein Fall gestartet wird.

source: Email trigger
de: Email-Auslöser

source: An email trigger starts a new case for each email that you send to the trigger’s Workflow Accelerator email address. Note this differs from reading an existing email account, such as your own. After selecting the email trigger, you can see its email address:
de: Hierbei wird für jede Email, die an die entsprechende Email-Adresse des Prozesses geschickt wird, ein neuer Fall erstellt. Die Adresse, die Sie hierfür nutzen müssen, wird in der Beschreibung des Auslösers angezeigt:

source: Mail trigger configuration
de: Konfiguration des Emailauslösers

source: The email trigger creates a :ref:`trigger-email-variable`.
de: Der Email-Auslöser erstellt eine :ref:`trigger-email-variable`.

source: You can use an email trigger by adding the trigger email address to a mailing list, such as `support@example.com `or `info@example.com`. You’ll have to ask the administrator of the mailing list to add the process trigger’s email address to the list. Once you have done this, the process trigger address will also receive any email sent to the mailing list, starting the process in Workflow Accelerator. You will then see the email in the event stream:
de: Sie können Email-Auslöser mit Mailinglisten, wie zum Beispiel `support@example.com` oder `info@example.com`, verknüpfen. Bitten Sie hierzu den Administrator der Mailingliste, die Email-Adresse des Auslösers in die Mailingliste aufzunehmen. Anschließend wird mit jeder Email an die Liste ein neuer Fall des Prozesses in Signavio Workflow Accelerator ausgelöst. Die Email taucht entsprechend im Ereignisstream auf:

source: Trigger mail in stream
de: Startemail im Stream

source: Salesforce trigger
de: Salesforce

source: A Salesforce trigger starts a new case in response to Salesforce sending an outbound message as part of a Salesforce workflow. Before you can use a Salesforce trigger, configure :ref:`Salesforce Integration <salesforce-integration>`.
de: Prozesse können auch durch eine Nachricht von Salesforce gestartet werden nachdem dort eine bestimmte Aktion erfolgt ist. Bevor Sie den Salesforce-Auslöser nutzen können, müssen Sie ihn wie hier beschrieben konfigurieren: :ref:`Salesforce Integration <salesforce-integration>`.

source: When you have configured a Salesforce service, you can select it as a process trigger, so that messages from Salesforce will now trigger new cases.
de: Nachdem Sie einen Salesforce Service konfiguriert haben, können Sie ihn als Auslöser nutzen.

source: Example of a Salesforce trigger
de: Beispiel eines Salesforce-Auslösers

source: In the process definition, you can use the Salesforce object fields from the Salesforce message just like normal :ref:`variables <variables>`.
de: In der Prozessdefinition können Sie nun auch Felder, die in der Nachricht von Salesforce enthalten sind, wie normale :ref:`Variablen <variables>` nutzen.

source: Actions
de: Aktionen

source: Actions represent the steps in a process - things to do. Action include things like user tasks in Workflow Accelerator, operations on a file in a document management system or any other actions that represent work that someone will perform as part of a process. When starting a process, Workflow Accelerator will ‘execute’ the actions in a process in the proper order. The process :ref:`control flow <control-flow>` determines this ordering, using transitions, gateways and events.
de: Aktionen repräsentieren die einzelnen Schritte eines Prozesses - was zu tun ist. Aktionen beinhalten Dinge wie Aufgaben in Signavio Workflow Accelerator, Datenoperationen in einem Datenmanagementsystem oder beliebige andere Aktionen die Arbeitsschritte repräsentieren, die jemand als Teil eines Prozesses ausführen muss. Wenn ein Prozess gestartet wird, wird Signavio Workflow die Aktionen des Prozesses in der geplanten Reihenfolge 'ausführen'. Der :ref:`Kontrollfluss <control-flow>` des Prozesses bestimmt diese Ordnung unter der Verwendung von Transitionen, Gateways und Ereignisse.

source: A process can include different :ref:`action-types`. A user task will create a task in a case. A ‘Send Email’ action will send an email. A ‘Google file upload’ action will upload a file to a Google Drive folder.
de: Ein Prozess kann verschiedene Arten von :ref:`action-types` beinhalten: Eine Aufgabe erstellt eine Aufgabe in einem Fall, eine `Email Senden` Aktivität verschickt eine Email und eine `Google Dateiupload` Aktion lädt eine Datei in einen Google Drive Ordner hoch.

source: The *Process builder*’s actions palette
de: Die Palette an Aktionen im *Prozess-Editor*

source: The `BPMN <http://en.wikipedia.org/wiki/Business_Process_Model_and_Notation>`_ diagram editor shows actions and control flow elements, such as events and gateways. Use the diagram editor to add sequential flows between actions, decisions and other control flow behaviour.
de: Der `BPMN <http://en.wikipedia.org/wiki/Business_Process_Model_and_Notation>`_ Diagrammeditor zeigt Ihnen die einzelnen Aktionen, sowie Kontrollflusselemente wie Events und Gateways an. Sie können mit dem Editor Sequenzflüsse zwischen den Aktivitäten erstellen, Entscheidungen hinzufügen oder auf andere Weise den Kontrollfluss beeinflussen.

source: Adding a transition
de: Transitionen hinzufügen

source: You can create a transition in the `Advanced flows` view. A transition specifies sequential flow, which means the next action only starts when someone has completed the previous one.
de: Transitionen können im `Prozessfluss-Editor` erzeugt werden. Sie beschreiben einen sequenziellen Fluss durch den Prozess. Dies bedeutet, dass Aktionen nur dann ausgeführt werden, wenn die vorangehenden Aktionen bearbeitet wurden.

source: To add a transition, click to select the first action. Several symbols appear to the right of the selected element:
de: Um eine Transition hinzuzufügen klicken Sie auf eine Aktion im Prozess. Darauf erscheinen neben der Aktion einige Symbole.

source: Start creating a transition by dragging the transition symbol to the destination
de: Um eine Transition zu erzeugen, ziehen Sie das Transitions-Symbol auf die Zielaktion

source: Click the transition symbol |transition-symbol| and drag it to the destination element. When you drag the symbol over the destination element, it indicates that you can drop to create the transition:
de: Klicken Sie das Transitions-Symbol |transition-symbol| und ziehen Sie es auf das Zielelement. Wenn Sie sich mit dem Mauszeiger über dem Zielelement befinden und es mit der aktuellen Aktivität verbunden werden kann, leuchten die Ecken grün auf und ein grüner Haken erscheint neben dem Transitions-Symbol.

source: Creating a transition hovering over destination
de: Ziehen Sie die Transition auf das Zielelement.

source: Release the mouse button over the destination to create the transition.
de: Um die Transition endgültig zu erzeugen lassen Sie die Maus los.

source: Creating the next user task
de: Folgeaufgaben erstellen

source: You can easily create the next User Task in a process in the same way you created transitions, above. Start by selecting the previous action:
de: Die nächste Aufgabe nach einer bereits bestehenden Aufgabe zu erstellen ist ganz einfach: Gehen Sie auf ähnliche Weise vor, wie schon bei den Transitionen. Zunächst markieren Sie die Aktion auf die die neue folgen soll.

source: Start creating the next user task by dragging the action symbol
de: Erstellen Sie Folgeaufgaben in dem Sie das Aktions-Symbol ziehen.

source: Click the rounded rectangle symbol |task-symbol| and drag it to an empty place on the canvas.
de: Klicken Sie das Aufgaben-Symbol |task-symbol| und ziehen Sie es an die Stelle, wo die neue Aufgabe erstellt werden soll.

source: Drag the rounded rectangle symbol to an empty place
de: Ziehen Sie das Aufgaben-Symbol an die gewünschte Stelle

source: Drop the symbol where you want to create the next user task. Release the mouse button to create new user task where you dropped it, with a transition from the previous action.
de: Lassen Sie das Symbol an der Stelle los, wo die neue Aufgabe erstellt werden soll. Zwischen der neuen Aufgabe und der bereits bestehenden wird automatisch eine Transition erstellt.

source: Adding the next user task and its transition at the same time
de: Fügen Sie Folgeaufgaben inklusive der Transition hinzu

source: Alternatively, just click the user task icon |task-symbol| to create a new user task in the default location, with a transition.
de: Alternativ können Sie einfach auf das Aufgaben-Symbol klicken um eine Folgeaufgabe an der Standardposition etwas weiter rechts neben der bestehenden Aktion zu erstellen.

source: Changing the action type
de: Den Aktionstyp verändern

source: Sometimes, modifying a process means changing an action from one type to another. In the recruitment process, you might change the action to reject the candidate from a manual task to an automatic email task.
de: Manchmal müssen Sie eine Aktion in eine andere Art Aktion umwandeln, um einen Prozess anzupassen. Im Recruitment-Prozess könnten Sie z.B. die Aktion 'Kandidaten über Ablehnung informieren' von einer manuellen Aufgabe in eine automatische 'Email senden'-Aktion umwandeln.

source: To make this change, first select the action in the process editor to open the configuration panel, then click the action type icon at the top-left corner of the configuration panel to open the list of action types. Next, select *Send Email* from the list to change the action type.
de: Um diese Änderung vorzunehmen, wählen Sie zunächst die zu ändernde Aktion im Prozesseditor aus, um das Konfigurationspanel zu öffnen. Klicken Sie dann das kleine Icon oben links im Konfigurationspanel, um die Liste von möglichen Aktionstypen anzuzeigen, in die die Aktion transformiert werden kann. Wir wählen *Email senden*, um die Aufgabe in eine Email-Aktion umzuwandeln.

source: Changing a :ref:`user-task` to a :ref:`send-email` task.
de: Eine :ref:`user-task` in eine :ref:`send-email`-Aktion umwandeln.

source: Changing the action type discards the previous action type’s configuration, such as a user task form or an email template. If you change the action type back, the editor will not restore the original configuration.
de: Wenn Sie eine Aktion transformieren, werden die Einstellungen der ursprünglichen Aktion gelöscht, wie z.B. Formularfelder oder eine E.Mail Vorlage. Wenn Sie die Transformation rückgängig machen, wird die Konfiguration nicht wieder hergestellt.

source: Control flow elements
de: Kontrollfluss-Elemente

source: The diagram also includes control flow elements, such as events and gateways. Unlike actions, control flow elements don’t represent something that should happen. Instead, you use events and gateways to specify the flow between the actions.
de: Des Weiteren enthält ein Diagramm Elemente, die den Sequenzfluss kontrollieren, wie zum Beispiel Ereignisse und Gateways. Im Gegensatz zu Aktionen (Tasks) stehen diese Elemente nicht für Aufgaben, die von Personen oder Computern bearbeitet werden müssen, sondern legen die möglichen Richtungen des Sequenzflusses zwischen diesen fest.

source: In the process builder, select the *Details* tab to further configure the process.
de: Wählen Sie den *Details*-Tab im Prozesseditor, um den Prozess weiter zu konfigurieren.

source: Configuring process details
de: Konfiguration von Prozessdetails

source: On the *General* tab, configure the following process properties.
de: Im *Allgemein*-Tab konfigurieren Sie die folgenden Prozesseigenschaften

source: *Process owner* - shown on the *Processes* page to indicate who has responsibility for a process model, and used as the default recipient of some :ref:`notifications <notifications>`.
de: *Eigentümer* - ist sichtbar auf der *Prozess* Seite und zeigt an, wer für den Prozess verantwortlich ist und als Standardempfänger für einige :ref:`Benachrichtigungen <notifications>` dient.

source: *Process description* - documents a process, usually by describing the process goal.
de: *Prozessbeschreibung* - dokumentiert einen Prozess, normalerweise durch Beschreibung des Prozessziels.

source: *Case name template* - the name for new cases of this process, usually containing trigger :ref:`variables <variables>` so that each case has a different name.
de: *Vorlage für Fallnamen* - der Name für neue Fälle dieses Prozesses, normalerweise enthält dieser Prozess-Auslöser :ref:`Variablen <variables>`, damit jeder Fall einen anderen Namen bekommt.

source: Use the *Access control* tab to restrict access to this process and its cases.
de: Verwenden Sie den Tab *Zugriffsrechte*, um Zugang zu diesem Prozess und zu seinen Fällen einzuschränken.

source: Use the *Field overview* tab to view and rename this process’ :ref:`variables <variables>`.
de: Verwenden Sie den Tab *Feldübersicht*, um die :ref:`Prozessvariablen <variables>` einzusehen und zu verwalten.

source: Versions
de: Versionen
