Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/process-builder.po
Languages: de

source: Process builder
de: Prozesseditor

source: The process builder is used to create and configure executable processes. An executable process is similar to software, but it’s easier to build automations using processes. With Effektif, non-technical people can create useful processes.
de: Mit dem Prozesseditor können Sie ausführbare Prozesse erstellen und bearbeiten. Ein Prozess ist ähnlich einer Software nur dass es wesentlich einfacher ist Abläufe mit einem Prozess zu automatisieren.

source: Triggers
de: Auslöser

source: A trigger defines when a process is started. There is no relation between triggers and BPMN start events. See :ref:`Start event <start-event>`.
de: Auslöser definieren wie ein Prozess gestartet wird. Bei Effektif gibt es keinen Zusammenhang zwischen Auslösern und Start Events, wie Sie sie vielleicht aus BPMN kennen. Weitere Informationen hierzu finden Sie unter :ref:`Startereignisse <start-event>`.

source: Manual trigger
de: Manuell

source: A manual trigger is the simplest way to start a process. With a manual trigger, you start processes manually in Effektif, by selecting `Start new case` and then selecting the process to start.
de: Am einfachsten Starten Sie einen Prozess manuell. Dazu klicken Sie einfach auf `Neuen Fall starten` in der Prozessliste.

source: Form trigger
de: Formular

source: With a form trigger, you use a form to start a process. After selecting the form trigger, you can use the form builder to specify form fields.
de: Wenn Sie die Option `Formular` wählen müssen Nutzer ein Formular ausfüllen um neue Prozesse zu starten. Das Formular selbst können Sie dann mit unserem Formulareditor erstellen.

source: Email trigger
de: Email

source: An email trigger starts a new case for each email that you send to the trigger‘s Effektif email address. Note this is different from reading an existing email account, such as your own. After selecting the email trigger, you can see its email address:
de: Hierbei wird für jede Email, die an die entsprechende Emailadresse des Prozesses geschickt wird ein neuer Fall erstellt. Die Adresse, die Sie hierfür nutzen müssen wird in der Beschreibung des Auslösers angezeigt. Sie eignet sich perfekt dafür in bestehende Verteilerlisten wie zum Beispiel support@firma.de integriert zu werden.

source: Mail trigger configuration
de: Konfiguration des Emailauslösers

source: The email trigger creates an email variable that stores the email that started the process.
de: Der Emailauslöser erstellt eine Prozessvariable mit der Sie auf die Informationen der Email (Absender, Inhalt, etc.) zugreifen können.

source: Trigger mail in stream
de: Startemail im Stream

source: Salesforce trigger
de: Salesforce

source: A Salesforce trigger starts a new case in response to Salesforce sending an outbound message as part of a Salesforce workflow. Before you can use a Salesforce trigger, configure :ref:`Salesforce Integration <salesforce-integration>`.
de: Prozesse können auch durch eine Nachricht von Salesforce gestartet werden nachdem dort eine bestimmte Aktion erfolgt ist. Bevor Sie den Salesforce-Auslöser nutzen können, müssen Sie ihn wir hier beschrieben konfigurieren: :ref:`Salesforce Integration <salesforce-integration>`.

source: When you have configured a Salesforce service, you can select it as a process trigger, so that messages from Salesforce will now trigger new cases.
de: Nachdem Sie einen Salesforce Service konfiguriert haben, können Sie ihn als Auslöser nutzen.

source: Example of a Salesforce trigger
de: Beispiel eines Salesforce-Auslösers

source: In the process definition, you can use the Salesforce object fields that are included in the Salesforce message just like normal :ref:`variables <variables>`.
de: In der Prozessdefinition können Sie nun auch Felder die in der Nachricht von Salesforce beinhaltet sind wie normale :ref:`Variablen <variables>` nutzen.

source: Actions
de: Aktionen

source: Actions are like steps in a process. An action might be a user task in Effektif, an operation on a file in a document management system or any other action that represents something to be done in a process.
de: Mit Aktionen beschreiben Sie die verschiedenen Aufgaben innerhalb eines Prozesses. Das können zum Beispiel Aufgaben sein, die von Ihren Mitarbeitern ausgeführt werden müssen, sowie automatische Aktionen, wie der Upload von einer Datei in ein Dokumentenmanagementsystem.

source: Adding a transition
de: Transitionen hinzufügen

source: You can create a transition in the `Advanced flows` view. A transition specifies sequential flow, which means the next action only starts when the previous one is complete.
de: Transitionen können nur im `Prozessfluss-Editor` erzeugt werden. Sie beschreiben einen sequentiellen Fluss durch den Prozess. Dies bedeutet, dass Aktionen nur dann ausgeführt werden, wenn die vorangehenden Aktionen bearbeitet wurden.

source: To add a transition, click to select the first action. Several symbols appear to the right of the selected element:
de: Um eine Transition hinzuzufügen klicken Sie auf eine Aktionen im Prozess. Darauf erscheinen neben der Aktion einige Symbole.

source: Start creating a transition by dragging the transition symbol to the destination
de: Um eine Transition zu erzeugen, ziehen Sie das Transitions-Symbol auf die Zielaktion

source: Click the transition symbol |transition-symbol| and drag it to the destination element. When you drag the symbol over the destination element, it indicates that you can drop to create the transition:
de: Klicken Sie das Transitions-Symbol |transition-symbol| and ziehen Sie es auf das Zielelement. Wenn Sie sich mit dem Mauszeiger über dem Zielelement befinden und es mit der aktuellen Aktivität verbunden werden kann, leuchten die Ecken grün auf und ein grüner Haken erscheint neben dem Transitions-Symbol.

source: Creating a transition hovering over destination
de: Ziehen Sie die Transition auf das Zielelement.

source: Release the mouse button over the destination to create the transition.
de: Um die Transition endgültig zu erzeugen lassen Sie die Maus los.

source: Creating the next user task
de: Folgeaufgaben erstellen

source: There is an easy way to create the next User Task in a process, similar to creating transitions above. Start by selecting the previous action:
de: Eine neue Aufgabe nach einer bereits bestehenden zu erstellen ist ganz einfach. Gehen Sie auf ähnliche Weise vor, wie schon bei den Transitionen. Zunächst markieren Sie die Aktion auf die die neue folgen soll.

source: Start creating the next user task by dragging the action symbol
de: Erstellen Sie Folgeaufgaben in dem Sie das Aktions-Symbol ziehen.

source: Click the rounded rectangle symbol |task-symbol| and drag it to an empty place on the canvas.
de: Klicken Sie das Aufgaben-Symbol |task-symbol| and ziehen Sie es an die Stelle, wo die neue Aufgabe erstellt werden soll.

source: Drag the rounded rectangle symbol to an empty place
de: Ziehen Sie das Aufgaben-Symbol an die gewünschte Stelle

source: Drop the symbol where you want to create the next user task. Release the mouse button to create new user task where you dropped it, with a transition from the previous action.
de: Lassen Sie das Symbol an der Stelle los, wo die neue Aufgabe erstellt werden soll. Zwischen der neuen Aktion und der bereits bestehenden wird automatisch eine Transition erstellt.

source: Adding the next user task and its transition at the same time
de: Fügen Sie Folgeaufgaben inklusive der Transition hinzu

source: Alternatively, just click the user task icon |task-symbol| to create a new user task in the default location, with a transition.
de: Alternativ können Sie das Aufgaben-Symbol einfach klicken um eine Folgeaufgabe an der Standardposition etwas weiter rechts neben der bestehenden Aktion zu erstellen.

source: Control flow elements
de: Kontrollfluss-Elemente

source: Control flow elements like events and gateways are also part of the diagram, but unlike actions, control flow elements don’t represent something that should happen. Instead, you use events and gateways to specify the flow between the actions.
de: Kontrollfluss-Elemente, wie Ereignisse oder Gateways sind zwar auch Teil des Prozessdiagramm, allerdings stehen sie nicht dafür, dass etwas ausgeführt werden muss. Mit diesen Elementen steuern Sie den Fluss zwischen den einzelnen Aktivitäten.

source: Variables
de: Variablen

source: Roles
de: Rollen

source: If you reassign a task that has a role assignment, Effektif will update the role variable, and assign all subsequent tasks with the same role to the new assignee.
de: Wenn Sie die Zuweisung ändern, kümmert sich Effektif natürlich darum, dass alle Aufgaben die einer Rolle zugewiesen waren entsprechend aktualisiert werden.

source: Form trigger configuration - using the form builder to define a trigger form
de: Formular-Auslöser Konfiguration - Nutzen Sie den Formular-Editor um den Auslöser zu erstellen

source: The *Process builder*’s actions palette
de: Die Palette an Aktionen im *Prozess-Editor*

source: A trigger form that populates a *Reference number* variable for use in a workflow
de: Ein Formular-Auslöser welcher die Variable *Referenznummer* zur Nutzung im Workflow bereitstellt

source: Assigning a task to a *Support engineer* role with candidates Alice and Ben
de: Eine Aufgabe der Rolle `Kundenbetreuer` zuweisen mit den Kandidaten Alice und Ben

source: Using a form field to assign a role
de: Wie man per Formularfeld eine Rolle setzt

source: When you execute a process, you normally assign a specific person to a role by using the assignee button to select someone. Sometimes, you want this assignment to an explicit part of the process, to make sure the assignment happens at the right time. For example, it may be important to assign the *Support engineer* before completing an *Initial investigation* task.
de: Wenn Sie einen Prozess ausführen, dann weisen Sie eine Person in der Regel einer Rolle hinzu indem Sie den Zuweisen Knopf benutzen. Manchmal soll allerdings genau diese Zuweisung Teil des Prozesses selbst sein um sicher zu stellen, dass die Zuweisung zur richtigen Zeit passiert. Zum Beispiel kann es wichtig sein den *Support Mitarbeiter* zuzuweisen bevor die Aufgabe *Initiale Nachforschungen* abgeschlossen wird.

source: You can do this by adding the role assignment to a form, because a task assignment role is a process variable, just like any other *User* form field.
de: Sie können das ganz einfach tun indem Sie die Rolle zu einem Formular hinzufügen, denn Rollen sind in Effektif auch nur weitere Prozessvariablen wie jedes andere *Nutzer* Feld.

source: Adding the *Support engineer* role assignment to a form
de: Die *Support Mitarbeiter* Rolle zu einem Formular hinzufügen

source: To add a role assignment to a form, first define the process role, such as the *Support engineer* role created above, then on the form, under the *Reuse field* heading, select the role variable to add it to the form.
de: Um eine Rolle in einem Formular zu verwenden erstellen Sie zuerst die gewünschte Rolle wie zum Beispiel den *Support Mitarbeiter*. Danach können Sie diesen unterhalb des Formulars bei *Ein Feld wiederverwenden* ganz einfach auswählen.

source: A process has variables that store workflow data when the process runs. All the information in forms and information required by the actions will be connected to these variables. Each case stores its own values for each workflow variable.
de: In einem Prozess werden alle Daten in Variablen gespeichert. Informationen, wie zum Beispiel Formulare oder Konfigurationen, die für verschiedene Aktivitäten benötigt werden, sind mit diesen Variablen verbunden. Jeder einzelne Fall kennt die für ihn relevanten Werte dieser Variablen.

source: A workflow variable can contain a single value, such as a reference number, or containing multiple fields, such as an email, which has fields like `from`, `to`, `subject` and `attachments`.
de: Eine Workflow-Variable kann einen einzelnen Wert, wie zum Beispiel eine Referenz oder eine Nummer enthalten, oder kann aus mehreren Felder zusammengesetzt sein, wie zum Beispiel eine Email mit den Feldern `Absender`, `Empfänger`, `Betreff` und `Anhänge`.

source: The `BPMN <http://en.wikipedia.org/wiki/Business_Process_Model_and_Notation>`_ diagram editor shows actions and control flow elements, such as events and gateways. Use the diagram editor to add sequential flows between actions, decisions and other control flow behaviour.
de: Der `BPMN <http://en.wikipedia.org/wiki/Business_Process_Model_and_Notation>`_ Diagrammeditor zeigt Ihnen die einzelnen Aktionen, sowie Kontrollflusselemente wie Events und Gateways an. Sie können mit dem Editor Sequenzflüsse zwischen den Aktivitäten erstellen, Entscheidungen hinzufügen oder auf andere Weise den Kontrollfluss beeinflussen.

source: To export a process model, first open it in the Effektif process editor. Select the menu next to the `Publish changes` button, then select `Export BPMN 2.0 XML`.
de: Um einen Prozess zu exportieren, öffnen Sie ihn zunächst in Effektif. Wählen Sie im Menü neben dem `Zum Ausführen veröffentlichen` Knopf den Punkt `BPMN 2.0 XML exportieren`.

source: Using the `Export BPMN 2.0 XML` option to save a process model in a file
de: Benutzen Sie den BPMN 2.0 XML Export um einen Prozess als Datei zu speichern.

source: This results in a file download that describes your process model in BPMN format. There’s only one kind of BPMN file, so there aren’t any options to configure.
de: Als Ergebnis wird der Download der Datei im BPMN-Format gestartet. Da es nur eine Art von BPMN-Dateien gibt, müssen Sie auch keine weiteren Optionen konfigurieren.

source: Versions
de: Versionen

source: When you use the Effektif process editor to edit your process model, all of your changes are saved immediately. You can go back and edit the process again later, and it will be just as you left it. However, to execute a process by starting a new case you need a published version.
de: Wenn Sie den Effektif Prozesseditor verwenden, werden alle Ihre Änderungen automatisch gespeichert. Das heißt Sie können einen Prozess verlassen und er wird genau so aussehen, wenn Sie ihn wieder öffnen. Um einen Prozess allerdings auszuführen müssen Sie zunächst eine Version veröffentlichen.

source: Publishing a process version
de: Eine Version veröffentlichen

source: The process editor’s `Versions` tab shows a list of published versions. Until you publish the first version, this page shows a message that there are ‘no published versions’ of the process.
de: Im Reiter `Versionen` des Prozesseditors finden Sie eine Liste von veröffentlichten Versionen. Bevor Sie die erste Version Ihres Prozesses veröffentlicht haben, wird diese Seite nur einen Hinweis anzeigen, dass noch keine Versionen veröffentlicht wurden.

source: The process editor’s `Versions` tab with no published versions
de: Der Reiter `Versionen` ohne eine veröffentlichte Version.

source: You can only start a new case for a process that has a published version, which is why the light green button text is ‘Publish to run this process’. After you publish the first version, the list shows version #1 and you can start a new case using that version.
de: Sie können nur Fälle von bereits veröffentlichten Prozessen anlegen, weshalb der grünliche Knopf auch die Beschriftung `Zum Ausführen veröffentlichen` trägt. Nachdem Sie die erste Version veröffentlicht haben, zeigt die Liste einen Eintrag mit der Version #1 und Sie können nun Fälle von diesem Prozess starten.

source: The `Versions` list after publishing the first version
de: Die `Versions`-Liste mit dem ersten Eintrag

source: Version #1 always has the description `Initial version`. For later versions, you can add your own description.
de: Die Version mit der Nummer #1 hat immer die Beschriftung `Initiale Version`. Bei späteren Versionen können Sie selbst eine Beschreibung hinzufügen.

source: Adding version comments
de: Versionskommentare hinzufügen

source: After the first published version, you can add a comment to describe the changes when you publish a new version of a process.
de: Nach der ersten veröffentlichten Version können Sie zu jeder weiteren Version eine Beschreibung hinzufügen, die die Änderungen beschreibt, die Sie vorgenommen haben.

source: The `Publish changes` prompt, where you can add an optional version comment
de: Der `Änderungen veröffentlichen` Dialog, indem Sie eine optionale Beschreibung hinzufügen können

source: The version comment is not required, but it helps collaboration between team members by making process modelling more transparent.
de: Der Versionskommentar ist keine Pflicht, er hilft jedoch bei der Kollaboration von mehreren Team-Mitgliedern, da er die Prozessgestaltung transparenter macht.

source: Published versions with descriptive version comments
de: Veröffentlichte Versionen mit beschreibenden Versionskommentaren

source: In this example, each version has a short comment that describes the changes.
de: In diesem Beispiel hat jede Version einen kurten Kommentar, der die Änderungen beschreibt.

source: Writing good version comments
de: Gute Versionskommentare schreiben

source: When you write version comments, use the following tips to make them more consistent and useful.
de: Wenn Sie Ihre Versionskommentare schreiben, folgen Sie den diesen Tipps um Sie konsistent und nützlich zu gestalten.

source: Make the comment an imperative phrase that starts with a word like ‘Add’ or ‘Fix’.
de: Schreiben Sie im imperativen Stil wie `Aktivität hinzugefügt` oder `Fehler behoben`.

source: Capitalise the first word and don’t include a full-stop at the end, for consistency.
de: Schreiben Sie das erste Wort groß aber beenden Sie den Kommentar nich mit einem Punkt (der Konsistenz halber)

source: Be specific about what you changed, instead of vaguely referring to ‘changes’.
de: Seien Sie spezifisch bei dem was Sie geändert haben und sprechen Sie nicht nur vage über `Änderungen`.

source: Be concise; 3-10 words is usually about right.
de: Fassen Sie sich kurz; 3-10 Worte sind normalerweise mehr als genug.

source: Consider making the comment longer to explain why you made this change.
de: Unter Umständen schreiben Sie einen längeren Kommentar um zu Beschreiben, warum die Änderungen notwendig waren.

source: You may find it easier to publish a series of small changes, creating a number of intermediate versions instead of one big change. Fine-grained versions make the version history more useful.
de: Es erleichtert die Arbeit, wenn Sie eine Reihe von kleinen Änderungen veröffentlichen und nicht alles in eine große Version schieben. Kleine Versionen machen es einfacher die Änderungen nachzuverfolgen und damit die Versionshistorie nützlicher.

source: Process locking
de: Bearbeitungsblockierung

source: In the process builder, only one person can edit a process at a time. When someone else is editing a process, there is a message in the `Processes` list.
de: Ein Prozess kann im Prozesseditor nicht von mehreren Personen gleichzeitig bearbeitet werden, da es ansonsten sehr wahrscheinlich ist, dass die bearbeitenden Nutzer ihre Änderungen gegenseitig überschreiben. Wenn jemand einen Prozess editiert, wird dies daher in der `Prozesse`-Liste angezeigt.

source: The `Processes` list message when someone else `is currently working on this process`
de: Der Hinweis in der `Prozesse`-Liste, wenn ein Prozess bereits editiert wird

source: You can still open the process, but you will see a warning message explaining that you will not be able to make changes:
de: In einer solchen Situation können Sie den Prozess trotzdem öffnen. Allerdings wird Ihnen dann eine Warnung angezeigt und eine Bearbeitung des Prozesses ist nicht möglich:

source: Warning that you will not be able to make edit a process at the same time as someone else
de: Warnung, dass Änderungen an einem Prozess nicht von mehreren Personen gleichzeitig durchgeführt werden können

source: You will be able to edit the process and make changes after the other person leaves the process editor, by opening the `Tasks` list, for example.
de: Nachdem die editierende Person die Bearbeitungsansicht verlässt (zum Beispiel um in de Aufgabenliste zu wechseln), können Sie den Prozess wieder bearbeiten.

source: You can export an Effektif process model as a BPMN 2.0 XML file. This is useful if you want to open the model in another tool that supports BPMN, or to make a backup that you can load using the :ref:`BPMN import <bpmn-import>` option.
de: Sie können ein Effektif Prozessmodel als BPMN 2.0 XML file exportieren. Anschließend können Sie das Diagramm in einem beliebigen Tool öffnen, das den offenen BPMN 2.0 Standard unterstützt. Die Exportfunktion ermöglich zudem das Erstellen von Backups: ein :ref:`Re-Import <bpmn-import>` ist jederzeit möglich.

source: Copying & deleting processes
de: Prozesse kopieren und löschen

source: You can create a copy of a process or delete it using the process menu shown in the previous section.
de: Über das Prozessmenü können Sie zudem Prozesse kopieren und löschen.

source: The `Create a copy` option duplicates the process in the same organisation. You may find it useful to duplicate a process if you want to experiment with changes without publishing changes to a process that people are using. You may also want to duplicate a process to model a special case of the process, instead of adding a conditional flow to the standard process.
de: Über die Schaltfläche `Eine Kopie erstellen` duplizieren Sie einen Prozess in der entsprechenden Organisation. Dies ist insbesondere hilfreich, wenn Sie dem Prozess experimentieren wollen, ohne dass Nutzer der Prozessfälle direkt von den Änderungen betroffen sind. Ein weitere Use Case ist das Erstellen von Prozessvarianten: Um weitere XOR-Verzweigungen innerhalb einer Prozesses zu vermeiden, können Sie eine Kopie des Prozesses Ihren Anforderungen entsprechend abändern und die Prozessbezeichnung aussagekräftig abändern.

source: The `Delete process` option permanently deletes a process and all of its cases. You cannot undo this operation, so you must enter a confirmation. You might want to delete a process that you created by duplicating another process in order to experiment with changes in the model.
de: Über die `Prozess löschen` Schaltfläche löschen Sie einen Prozess und alle Fälle des Prozesses **unwiderruflich**. Da Sie das Löschen nicht rückgängig machen können, müssen Sie den Vorgang explizit bestätigen. Ein typische Anwendungsfall für das Löschen eines Prozesses ist das Verwerfen einer experimentellen Kopie eines Prozesses.

source: In Effektif, you cannot currently delete cases, which you might want to do if you have created test cases while developing the process. However, you can use `Create a copy` and `Delete process` to duplicate a process and then delete the original. This deletes all of the cases with the original process, and leaves a copy with no cases.
de: In Effektif ist es nicht möglich, Fälle direkt zu löschen. Falls Sie einen Fälle als 'Tests' während des Prozessdesigns erstellt haben, empfehlen wir Ihnen für die Produktivversion des Prozesses eine Kopie zu erstellen und das Orginal zu löschen. Die Fälle werden nicht in die Kopie übernommen.

source: You can import an Effektif process model from a BPMN 2.0 XML file. You can use this to import a model that you created in another tool, or to load a file that you saved using the :ref:`BPMN export <bpmn-export>` option.
de: Sie können ein Effektif Prozessmodel als BPMN 2.0 XML Datei importieren. Hiermit können Sie Modelle, die Sie in anderen Tools erstellt haben, in Effektif verwenden oder Backups, die Sie vorher über die :ref:`BPMN Exportfunktion <bpmn-export>` gespeichert haben, wiederherstellen.
