Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/processes.po
Languages: de

source: The `Delete process` option permanently deletes a process and all of its cases. You cannot undo this operation, so you must enter a confirmation. You might want to delete a process that you created by duplicating another process in order to experiment with changes in the model.
de: Über die `Prozess löschen` Schaltfläche löschen Sie einen Prozess und alle Fälle des Prozesses **unwiderruflich**. Da Sie das Löschen nicht rückgängig machen können, müssen Sie den Vorgang explizit bestätigen. Ein typischer Anwendungsfall für das Löschen eines Prozesses ist das Verwerfen einer experimentellen Kopie eines Prozesses.

source: In Workflow Accelerator, you cannot currently delete cases, which you might want to do if you have created test cases while developing the process. However, you can use `Create a copy` and `Delete process` to duplicate a process and then delete the original. This deletes all of the cases with the original process, and leaves a copy with no cases.
de: In Signavio WorkflowAccelerator können Sie derzeit keine Fälle löschen, was Sie mit Testfällen aus der Entwicklungsphase von Prozessen eventuell tun möchten. In diesem Fall, können Sie `Eine Kopie erstellen` und `Prozess löschen` verwenden, um den Prozess zu duplizieren und das Original zu entfernen. So werden alle alten Fälle gelöscht. Das neue Prozessduplikat besitzt noch keine Fälle.
