Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/processes.po
Languages: de

source: When you use the process editor to edit your process model, Workflow Accelerator saves all of your changes immediately. You can go back and edit the process again later, and it will not have changed. However, to execute a process by starting a new case you need a published version.
de: Wenn Sie den Signavio Workflow Accelerator Prozesseditor verwenden, werden alle Ihre Änderungen automatisch gespeichert. Sie können also einen Prozess verlassen, ohne explizit zu speichern. Um einen Prozess auszuführen, müssen Sie allerdings zunächst eine Version veröffentlichen.

source: Publishing a process version
de: Eine Version veröffentlichen

source: The process editor’s `Versions` tab shows a list of published versions. Until you publish the first version, this page shows a message that there the process has ‘no published versions’.
de: Im Reiter `Versionen` des Prozesseditors finden Sie eine Liste von veröffentlichten Versionen. Bevor Sie die erste Version Ihres Prozesses veröffentlicht haben, zeigt diese Seite nur einen Hinweis an, dass noch keine Versionen veröffentlicht wurden.

source: The process editor’s `Versions` tab with no published versions
de: Der Reiter `Versionen` ohne eine veröffentlichte Version.

source: You can only start a new case for a process that has a published version, hence the light green button displays ‘Publish to run this process’. After you publish the first version, the list shows version #1 and you can start a new case using that version.
de: Um einen Fall anzulegen, muss der entsprechende Prozess veröffentlicht sein - dafür gibt es den Button `Zum Ausführen veröffentlichen`. Nachdem Sie die erste Version veröffentlicht haben, zeigt die Liste einen Eintrag mit der Version #1 und Sie können nun Fälle dieses Prozesses starten.

source: The `Versions` list after publishing the first version
de: Die `Versions`-Liste mit dem ersten Eintrag

source: Version #1 always has the description `Initial version`. For later versions, you can add your own description.
de: Die Version mit der Nummer #1 hat immer die Beschriftung `Initiale Version`. Bei späteren Versionen können Sie selbst eine Beschreibung hinzufügen.

source: Adding version comments
de: Versionskommentare hinzufügen

source: After the first published version, you can add a comment to describe the changes when you publish a new version of a process.
de: Nach der ersten veröffentlichten Version können Sie zu jeder weiteren Version eine Beschreibung hinzufügen, die die Änderungen beschreibt, die Sie vorgenommen haben.

source: The `Publish changes` prompt, where you can add an optional version comment
de: Der `Änderungen veröffentlichen` Dialog, indem Sie eine optionale Beschreibung hinzufügen können

source: You can omit the version comment, but it helps collaboration between team members by making process modelling more transparent.
de: Das hinterlegen eines Versionskommentars ist keine Pflicht, er hilft jedoch bei der Kollaboration von mehreren Team-Mitgliedern, da er die Prozessgestaltung transparenter macht.

source: Published versions with descriptive version comments
de: Veröffentlichte Versionen mit beschreibenden Versionskommentaren

source: In this example, each version has a short comment that describes the changes.
de: In diesem Beispiel hat jede Version einen kurzen Kommentar, der die Änderungen beschreibt.

source: Writing good version comments
de: Gute Versionskommentare schreiben

source: When you write version comments, use the following tips to make them more consistent and useful.
de: Befolgen Sie den diese Richtlinien, um Ihre Versionskommentare konsistent und nützlich zu gestalten.

source: Make the comment an imperative phrase that starts with a word like ‘Add’ or ‘Fix’.
de: Verwenden Sie einen kurzen und sachlichen Stil, wie z.B. `Aktivität hinzugefügt` oder `Fehler behoben`.

source: Capitalise the first word and don’t include a full-stop at the end, for consistency.
de: Schreiben Sie das erste Wort groß und beenden Sie den Kommentar nicht mit einem Punkt (der Konsistenz halber)

source: Describe specifics, instead of vaguely referring to ‘changes’.
de: Schreiben Sie klar und sprechen Sie nicht nur vage über `Änderungen`.

source: Keep it short; 3-10 words usually suffice.
de: Fassen Sie sich kurz; 5-12 Worte sind normalerweise genug.

source: Consider making the comment longer to explain why you made this change.
de: Falls zum Verständnis notwendig, schreiben Sie in einem längeren Kommentar, um zu erklären, weshalb eine Änderung vorgenommen wurde.

source: You may find it easier to publish a series of small changes, creating a number of intermediate versions instead of one big change. Fine-grained versions make the version history more useful.
de: Es erleichtert die Arbeit, wenn Sie eine Reihe von kleinen Änderungen veröffentlichen und nicht alles in eine große Version schieben. Kleinere Änderungen pro Version machen es einfacher, diese in der Historie nachzuverfolgen.

source: Variables
de: Variablen

source: *Variables* contain the workflow data that the process defines. You can use variables in a case name template and when configuring the output of some action types. For example, you can use variables to repeat workflow data on a :ref:`user task form <user-task-form>`, or include a variable value in an :ref:`email task <send-email>` subject line or body text.
de: *Variablen* beinhalten die Workflow-Daten, die durch den Prozess definiert werden. Mit Hilfe von Variablen können Sie Vorlagen zur Namensgebung für Fälle erstellen und die Ausgabekonfiguration einiger Aktionstypen konfigurieren. Zum Beispiel können Sie Variablen benutzen, um Workflow-Daten, z.B. in einem :ref:`Aufgabenformular<user-task-form>`, mehrmals zu verwenden oder einen variablen Wert in einer :ref:`Email-Aktion<send-email>` in Kopfzeile oder Text zu verwenden.

source: These variables contain all of the information from forms as well as information required by the process actions. Each case stores its own values for each workflow variable.
de: Diese Variablen beinhalten alle Formulardaten und die Informationen, die benötigt werden, um die Aktionen des Prozesses auszuführen. Jeder Fall besitzt seine eigenen Werte für jede Workflow-Variable.

source: You will usually add a variable to your workflow by adding a :ref:`form field <form-fields>`. You can also create variables in a :ref:`javascript-action`, to capture data that the script retrieves or calculates.
de: Im Normalfall fügen Sie eine Variable zu Ihrem Workflow hinzu, indem Sie :ref:`Formularfelder <form-fields>` hinzufügen. Sie können auch in einem :ref:`javascript` Variablen definieren, um Daten, die das Skript berechnet oder abruft, zu erfassen.

source: A trigger form that populates *Name* and *Date of birth* variables for use in a workflow
de: Ein Auslöser-Formular, das eine *Referenznummer*-Variable zur Verwendung in einem Workflow ausfüllt

source: In addition to your own workflow variables, Workflow Accelerator automatically creates variables that give you access to additional data in each case. The :ref:`case-variable` contains data from when Workflow Accelerator creates the case. An :ref:`email-trigger` adds an :ref:`Email variable <trigger-email-variable>` that contains the trigger email.
de: Außer Ihren eigenen Workflow-Variablen erstellt Signavio Workflow Accelerator automatisch Variablen, die Ihnen Zugriff auf weitere Informationen in jedem Fall erlauben. Die :ref:`case-variable` beinhaltet Informationen über die Erstellung des jeweiligen Falls. Ein :ref:`email-trigger` fügt eine :ref:`Email Variable<trigger-email-variable>` hinzu, die die Auslöser-Email enthält.

source: Variables can have different :ref:`data-types` that determine which kind of data the variable stores, such as text or a date, and whether the data has a single value or contains multiple fields.
de: Variablen können verschiedene :ref:`data-types` enthalten, die festlegen, welche Art von Daten die Variable enthält, so wie einen Text oder ein Datum. Außerdem legt der Datentyp fest, ob die Variable einen Wert oder mehrere Felder enthält.

source: Roles
de: Rollen

source: Creating a role gives a process-specific name to whoever performs one or more process tasks. You can optionally configure a role with a list of candidates. Roles have the same function as swimlanes in BPMN.
de: Die Erstellung einer Rolle gibt den Personen, die bestimmte Prozessaufgaben ausführen, eine prozessspezifische Bezeichnung. Sie haben in Signavio Workflow die Möglichkeit, eine Liste von Kandidaten für Rollen zu definieren. Rollen haben hier die gleiche Bedeutung, wie Swimlanes in BPMN.

source: Process roles differ from organizational roles. A process role only lasts for the duration of a case, while organizational roles last longer and relate to the job you perform at the organization. For example, when you have a meeting, one person sometimes takes the role of chairperson. That person doesn’t have the job title *Meeting chair* - they’ve just adopted that role for the duration of the meeting.
de: Prozessrollen unterscheiden sich von Organisationsrollen. Eine Prozessrolle existiert nur so lange, wie der Prozess läuft, während Organisationsrollen dauerhaft existieren und mit einer Position verbunden sind. Zum Beispiel können bestimmte Personen in einem Meeting reihum die Rolle des Leiters einnehmen. Die jeweilige Person besitzt nicht die Jobbeschreibung *Meetingsleitung,* sondern hat diese Rolle nur in dieser bestimmten Situation inne.

source: A process in Workflow Accelerator can define roles, in the same way that a business meeting ‘process’ has roles for whoever chairs the meeting (the ‘Chair’) and whoever takes minutes (the ‘Secretary’). The following meeting process model assigns the tasks on the top row to the *Chair* and the tasks on the bottom row to the *Secretary*.
de: Dementsprechend werden Rollen in Signavio Workflow Accelerator-Prozessen verwendet. Das folgende Meeting-Prozessmodell ordnet die Aufgaben in der oberen Reihe der **Meetingsleitung** zu und die Aufgaben in der unteren Reihe der **Meetingsassistenz**.

source: A *Meeting* process, with tasks for *Chair* (top row) and *Secretary* (bottom row) roles
de: Ein *Meeting*-Prozess mit Aufgaben für die Rollen *Meetingsleitung* (obere Reihe) und *Meetingsassistenz* (untere Reihe)

source: In each meeting (each :ref:`case <cases>` in Workflow Accelerator), one person takes the role of chair, and one the role of secretary. These assignments generally don’t change during a meeting. Similarly, Workflow Accelerator role assignments don’t change during a case. Workflow Accelerator automatically assigns each new task with a role assignment to the person who already has the role.
de: Rollen können ad-hoc eingenommen werden. In jedem Meeting (jedem :ref:`Fall <cases>` in Signavio Workflow Accelerator) wird einer Person die Aufgabe der Meetingsleitung übertragen und einer weiteren Person die Rolle der Meetingsassistenz. Während eines Falldurchlaufs ändern sich Rollenzuweisungen nicht: Jede neue Aufgabe einer Rolle wird automatisch der entsprechenden Person zugewiesen.

source: In Workflow Accelerator, a process role works like a workflow variable that you use to assigning tasks. A role variable has the :ref:`type-user` type and stores a single user.
de: Eine Prozessrolle in Signavio Workflow Accelerator ist eine Art Workflowvariable, die für die Zuweisung von Aufgaben verwendet wird. Eine Rolle ist eine Variable des Typs :ref:`type-user` - sie referenziert pro Aufgabe genau einen Nutzer.

source: These process roles differ from organization roles. For example, you can have the *Team lead* role in your organization, an assignment that does not necessarily have an end date. A process role, such as *Meeting chair*, has a different scope and only applies for the duration of a single case.
de: Diese Prozessrollen entsprechen nicht zwingend Organisationsrollen. Sie können zum Beispiel in Ihrer Organisation die Rolle des *Team Leads* einnehmen und diese Rolle für unbegrenzte Zeit innehaben. Eine Prozessrolle wie *Meetingsleitung* wird hingegen lediglich im Kontext eines einzelnen Falles zugewiesen.

source: To assign a role to a user task, open the task’s configuration panel, select the `Assignment` tab, and use the `Assign using a role` menu on the right-hand side.
de: Um eine Rolle einer Nutzeraufgabe zuzuweisen, öffnen Sie die Konfigurationsleiste der Aufgabe, wählen Sie das `Allgemein`-Tab aus und verwenden Sie das `Zuweisen mittels einer Rolle`-Menü auf der rechten Seite.

source: To assign a role, use the menu to create a new role or select an existing role
de: Um eine Rolle zuzuweisen, verwenden Sie das Menü um eine neue Rolle zu erstellen oder eine Existierende auszuwählen.

source: You can also use the edit icon next to the role name to rename the role.
de: Sie können zudem das Editierungssymbol neben der Rolle anwählen, um die Rolle umzubenennen.

source: Role candidates
de: Kandidaten für eine Rolle

source: You can use a role to assign multiple tasks a person from a group of candidates. For example, you might have a support process that includes three user tasks that you assign to a support engineer.
de: Über eine Rolle können Sie einer Person aus einer Gruppe von Kandidaten mehrere Aufgaben zuweisen. In einem Supportprozess kann es zum Beispiel drei Aufgaben geben, die einem Kundenbetreuer zugewiesen sind.

source: Assigning a task to a *Support engineer* role with candidates Alice and Ben
de: Eine Aufgabe der Rolle `Kundenbetreuer` zuweisen mit den Kandidaten Alice und Ben

source: Instead, assign the three tasks to a new role called ‘Support engineer’, and add the relevant people as candidates for the role.
de: Weisen Sie die drei Aufgaben einer neuen Rolle zu. Nennen Sie die Rolle 'Kundenbetreuer' und fügen Sie relevante Personen als Kandidaten für die Rolle hinzu.

source: Creating the first task that has a role will notify all of the candidates for the role. When one of the candidates takes the task, Workflow Accelerator will assign the subsequent tasks with the same role to the same person. That helps this person work more efficiently because they have the context knowledge about that case.
de: Sobald die erste Aufgabe erstellt wird, die einer bestimmten Rolle zugewiesen ist, werden alle Kandidaten für diese Rolle informiert. Wenn eine Person die Aufgabe übernimmt, werden auch alle weiteren Aufgaben der Rolle dieser Person zugewiesen. Dies ist effizienter, da die entsprechende Person schon das kontextspezifische Fallwissen besitzt.

source: If you reassign a task that has a role assignment, Workflow Accelerator will update the role variable, and assign all subsequent tasks with the same role to the new assignee.
de: Wenn Sie die Zuweisung ändern, kümmert sich Signavio Workflow Accelerator natürlich darum, dass alle Aufgaben die einer Rolle zugewiesen waren entsprechend aktualisiert werden.

source: Using a form field to assign a role
de: Wie man per Formularfeld eine Rolle setzt

source: When you execute a process, you normally assign a specific person to a role by using the assignee button to select someone. Sometimes, you want this assignment to an explicit part of the process, to make sure the assignment happens at the right time. For example, you may find it important to assign the *Support engineer* before completing an *Initial investigation* task.
de: Wenn Sie einen Prozess ausführen, dann weisen Sie eine Person in der Regel einer Rolle zu, indem Sie den *Zuweisen* Button benutzen. Manchmal soll allerdings genau diese Zuweisung Teil des Prozesses selbst sein um sicher zu stellen, dass die Zuweisung zur richtigen Zeit passiert. Zum Beispiel kann es wichtig sein, den *Kundenbetreuer* zuzuweisen bevor die Aufgabe *Initiale Nachforschungen anstellen* abgeschlossen wird.

source: You can do this by adding the role assignment to a form, because you can use task assignment roles as process variables, just like any other *User* form field.
de: Sie können hierfür einfach die Rolle zu einem Formular hinzufügen: Rollen sind in Signavio Workflow Prozessvariablen, wie jedes andere *Nutzer* Formularfeld auch.

source: Adding the *Support engineer* role assignment to a form
de: Die *Kundenbetreuer* Rolle zu einem Formular hinzufügen

source: To add a role assignment to a form, first define the process role, such as the *Support engineer* role created above, then on the form, under the *Reuse field* heading, select the role variable to add it to the form.
de: Um eine Rolle in einem Formular zu verwenden, erstellen Sie zuerst die gewünschte Rolle wie zum Beispiel den *Kundenbetreuer*. Danach können Sie diesen unterhalb des Formulars bei *Ein Feld wiederverwenden* ganz einfach auswählen.

source: Alternatively, you can first define the *Support engineer* role by adding a field with type *User* to the *Initial investigation* task’s form, and then select the *Support engineer* role on another user task’s *General* configuration.
de: Alternativ können Sie die *Kundenbetreuer*-Rolle definieren, indem Sie den Typ *Nutzer* zum Formular der Aufgabe *Initiale Nachforschungen anstellen* hinzufügen und anschließen die Rolle *Kundenbetreuer* in der Konfiguration einer Nutzeraufgabe auswählen.

source: Process locking
de: Bearbeitungsblockierung

source: In the process builder, only one person can edit a process at a time. While someone continues to edit a process, the `Processes` list shows a message.
de: Ein Prozess kann im Prozesseditor nicht von mehreren Personen gleichzeitig bearbeitet werden, da es ansonsten sehr wahrscheinlich ist, dass die bearbeitenden Nutzer ihre Änderungen gegenseitig überschreiben. Wenn jemand einen Prozess bearbeitet, wird dies daher in der `Prozesse`-Liste angezeigt.

source: The `Processes` list message while someone else edits the process
de: Der Hinweis in der `Prozesse`-Liste, wenn ein Prozess bereits editiert wird

source: You can still open the process, but you will see a warning message explaining that you cannot make changes:
de: In einer solchen Situation können Sie den Prozess trotzdem öffnen. Allerdings wird Ihnen dann eine Warnung angezeigt und eine Bearbeitung des Prozesses ist nicht möglich:

source: Warning that you cannot edit a process at the same time as someone else
de: Warnung, dass Änderungen an einem Prozess nicht von mehreren Personen gleichzeitig durchgeführt werden können

source: You can edit the process and make changes after the other person leaves the process editor, by opening the `Tasks` list, for example.
de: Nachdem die editierende Person die Bearbeitungsansicht verlässt (z.B. indem sie zum Tab *Aufgaben* wechselt), können Sie den Prozess wieder bearbeiten.

source: You can import a Workflow Accelerator process model from a BPMN 2.0 XML file. You can use this to import a model that you created in another tool, or to load a file that you saved using the :ref:`BPMN export <bpmn-export>` option.
de: Sie können ein Signavio Workflow Accelerator Prozessmodel als BPMN 2.0 XML Datei importieren. Hiermit können Sie Modelle, die Sie in anderen Tools erstellt haben, in Signavio Workflow verwenden oder Backups, die Sie vorher über die :ref:`BPMN Exportfunktion <bpmn-export>` gespeichert haben, wiederherstellen.

source: To import a process model, on the `Processes` page, click the `Import BPMN` button and select the BPMN XML file.
de: Um ein Prozessmodell zu importieren, wechseln Sie in die `Prozesse`-Ansicht, klicken Sie auf `BPMN importieren` und wählen Sie eine BPMN 2.0 XML Datei aus.

source: The `Import BPMN` button on the `Processes` page
de: Die `BPMN importieren`-Schaltfläche der `Prozesse`-Ansicht.

source: Workflow Accelerator does not support all BPMN 2.0 elements, so the process may appear differently in Workflow Accelerator. The following table lists supported BPMN elements, and the corresponding action type.
de: Workflow Accelerator unterstützt nicht alle BPMN 2.0 Elemente. Ein importierter Prozess wird in Signavio Workflow unter Umständen also verändert dargestellt. Die folgende Tabelle enthält alle unterstützten BPMN-Elemente mit den jeweilig entsprechenden Aktionstypen.

source: Supported BPMN elements
de: Unterstützte BPMN-Elemente

source: Action type
de: Aktionstyp

source: Business rule task
de: Geschäftsregel-Task

source: Call activity
de: Aufruf-Aktivität

source: End event
de: Endereignis

source: Exclusive gateway
de: Exklusives Gateway

source: Intermediate timer event
de: Zeit-Zwischenereignis

source: Manual task
de: Manuelle Task

source: Parallel gateway
de: Paralleles Gateway

source: Script task
de: Skripttask

source: Send task (``type=email``)
de: Email-senden-Task (``type=email``)

source: Signavio Process Manager state change
de: Statusänderung im Signavio Process Manager

source: Start event
de: Startereignis

source: Sub-process (embedded)
de: Subprozess (eingebettet)

source: User task
de: Benutzer-Task

source: Workflow Accelerator removes unsupported elements, such as message events.
de: Nicht unterstützte Elemente, wie zum Beispiel Nachrichtenereignisse, werden entfernt.

source: You can export a Workflow Accelerator process model as a BPMN 2.0 XML file. You may find this useful for opening the model in another tool that supports BPMN, or to make a backup that you can load using the :ref:`BPMN import <bpmn-import>` option.
de: Sie können ein Signavio Workflow Accelerator Prozessmodel als BPMN 2.0 XML-Datei exportieren. Anschließend können Sie das Diagramm in einem beliebigen Tool öffnen, das den offenen BPMN 2.0 Standard unterstützt. Die Exportfunktion ermöglicht zudem das Erstellen von Backups: ein :ref:`Re-Import <bpmn-import>` ist jederzeit möglich.

source: To export a process model, first open it in the Workflow Accelerator process editor. Select the menu next to the `Publish changes` button, then select `Export BPMN 2.0 XML`.
de: Um einen Prozess zu exportieren, öffnen Sie ihn zunächst in Signavio Workflow Accelerator. Wählen Sie im Menü neben dem `Zum Ausführen veröffentlichen` Button den Punkt `BPMN 2.0 XML exportieren`.

source: Using the `Export BPMN 2.0 XML` option to save a process model in a file
de: Benutzen Sie den BPMN 2.0 XML Export um einen Prozess als Datei zu speichern.

source: This results in a file download that describes your process model in BPMN format. Workflow Accelerator only exports one kind of BPMN file, so it doesn’t give you any options to configure.
de: Anschließend wird der Download der Datei im BPMN-Format gestartet. Da es nur eine Art von BPMN-Dateien gibt, müssen Sie auch keine weiteren Optionen konfigurieren.

source: Copying & deleting processes
de: Prozesse kopieren und löschen

source: You can create a copy of a process or delete it using the process menu shown in the previous section.
de: Über das Prozessmenü können Sie zudem Prozesse kopieren und löschen.

source: The `Create a copy` option duplicates the process in the same organisation. You may find it useful to duplicate a process if you want to experiment with changes without publishing changes to a live process. You may also want to duplicate a process to model a special case of the process, instead of adding a conditional flow to the standard process.
de: Über die Schaltfläche `Eine Kopie erstellen` duplizieren Sie einen Prozess in der entsprechenden Organisation. Dies ist insbesondere hilfreich, wenn Sie mit dem Prozess experimentieren wollen, ohne dass Nutzer der Prozessfälle direkt von den Änderungen betroffen sind. Ein weiterer Fall, bei dem das Kopieren eines Prozesses sehr nützlich sein kann, ist die Erstellung einer neuen Prozessvariante. Wenn Sie einen neuen Prozess erstellen, vermeiden Sie unnötige konditionelle Sequenzfluss-Verzweigungen.
