Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/search.po
Languages: de

source: Search
de: Suche

source: The search function in Workflow Accelerator helps you to find specific for tasks, cases, processes and reports. Search terms are searched in names and description of the respective category. With the exception of the search for cases: here, only the name is taken into account.
de: Die Suchfunktion in Workflow Accelerator hilft Ihnen, gezielt nach Aufgaben, Fällen, Prozessen und Reports zu suchen. Der von Ihnen eingegebene Suchbegriff wird im Namen und der Beschreibung der jeweiligen Kategorie gesucht – Ausnahme bildet hierbei die Such nach den Fällen: hier wird lediglich der Name berücksichtigt.

source: How to search in Workflow Accelerator:
de: Wichtige Hinweise zur Suche:

source: wildcards are not supported
de: Wildcards werden nicht unterstützt

source: with search terms in quotation marks, you can search for a coherent string
de: mit Suchbegriffen in Anführungszeichen können Sie nach einer zusammenhängenden Zeichenkette suchen

source: exclude search terms by a - (minus) before the search term
de: mit einem - (Minus) vor dem Suchbegriff wird dieser von der Suche ausgeschlossen

source: upper/lower case is not taken into account
de: Groß- und Kleinschreibung wird nicht berücksichtigt

source: you must enter at least three characters for the search term
de: Sie müssen einen Suchbegriff mit mindestens drei Zeichen eingeben

source: stemming is a method of search
de: Stemming wird unterstützt

source: You can open the search page via the search option in the main menu bar.
de: Öffnen Sie die Suchseite über die Suchoption in der Hauptmenüleiste.

source: Main menu search icon
de: Suchsymbol in der Hauptmenüleiste

source: Enter a search term.
de: Geben Sie einen Suchbegriff ein.

source: Search page input field
de: Eingabefeld für Suchbegriffe

source: The search results show a list with the first ten entries per category. If you do not find the required search result in the list, you need to refine your search by adding or excluding keywords, for example. Hover an entry to show details on the right.
de: Suchergebnisse werden in einer Liste mit den jeweils ersten zehn Einträgen pro Kategorie angezeigt. Sollten Sie nicht das gewünschte Suchergebnis in der Liste finden, verfeinern Sie Ihre Suche, indem Sie beispielsweise Suchbegriffe hinzufügen oder ausschließen. Fahren Sie mit der Maus über einen Eintrag in der Ergebnisliste, um Details zu dem jeweiligen Eintrag anzuzeigen.

source: Search results with one entry highlighted.
de: Suchergebnisse mit einem hervorgehobenen Eintrag.

source: Note that the case icon next to the case name indicates the case status - open or closed. Select the case name to open the case.
de: Beachten Sie, dass das Symbol neben dem Fallnamen den Status anzeigt - offen oder geschlossen. Wählen Sie den Fallnamen, um den Fall zu öffnen.
