Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/settings.po
Languages: de

source: Organization settings
de: Organisationseinstellungen

source: In Signavio Workflow Accelerator, your organization represents a collection of Workflow Accelerator users - typically a company - together with all their data in Workflow Accelerator. People outside your organization cannot see your organization's data. After you log into Workflow Accelerator, you see all the data inside one particular organization. If you belong to multiple organizations, you can switch between organizations by selecting a different organization under your name in the top right corner.
de: In Signavio Workflow Accelerator wird Ihre Organisation - normalerweise eine Firma - durch eine bestimmte Menge von Signavio Workflow Accelerator-Nutzern dargestellt, zusammen mit all ihren Signavio Workflow Accelerator-Daten. Personen außerhalb Ihrer Organisation können Ihre Daten nicht einsehen. Nachdem Sie sich in Signavio Workflow Accelerator eingeloggt haben, können Sie den Datensatz einer bestimmten Organisation einsehen. Falls Sie mehreren Organisationen angehören, können Sie zwischen Organisationen wechseln, indem Sie oben rechts unter Ihrem Namen eine andere Organisation auswählen.

source: Use the Organization settings page to set-up users and groups, manage invitations, and configure external services such as :ref:`salesforce-integration`.
de: In den Organisationseinstellungen können Sie Nutzer und Gruppen verwalten, Einladungen versenden und externe Services wie zum Beispiel die :ref:`Salesforce Integration <salesforce-integration>` konfigurieren.

source: At the top of the page, in the masthead, you can edit the organization name.
de: Im Kopfteil der Seite (dem türkis hinterlegten Teil) können Sie den Namen der Organisation ändern.

source: Users
de: Nutzer

source: The users list shows users who belong to your organization. You can expand each user’s entry to see their email address, license type, and membership type - indicating whether the user has the administrator role.
de: Die Nutzerliste zeigt alle Mitglieder in Ihrer Organisation. Sie können jeden Eintrag aufklappen um die Emailadresse, die Lizenz und die Art der Mitgliedschaft für jeden Nutzer - reguläre Nutzer oder Administrator - einsehen.

source: Administrators can promote other users to administrator: on an expanded user panel, click the *Promote to administrator* button.
de: Administratoren können andere Nutzer zu Administratoren ernennen. Klappen Sie dazu einen Eintrag in der Nutzerliste auf und klicken Sie auf *Zum Administrator ernennen*.

source: Replacements
de: Vertreter

source: Administrators can also delete users, using the delete button next to the user name.
de: Administratoren können Nutzer auch löschen indem Sie auf den Papierkorb neben dem Nutzernamen klicken.

source: If you want to delete a user account, for example, because the user is leaving your organization, unfinished tasks to this account may still exist. In this case, specify a replacement who will take over open task assignments. The substitute will then have exactly all access rights to complete open tasks and cases, but not automatically inherits group memberships of the deleted user. Please also be aware that the assignment for closed tasks is not changed for audit reasons.
de: Wenn Sie ein Benutzerkonto löschen möchten, da der Nutzer beispielsweise Ihre Organisation verlässt, könnten noch unerledigte Aufgaben vorliegen. In diesem Fall haben Sie die Möglichkeit, einen Vertreter zu bestimmen, der diese offenen Aufgaben übernehmen soll. Der Vertreter erhält dann genau die Zugriffsrechte, die er für die Erledigung der offenen Aufgaben und Prozesse benötigt, erbt jedoch nicht automatisch die Gruppenmitgliedschaften des gelöschten Nutzers. Für eine bessere Nachvollziehbarkeit der Prozesse werden ursprüngliche Zuordnungen abgeschlossener Aufgaben nicht geändert.

source: The substitute takes over
de: Der Vertreter übernimmt

source: in workflows: owner, assignments, candidates, default values for form fields, transition conditions, JavaScript test values, access rights
de: In Workflows: Owner, Zuweisungen, Kandidaten, Standardwerte von Formfeldern, Übergabebedingungen, JavaScript Testwerte, Zugriffsrechte

source: in reports: owner, access rights
de: in Reports: Owner, Zugriffsrechte

source: in open tasks: assignments, candidates, access rights
de: In offenen Aufgaben: Zuweisungen, Kandidaten, Zugriffsrechte

source: in cases: access rights
de: in Fällen: Zugriffsrechte

source: Please note that deleted users are removed from all groups he was a member of and no replacement is set.
de: Bitte beachten Sie, dass die Gruppenzuweisungen, die der gelöschte Nutzer innehatte, beim Vertreter nicht übernommen werden.

source: Whenever you delete a user, a dialogue where you can define a replacement appears.
de: Jedes Mal, wenn Sie ein Benutzerkonto löschen, erscheint der Dialog zum Spezifizieren eines Vertreters.

source: Deleted users with task assignments and without replacement set, are listed as *Former users* and administrators are weekly reminded to specify a substitute.
de: Benutzer, die noch offene Aufgabenzuweisungen haben und für die noch kein Vertreter definiert ist, werden unter *Ehemalige Nutzer* aufgelistet. Administratoren erhalten dann wöchentlich eine Erinnerung, einen Vertreter für diese zu definieren.

source: Invitations
de: Einladungen

source: The invitations list shows who you have invited to use Workflow Accelerator.
de: Die Liste der Einladungen zeigt Ihnen, wen Sie schon zu Signavio Workflow Accelerator eingeladen haben.

source: To invite someone to use Workflow Accelerator, select the license they will use, enter their email address in the text field and click the *Invite* button. They will receive an email with a link to the registration page, where they can create a Workflow Accelerator user that will become a member of the organization.
de: Um jemanden zu Signavio Workflow Accelerator einzuladen, wählen Sie zunächst die gewünschte Lizenz aus. Danach geben Sie im Textfeld darunter eine Emailadresse ein und klicken auf *Einladen*. Alle Personen, die Sie einladen erhalten darauf eine Email mit einem Link um Ihre Registrierung abzuschließen. Anschließend tauchen sie wie gewohnt in der Mitgliederliste Ihrer Organisation auf.

source: Groups
de: Gruppen

source: The groups list shows the organization's user groups. You can use these groups to define candidates for tasks in the :ref:`process builder <processes>`.
de: Unter Gruppen finden Sie alle Gruppen, die in Ihrer Organisation definiert sind. Sie können Gruppen benutzen um Kandidaten für Aufgaben im :ref:`Prozesseditor <processes>` festzulegen.

source: To create a new group, in the text field below the group list, enter a group name and click the *Create* button.
de: Um eine Neue Gruppe anzulegen, geben Sie zunächst den Namen im Textfeld unter der Liste aller Gruppen ein und klicken dann auf *Erstellen*.

source: Click a group’s name to expand its list of members, so you can edit the name and add or remove members,
de: Wenn Sie auf eine Gruppe klicken, sehen Sie die Liste aller Mitglieder. Sie können diese Liste bearbeiten indem Sie weitere Nutzer hinzufügen oder bestehende Mitglieder entfernen.

source: Preferences
de: Organisationseinstellungen

source: The *Preferences* include additional options that apply to the whole organization.
de: Unter *Organisationseinstellungen* finden Sie Konfigurationsoptionen, die für Ihre gesamte Organisation zentral verwaltet werden.

source: *Time zone* affects how Workflow Accelerator displays times.
de: Unter *Zeitzone* konfigurieren Sie die Anzeige von Zeiten in Signavio Workflow Accelerator.

source: *Email signature* replaces the default *Workflow Accelerator team* signature at the bottom of :ref:`notification emails <notifications>`.
de: Unter *Email Signatur* ersetzen Sie die *Signavio Workflow Team*-Standardsignatur, die mit den :ref:`Signavio Workflow Accelerator-Emailbenachrichtigungen<notifications>` verschickt wird.

source: Process creation
de: Prozesserstellung

source: You can activate the *Process creation* option to restrict the right to create processes to a specific :ref:`user group <groups>`.
de: Sie können die Option *Prozesserstellung* aktivieren, um zu konfigurieren, welche :ref:`Nutzergruppe <groups>` Prozesse erstellen darf.

source: Only users of this group can
de: Nur Mitglieder dieser Gruppe dürfen

source: create new processes,
de: neue Prozesse erstellen,

source: copy processes,
de: Prozesse kopieren,

source: import processes.
de: Prozesse importieren.

source: Users who are not member of the defined group, but have editing rights for specific processes are still able to modify these processes.
de: Benutzer, die nicht Mitglied der definierten Gruppe sind, aber Editierrechte auf bestimmte Prozesse haben, können diese Prozesse weiterhin bearbeiten.

source: The transfer of processes between Process Manager and Workflow Accelerator is not affected by this restriction. Any modeller can transfer a process from Process Manager to Workflow Accelerator.
de: Der Transfer von Prozessen von Process Manager zu Workflow Accelerator ist durch diese Restriktion nicht beeinträchtigt. Alle Modellierer können nach wie vor Prozesse von Process Manager zu Workflow Accelerator übertragen.

source: Use the *Services* tab to configure integration with cloud services for members of the organization to use. See :ref:`salesforce-integration`.
de: Verwenden Sie den *Services*-Tab, um die Cloud-Services Integration für die Nutzung durch Mitarbeiter Ihrer Organisation zu konfigurieren. Lesen Sie mehr unter :ref:`salesforce-integration`.

source: Billing
de: Zahlinformationen

source: Use the *Billing* tab to manage your organization's licenses for Workflow Accelerator. This page shows:
de: Verwenden Sie den *Zahlinformationen*-Tab, um die Signavio Workflow Accelerator-Lizenzen Ihrer Organisation zu verwalten. Die Seite zeigt:

source: the number of remaining user licenses - how many more people you can add to the organization
de: Die Anzahl ungenutzter Lizenzen - wie viele Nutzer Sie noch zu Ihrer Organisation hinzufügen können

source: the license expiry date, after which you must renew your licenses to continue using Workflow Accelerator.
de: Das Auslaufdatum Ihrer Lizenzen - wann Sie die Lizenzen erneuern müssen, um weiterhin mit Signavio Workflow Accelerator zu arbeiten.

source: The left-hand sidebar summarises your current license type. Click the *Upgrade your license* button to upgrade to another license type.
de: Die Leiste links zeigt Ihren Lizenztyp an. Klicken Sie *Upgraden Sie Ihre Lizenz* unten, um Ihren Lizenztyp upzugraden.

source: Single sign-on (SSO) makes it possible to access Workflow Accelerator using an existing corporate user account, so you do not have to log in to Workflow Accelerator separately. To request SSO for your organization, send a request using the *Send feedback* option in the application, including your `SAML 2.0 Identity Provider Metadata <https://en.wikipedia.org/wiki/SAML_2.0#Identity_Provider_Metadata>`_.
de: Single-Sign-On (SSO) erlaub es Ihnen, auf Workflow Accelerator über einen bereits vorhandenen Nutzeraccount eines anderen Systems zuzugreifen, ohne sich noch einmal extra in Workflow Accelerator einloggen zu müssen. Sie können eine Anfrage bezüglich einer SSO-Aktivierung über die *Feedback senden*-Funktion in der Anwendung stellen. Geben Sie hierbei Ihre `SAML 2.0 Identity Provider-Daten <https://en.wikipedia.org/wiki/SAML_2.0#Identity_Provider_Metadata>`_ an.

source: Workflow Accelerator currently only supports the `G Suite <https://support.google.com/a/answer/6087519?hl=en&ref_topic=6304963>`_ (formerly Google Apps) SSO provider.
de: Momentan unterstützt Signavio Workflow Accelerator lediglich den SSO-Anbieter `G Suite <https://support.google.com/a/answer/6087519?hl=en&ref_topic=6304963>`_ (früher Google Apps).

source: Workflow Accelerator supports `Security Assertion Markup Language (SAML) 2.0 <https://en.wikipedia.org/wiki/SAML_2.0>`_ Identity Provider-initiated SSO using the HTTP POST binding. Please contact us if you want to use a SAML 2.0 Identity Provider other than those listed above.
de: Signavio Workflow Accelerator unterstützt `Security Assertion Markup Language (SAML) 2.0 <https://en.wikipedia.org/wiki/SAML_2.0>`_ Identity Provider-initiierten SSO mit HTTP POST-Bindung. Kontaktieren Sie uns bitte, falls Ihr gewünschter SSO-Anbieter nicht von unterstützt wird.

source: Most organizations soon have enough processes to make it inconvenient to browse the processes list. To keep your processes tidy, you can define and use labels, to categorize processes by department, status or however you like.
de: Typischerweise haben Sie in Ihrer Organisation nach einiger Zeit so viele Prozesse erstellt, dass es umständlich wird, auf der Suche nach einem Prozess durch die gesamte Liste zu scrollen. Um Ihre Prozesse besser zu organisieren, können Sie Labels verwenden, die Ihre Prozesse zum Beispiel nach Abteilung oder Status kategorisieren.

source: Use the *Labels* tab to define labels for your organization. You start with a set of default labels, but you can customize the list.
de: Wechseln Sie in den *Labels*-Tab, um Labels für Ihre Organisation zu definieren. Standardmäßig sind schon einige Labels vorhanden. Sie können die Liste jedoch anpassen und erweitern.

source: Configuring labels - used to categorize processes
de: Labels konfigurieren um Prozesse zu kategorisieren

source: To add a new label, enter a name in the text input field and select *Create*. Select a label or its edit icon to change its name or color. To delete a label, select the delete icon on the far right.
de: Um ein neues Label hinzuzufügen, geben Sie einen Namen in das Textfeld ein und klicken Sie auf *Erstellen*. Wählen Sie ein Label oder dessen ‘Bearbeiten’-Button aus, um den Namen oder die Farbe anzupassen. Um ein Label zu löschen, wählen Sie das *Löschen*-Symbol auf der rechten Seite aus.
