Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/tutorials.po
Languages: de

source: Now you can see the result of adding the decision to the process. Select the *Publish changes* button (top-right) to publish a new version of the process, then select *Start case* next to the latest version in the list. Start the case, completing the trigger form if you added one, and open the *Approve report* task. The task page shows the task form with the description you entered, and the decision buttons.
de: Sehen Sie sich jetzt das Ergebnis der Änderungen an. Wählen Sie den Button *Änderungen veröffentlichen* in der oberen rechten Ecke aus und veröffentlichen Sie eine neue Version des Prozesses und klicken Sie dann auf *Neuen Fall starten*. Füllen Sie nun das Auslöserformular aus (falls vorhanden) und öffnen Sie die Aufgabe *Report freigeben*. Die Aufgabenseite zeigt nun das Formular mit der konfigurierten Beschreibung und den Entscheidungsbuttons an.

source: Running the process - the form for a manual decision with *Approve* and *Reject* buttons
de: Führen Sie den Prozess aus. Das Formular der manuellen Entscheidung zeigt die Buttons *Freigeben* und *Ablehnen* an.

source: Select *Approve* to record the decision and complete the user task. The case view event stream (right) now shows the *Approve* decision.
de: Wählen Sie *Freigaben* aus, um die Entscheidung zu dokumentieren und die Nutzeraufgabe abzuschließen. Der Ereignisfeed der Fallansicht zeigt nun die Freigabe an.

source: After completing the form, the event stream shows the *Approve* decision
de: Nachdem das Formular ausgefüllt wurde, zeigt der Ereignisfeed die Freigabe-Entscheidung.

source: Decisions like these don’t only occur in document approval processes. In practice, many kinds of business processes use one or manual decisions that you can add in the same way.
de: Sie können diese Entscheidungen nicht nur für Dokumentenfreigabe-Prozesse verwenden. Viele Geschäftsprozesse verwenden eine oder mehrere manuelle Entscheidungen, die Sie auf dem selben Weg konfigurieren können.

source: More tutorials
de: Weitere Tutorials (Englisch)

source: Sigavio’s `Applied BPM and BDM Blog <https://www.signavio.com/signavio-blogs/modeling-blog/>`_ includes Workflow Accelerator tutorials. The following tutorials introduce features based on concrete examples.
de: In Signavios `Applied BPM and BDM Blog <https://www.signavio.com/signavio-blogs/modeling-blog/>`_ finden Sie auch Tutorial für Workflow Accelerator. Die folgenden Tutorials erläutern Features anhand von konkreten Beispielen.

source: `Multi-instance user tasks <https://www.signavio.com/post/multi-instance-user-tasks-workflow-accelerator/>`_ - creating user tasks for members of a group
de: `Mehrbenutzer-Aufgaben <https://www.signavio.com/post/multi-instance-user-tasks-workflow-accelerator/>`_ - Erstellen von Aufgaben für jedes Mitglied einer Gruppe

source: `Business days calculation <https://www.signavio.com/post/business-days-calculation-workflow/>`_ - using external public holiday data in JavaScript action
de: `Berechnung von Geschäftstagen <https://www.signavio.com/post/business-days-calculation-workflow/>`_ - externe Daten zu öffentlichen Feiertagen in einer JavaScript-Aufgabe verwenden

source: `Vacation handovers <https://www.signavio.com/post/smooth-vacation-handovers/>`_ - reassigning tasks and configuration task escalation
de: `Arbeitsübergabe im Zuge von Mitarbeiterurlaub <https://www.signavio.com/post/smooth-vacation-handovers/>`_ - Änderung der Zuweisung von Aufgaben und Eskalation

source: `Integrating a workflow with external web services <https://www.signavio.com/post/workflow-web-services-integration/>`_ - fetching external data
de: `Einen Workflow mit externen Web Services integrieren <https://www.signavio.com/post/workflow-web-services-integration/>`_ - auf externe Daten zugreifen

source: `Integrating a spreadsheet with a workflow <https://www.signavio.com/post/integrating-spreadsheet-workflow/>`_ - reading CSV data in a JavaScript action
de: `Einen Spreadsheet in einen Workflow integrieren <https://www.signavio.com/post/integrating-spreadsheet-workflow/>`_ - eine CSV-Datei in einer JavaScript-Aufgabe einlesen

source: `‘Four-eye’ approvals <https://www.signavio.com/post/automate-four-eye-approvals/>`_ - adding permissions and parallel tasks to approval workflows
de: `‘Vier-Augen’-Freigaben <https://www.signavio.com/post/automate-four-eye-approvals/>`_ - Hinzufügen von Berechtigungen und parallelen Tasks zu Freigabe-Workflows.

source: `Automatically triggering a workflow with form data <https://www.signavio.com/post/automatically-trigger-workflow/>`_ - reading from a trigger email
de: `Einen Workflow mit Formulardaten auslösen <https://www.signavio.com/post/automatically-trigger-workflow/>`_ - Auslesen einer Auslöser-E-Mail.

source: `Business rules execution from DMN <https://www.signavio.com/post/business-rules-execution-dmn-model/>`_ - executing decision models
de: `Geschäftsregel-Ausführung mit DMN <https://www.signavio.com/post/business-rules-execution-dmn-model/>`_ - Ausführung von Entscheidungsmodellen

source: `Custom activity types using sub-processes <https://www.signavio.com/post/custom-activity-types-sub-processes/>`_ - managing process complexity
de: `Eigene Aktions-Typen in Unterprozessen <https://www.signavio.com/post/custom-activity-types-sub-processes/>`_ - Komplexität in Prozessen verwalten

source: `Decision gateway variables <https://www.signavio.com/post/decision-gateway-variables/>`_ - re-using decision results
de: `Gateway-Entscheidungsvariablen <https://www.signavio.com/post/decision-gateway-variables/>`_ - Wiederverwendung von Entscheidungsergebnissen

source: `Form fields with multiple values <https://www.signavio.com/post/form-fields-with-multiple-values/>`_ - entering lists
de: `Formularfelder mit mehreren Werten <https://www.signavio.com/post/form-fields-with-multiple-values/>`_ - Eingabe von Listen

source: `Box.com integration <https://www.signavio.com/post/box-file-upload-integration/>`_ - uploading files to the cloud
de: `Box.com-Integration <https://www.signavio.com/post/box-file-upload-integration/>`_ - Online-Datei-Upload

source: `Google Cloud Print Integration <https://www.signavio.com/post/google-cloud-print-integration/>`_ - printing files via the cloud
de: `Google Cloud-Druckintegration <https://www.signavio.com/post/google-cloud-print-integration/>`_ - Dateien online drucken

source: `Case name templates that identify orders <https://www.signavio.com/post/case-name-templates-to-identify-orders/>`_ - organizing cases
de: `Fallnamen-Vorlagen zur Identifizierung von Bestellungen <https://www.signavio.com/post/case-name-templates-to-identify-orders/>`_ - Fallverwaltung

source: `Role-based assignment <https://www.signavio.com/post/using-role-based-assignment-in-effektif/>`_ - configuring sticky task assignment
de: `Rollenbasierte Zuweisung <https://www.signavio.com/post/using-role-based-assignment-in-effektif/>`_ - Konfiguration von Zuweisungen, die über den Fall hinweg bestehen bleiben
