Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/tutorials.po
Languages: de

source: Use these tutorials to learn how to get started with Signavio Workflow Accelerator.
de: Verwenden Sie diese Tutorials um sich mit Signavio Workflow Accelerator vertraut zu machen.

source: Using an ad hoc case for a document approval
de: Einen Ad-Hoc Fall für eine Dokumentenfreigabe verwenden

source: This tutorial introduces the simplest way to get started with Workflow Accelerator. You can start without first defining a process by :ref:`start-adhoc`.
de: Dieses Tutorial erklärt den einfachsten Weg, um die Arbeit mit Signavio Workflow Accelerator zu beginnen. Durch die :ref:`start-adhoc`, können Sie anfangen mit Workflow Accelerator zu arbeiten, ohne vorher einen Prozess zu erstellen.

source: People often use workflows for document approvals, so this tutorial uses the example of approving a report, called *June report*.
de: Workflows werden oft dazu verwendet, um Dokumente freizugeben. In diesem Tutorial wird diese Funktion anhand eines Reports mit dem Namen *Juni-Report* vorgeführt.

source: In the main menu, select *Cases* and then select *Cases without a process* from the bottom of the drop-down list. This shows the :ref:`Cases <cases-overview>` view, which you can use to create and view :ref:`ad hoc cases <start-adhoc>`.
de: Wählen Sie im Hauptmenü den Tab *Fälle* und klicken Sie dann *Fälle ohne Prozess* im *'Fälle von'* Drop-Down Menü. Hier werden alle :ref:`Fälle <cases-overview>` gelistet. Sie können die Übersicht nutzen, um :ref:`einen neuen Ad-hoc Fall zu erstellen<start-adhoc>` und Fälle einzusehen.

source: The *Cases* view, where you can start a new case
de: Die *Fälle*-Ansicht. Von hier aus können Sie einen neuen Fall starten.

source: *Ad hoc* cases do not use a pre-defined process model. You can also :ref:`create an approval process model <tutorial-new-process>`.
de: *Ad-hoc* Fälle besitzen keinen vorgefertigten Prozess. Sie können auch :ref:`einen Prozess für den Freigabeworkflow erstellen <tutorial-new-process>`.

source: Select *Start new case* to start creating a new ad hoc case. This opens the case name prompt.
de: Wählen Sie *Neuen Fall starten*, um mit der Erstellung eines neuen ad-hoc Falles zu beginnen. Die Aktion öffnet die Eingabezeile für einen Fallnamen.

source: Entering a case name
de: Einen Fallnamen eintragen

source: Enter the name **June report** to create the new case. The case details view shows the initial case, with an empty task list on the left.
de: Geben Sie den Fallnamen ein, um einen neuen Fall zu erstellen. Die Fall-Detailansicht zeigt den anfänglichen Fall mit einer leeren Aufgabenliste links.

source: A new ad hoc case
de: Ein neuer ad-hoc Fall

source: Now add a document: on the right, select *Upload a document* and select the report to review, **June report.pdf**. On the left, in the *Add a new task* text input, enter the task name **Approve report** to create a task.
de: Fügen Sie nun ein Dokument hinzu: Klicken Sie auf *Laden Sie eine Datei hoch* rechts und wählen Sie den freizugebenden Report aus. Klicken Sie auf *Eine neue Aufgabe hinzufügen* links und geben Sie eine Aufgabe ein, zum Beispiel *Report freigeben*, um diese zu erstellen.

source: The event stream now shows the corresponding events, labelled *added a document* and *created Approve report*.
de: Der Ereignisfeed zeigt jetzt die durchgeführten Aktionen, wie *hat ein Dokument hinzugefügt* oder *hat Report Freigeben erstellt*.

source: Adding a document to the event stream and a task to the task list
de: Ein Dokument zum Ereignisfeed hinzufügen und eine Aufgabe erstellen

source: You can add as many tasks to the case as you like. Use separate tasks for work that different people will do, or work that will they will complete at different times.
de: Sie können so viele Aufgaben erstellen wie nötig. Erstellen Sie separate Aufgaben für Aktionen, die von verschiedenen Personen ausgeführt werden oder zu verschiedenen Zeiten ausgeführt werden sollen.

source: You can also use the text box above the event stream to :ref:`add comments to the case <comments>`, to add information and collaborate with other people.
de: Sie können außerdem das Textfeld über dem Ereignisfeed verwenden, um :ref:`Kommentare oder Informationen im Fall zu hinterlegen <comments>` und mit anderen Kollegen zusammenzuarbeiten.

source: Select the *Approve report* task in the list to open the task details view. Under the task name, use the assignee selector to assign the task to someone, who will receive a :ref:`notification <task-assigned>`. Use the date selector to choose a due date, which will result in reminders if the case’s assignee does not complete it in time.
de: Wählen Sie die Aufgabe *Report freigeben* aus der Liste, um Details zu der Aufgabe anzeigen zu lassen. Sie können das linke Drop-Down Menü unter dem Namen der Aufgabe verwenden, um die Aufgabe an eine Person zu übergeben, die dann eine :ref:`Nachricht <task-assigned>` erhält. Verwenden Sie die Datumsauswahl rechts, um ein Fälligkeitsdatum zu setzen. Die der Aufgabe zugewiesene Person erhält Erinnerungen, falls die Aufgabe nicht innerhalb vom angegebenen Zeitrahmen ausgeführt worden ist.

source: Details of a task within a case
de: Aufgabendetails in einem Fall

source: Select the *Done* button to complete the task. As the case does not contain any other open tasks, this closes the case as well. You can recognise the case’s closed status by the grey case name background, and from the most recent event in the event stream.
de: Wählen Sie den *Fertig*-Button um die Aufgabe als erledigt zu markieren. Da der Fall keine anderen offenen Aufgaben enthält, schließt diese Aktion auch den Fall. An dem grauen Hintergrund des Fallnamens und am aktualisierten Ereignisfeed können Sie erkennen, dass der Fall geschlossen ist

source: A closed case, after completing its last task
de: Ein geschlossener Fall, nachdem die letzte Aufgabe erledigt wurde

source: You can use a similar case for any other kind of approval. Use event stream comments to add any required information, and add approval tasks the same way. Next steps:
de: Sie können ähnliche Fälle für jede Art von Freigabe verwenden. Nutzen Sie den Ereignisfeed, um notwendige Informationen in Form von Kommentaren zu hinterlegen und fügen Sie Freigabe-Aufgaben auf dem gleichen Weg hinzu. Nächste Schritte:

source: use an ad hoc case for another kind of collaboration task
de: Verwenden Sie ad-hoc Fälle für andere Arten der Zusammenarbeit

source: use the :ref:`process builder <processes>` to define a template for a repeatable process.
de: Verwenden Sie den :ref:`processes`, um eine Vorlage für einen sich wiederholenden Prozess zu definieren.

source: Your first document approval process
de: Ihr erster Freigabeprozess

source: People often use workflows for document approval, a kind of management approval. This tutorial uses the example of a recurring process for approving some kind of report, which has two parts:
de: Workflows werden oftmals zur Freigabe von Dokumenten genutzt - eine Art von Management-Freigabe. Dieses Tutorial bildet eine periodische Freigabe von Reports ab, die hier aus zwei Teilen besteht.

source: defining the ‘process’ that forms a template of tasks for approving reports
de: Den 'Prozess' definieren, der eine Vorlage für die Aufgaben bietet, die zur Freigabe nötig sind

source: running the process - starting a new ‘case’ that groups the tasks for approving one particular report.
de: Den Prozess durchlaufen - einen neuen 'Fall' starten, der die Aufgaben zur Freigabe eines bestimmten Reports vorgibt.

source: To get started, in the main menu, select *Processes*. This shows the *Processes* view, which you can use to create and view :ref:`processes`.
de: Um zu beginnen, wählen Sie den *Prozesse*-Tab im Hauptmenü. Dieser listet die verfügbaren Prozesse und Optionen zur Erstellung neuer Prozesse im :ref:`Prozesseditor <processes>`.

source: The *Processes* view, where you can create a new process
de: Der *Prozesse*-Tab. Hier können Sie neue Prozesse erstellen.

source: You can also :ref:`use an ad hoc case for a document approval <tutorial-ad-hoc>` without a pre-defined process.
de: Sie können auch :ref:`einen ad-hoc Fall für die einmalige Dokumentenfreigabe verwenden <tutorial-ad-hoc>` ohne vorher einen Prozess erstellen zu müssen.

source: Select *Create new process* to start creating a new process model. This opens the process name prompt.
de: Wählen Sie *Einen neuen Prozess erstellen*, um mit dem Modellieren eines neuen Prozesses zu beginnen. Es öffnet sich das Feld zur Eingabe eines Prozessnamens.

source: Entering a process name, to create a new process
de: Eingabe eines Prozessnamens zur Erstellung eines neuen Prozesses

source: Enter the name **Approve report**, which describes the process’ goal. This creates the new process and opens the process builder’s *Trigger* tab, which you use to define how the process starts.
de: Geben Sie den Namen Ihres Prozesses ein - er sollte das Prozessziel beschreiben. Mit Drücken der Eingabetaste, erstellen Sie einen neuen Prozess. Der *Auslöser*-Tab des Prozesseditors öffnet sich. Hier können Sie definieren, wann bzw. wie der Prozess ausgelöst werden soll.

source: On the *Trigger* tab, select *When a form is submitted* to add a form trigger, so you can start running the process by filling in a form. The document approval process requires a report to approve, which corresponds to a trigger form field called *Report* that you will use to upload a file.
de: Um zum Beispiel, wie hier, das Ausfüllen eines Formulars als Auslöser zu definieren, wählen Sie *Per Formular* - so können Sie durch das Ausfüllen des hier definierten Formulars einen Fall auslösen. Für den Dokumentenfreigabeprozess wird das freizugebende Dokument benötigt, daher definieren wir hier einen Dateiupload als Auslöser. Das Formularfeld nennen wir treffend 'Report'.

source: In the form builder palette, select *File* to add the field to the form. Then select the field to open its configuration panel on the right, enter the field label **Report** and select the *Mandatory* option so the form requires a file upload.
de: Wählen Sie *Datei*, um dieses Formularfeld zum Auslöserformular hinzuzufügen. Wählen Sie dann das neu erstellte Feld an, um die Konfigurationseinstellungen rechts zu öffnen. Geben Sie eine Beschriftung ein (hier: *Report*) und wählen Sie weiter unten *Pflichtfeld*, somit ist der Dateiupload notwendig, damit der Fall gestartet werden kann.

source: The *Trigger* tab, after defining a form trigger to start a case by uploading a file
de: Der *Auslöser*-Tab mit fertig definiertem Dateiupload-Auslöser.

source: After choosing how the process starts, next define the ‘actions’ that you will perform when running the process.
de: Nachdem Sie gewählt haben, wie der Prozess ausgelöst werden soll, müssen die Aktionen definiert werden, die während der Ausführung des Prozesses durchlaufen werden sollen.

source: Select the *Actions* to load the graphical process editor. In the actions palette, select *Start* to add a start event to the diagram. Then, with the start event selected use the actions palette or the mini palette that appears when you select a diagram element to add a user task and end event.
de: Wählen Sie den *Aktionen*-Tab, um den grafischen Prozesseditor zu laden. Wählen Sie *Start* in der Aktionen-Palette, um ein Startereignis zum Prozess hinzuzufügen. Folgend können Sie die Mini-Palette verwenden, die erscheint wenn Sie das Element auswählen, um weitere Elemente, wie z.B. eine Aufgabe und ein Endereignis, zum Prozess hinzuzufügen.

source: Adding a start event (1), clicking the start event mini-palette’s rectangle icon to add a user task (2), and clicking the user task mini-palette’s circle icon to add an end event (3)
de: Hinzufügen eines Startereignisses (1) und, unter Verwendung der Mini-Palette, einer Aufgabe (2) und eines Endereignisses (3).

source: Next select the start event, user task and end event in turn, and use the configuration panel to set their names to *draft for review*, *Approve report* and *report approved*, respectively.
de: Folgend, wählen Sie die erstellten Elemente nacheinander aus und fügen Sie jeweils ein Label über das erscheinende Menü ein, hier 'Report zur Freigabe', 'Report freigeben' und 'Report freigegeben'.

source: The *Actions* tab, after adding a single *Approve report* action to a process
de: Der *Aktionen*-Tab nach Hinzufügen der Aufgabe *Report freigeben*

source: This simple process model only contains a single task, to approve the report. Models don’t have to contain start and end events, but their names help clarify the start and end statuses. Later, you can improve the workflow in various ways, but first you should run the process that you have defined so far, so you can see how it works.
de: Dieses einfache Prozessmodell enthält nur die eine Aufgabe, den Report freizugeben. Das Start- und Endereignis sind optional, aber sie helfen dabei, Anfangs- und Endstatus des Prozesses genau zu erkennen. Sie können den Prozess später verändern und verbessern, doch zunächst sollten Sie das Prozessmodell auslösen und durchlaufen, um zu sehen, wie es funktioniert.

source: Select *Publish to run this process*. This creates a published version of the process, and shows the *Versions* tab, with this initial version.
de: Wählen Sie *Zum Ausführen veröffentlichen*. So wird eine ausführbare Version des Prozesses erstellt und veröffentlicht. Es öffnet sich der *Versionen*-Tab, der hier nur die initiale Version des Prozesses auflistet.

source: The *Versions* tab, after publishing the first version of a process
de: Der *Versionen*- Tab nach der Veröffentlichung der ersten Prozessversion

source: Now that you have published the process, you can use it as a template to create the first ‘case’ for approving a document.
de: Da der Prozess jetzt veröffentlicht ist, können Sie ihn als Vorlage verwenden, um den ersten 'Fall' zu starten.

source: Select *Start new case* to start a new case. This shows the trigger form you set-up earlier, which consists of a file upload field and a submit button. Select the file field, and choose a *June report.pdf* file to attach to the case.
de: Wählen Sie *Neuen Fall starten*, um einen neuen Fall zu beginnen. Es öffnet sich das Auslöserformular mit dem Feld zum Dateiupload. Wählen Sie eine Datei aus und gehen Sie nun auch hier auf *Neuen Fall starten*.

source: Running the process - using the trigger form to start a new case
de: Start des Prozesses mit Hilfe des Auslöserformulars

source: Select *Start new case* to finish starting the new case. This creates the case, and shows the case details view where you already see the process’ *Approve report* task in the task list on the left. The first entry in the event stream, on the bottom-right, shows the the trigger form data, including the uploaded file, which you can select to open.
de: Wählen Sie *Neuen Fall starten*, wenn Sie das Dokument hochgeladen haben, um die Freigabe zu beginnen. Nun wird die Fallübersicht mit Aufgabenliste, die zunächst nur die Aufgabe *Report freigeben* enthält, links angezeigt. Der erste Eintrag im Ereignisfeed zeigt die Auslöserformulardaten samt der hochgeladenen Datei. Klicken Sie sie an, um den Report zu öffnen.

source: The case details view, after starting a new case
de: Die Fallübersicht, nachdem ein neuer Fall gestartet wurde

source: Now you have created an run your process for the first time, you can repeat the same steps to develop your process further: select *Processes*, select the process from the list, make changes to the process model in the process editor, publish a new version and then start a new case to try out the updated process.
de: Sie haben einen Prozess erstellt und ihn zum ersten Mal durchgeführt. Nun können Sie den Prozess auf die gleiche Weise bearbeiten und verbessern: Gehen Sie in den *Prozesse*-Tab und wählen Sie den Prozess aus der Liste. Verändern Sie den Prozess nach Ihren Wünschen im Prozesseditor, veröffentlichen Sie die überarbeitete Version und lassen Sie den Prozess zu Testzwecken erneut laufen, indem Sie einen neuen Fall starten.

source: After creating and running a simple approval process, you can enhance it in several ways. Next steps include the following.
de: Einen neuen Freigabeprozess zu erstellen und zu starten ist nur der Anfang. Es gibt viele Wege, um den Prozess *Dokumentenfreigabe* zu verbessern. Die nächsten Schritte sind:

source: Adding an explicit approval decision using an exclusive gateway
de: Das Hinzufügen einer expliziten Freigabeentscheidung durch Modellierung eines Gateways

source: Adding a result notification using the send email action
de: Eine Nachricht über den Ausgang des Falles durch Einfügen einer *E-Mail Aktion* hinzufügen

source: Using organisation groups to define task candidates
de: Die Verwendung von Organisationsgruppen, um Kandidaten für bestimmte Aufgaben festzulegen

source: Using process roles to automatically assign tasks
de: Die Verwendung von Prozessrollen für die automatische Aufgabenzuweisung

source: Using access control to restrict process actions
de: Verwendung der Zugriffskontrolle, um die Ausführung bestimmter Aktionen auf bestimmte Rollen einzuschränken

source: Adding a decision to an approval process
de: Eine Entscheidung zu einem Freigabeprozess hinzufügen

source: An approval process such as a document approval requires a clear decision, such as whether to *Approve* or *Reject* a document. This tutorial continues the document approval process example from the previous tutorial and shows you how to add a manual decision to a user task form.
de: Ein Freigabeprozess - zum Beispiel für eine Dokumentenfreigabe - benötigt eine klar Entscheidung, ob ein Dokumente *Freigegeben* oder *Abgelehnt* werden soll. Dieses Tutorial führt den Dokumentenfreigabe-Prozess vom letzten Tutorial führt und erklärt, wie Sie eine manuelle Entscheidung zu einen Nutzeraufgabe-Formular hinzufügen können.

source: To start, create a basic approval process with a single user task, as in the :ref:`first document process <tutorial-new-process>` tutorial:
de: Erstellen Sie zunächst einen einfachen Freigabeprozess mit einer einzelnen Nutzeraufgabe, genau wie im Tutorial :ref:`tutorial-new-process`:

source: A basic approval process with a single task
de: Ein einfacher Freigabeprozess mit einer einzelnen Aufgabe

source: This basic process already includes the task for making an approval decision, but it doesn’t give any guidance for making the decision. You can improve this process so that the approval task’s form has *Approve* and *Reject* buttons, like this:
de: Dieser Prozess enthält bereits die Aufgabe zum Treffen der Entscheidung. Allerdings gibt diese Aufgabe kein Konzept zur Entscheidungsfindung vor. Sie sollten den Prozess verbessern, in dem Sie die Buttons *Freigeben* und *Ablehnen* zum Formular der Freigabeaufgabe hinzufügen:

source: The result of adding a decision - a task form with *Approve* and *Reject* buttons
de: Fügen Sie eine Entscheidung hinzu - in diesem Fall ein Formular mit den Buttons *Freigeben* und *Ablehnen*.

source: In the process model, an :ref:`exclusive-gateway` after the user task will represent the decision. To add the gateway to the model, select the *Exclusive gateway* button in the tool palette. This adds the diamond shape with an X to the diagram.
de: Im Prozessmodell wird die Entscheidung durch ein :ref:`exklusives Gateway <exclusive-gateway>` nach der Nutzeraufgabe dargestellt. Um das Gateway zum Modell hinzuzufügen, wählen Sie den Button *Exklusives Gateway* - das Rautenförmige Symbol mit dem X in der Mitte - in der Elementübersicht aus.

source: Adding an exclusive gateway to the process model
de: Fügen Sie ein exklusives Gateway zum Prozessmodell hinzu.

source: Next, drag the end event to the right, to make room for the gateway, and drag the gateway symbol onto the transition from the user task to the end event as shown:
de: Verschieben Sie nun das Endereignis nach rechts, um Platz für das Gateway zu schaffen und ziehen Sie das Gateway auf den Sequenzfluss zwischen Nutzeraufgabe und Endereignis:

source: Moving the gateway to an existing transition
de: Schieben Sie das Gateway auf den Sequenzfluss.

source: For the next step, add a new path to the process that represents the decision to reject the document. This means adding a second transition from the exclusive gateway to a new end event. To do this, select the exclusive gateway, and drag the end event (circle) icon to where you want to new end event, as shown:
de: Fügen Sie anschließend einen weiteren Pfad zum Prozess hinzu, der die Ablehnung des Dokuments repräsentiert. Hierfür benötigen Sie ein weiteres Endereignis, das mit dem exklusiven Gateway verknüpft werden muss. Wählen Sie hierfür das exklusive Gateway aus und ziehen Sie das Endereignis-Symbol (Kreis) an die gewünschte Stelle:

source: Adding a transition from the gateway to a new end event
de: Fügen Sie ein neues Endereignis nach dem Gateway hinzu.

source: Name the new end event to describe the alternate end status, to make the diagram easier to understand. Select the event and enter the name **report rejected**.
de: Beschriften Sie das Endereignis, um so das Diagramm verständlicher zu gestalten. Wählen Sie das Ereignis aus und geben Sie den Text **Report abgelehnt** ein.

source: Naming the alternate end event with a different end status
de: Benennen Sie das Endereignis.

source: Now you can configure the gateway with the decision. To use an exclusive gateway for a manual decision, it must have an incoming transition from a user task and more than one outgoing transition. Select the exclusive gateway to open its configuration pane, and enter the decision options **Approve** and **Reject**, using the end event names to get them the right way around.
de: Nun können Sie am Gateway die Entscheidung konfigurieren. Damit ein exklusives Gateway für eine manuelle Entscheidung verwendet werden kann, muss es einen eingehenden Sequenzfluss von einer Nutzeraufgabe haben, sowie mehr als eine ausgehenden Sequenzfluss. Wählen Sie das Gateway aus und öffnen Sie sein Konfigurationspanel, um die Entscheidungsoptionen **Freigeben** und **Ablehnen** einzugeben. Die Namen der Endereignisse helfen dabei, die Zuordnung korrekt vorzunehmen.

source: Configuring *Approve* and *Reject* decisions on an exclusive gateway
de: Konfigurieren Sie die Entscheidungen zum *Freigeben* und *Ablehnen* an einem exklusiven Gateway.

source: You can see the result of configuring the manual decision on the user task form. Select the user task, which opens its configuration pane’s *Form* tab. At the bottom, underneath where any fields would appear, you now see the decision options as *Approve* and *Reject* buttons. In the form description field, enter instructions for making the decision: **Approve or reject the attached draft report**.
de: Nun können Sie sich das Ergebnis der Entscheidungskonfiguration ansehen. Wählen Sie die Nutzeraufgabe aus. Es öffnet sich der Tab *Formular* des Konfigurationspanels. Dort sehen Sie nun unten die Entscheidungsoptionen *Freigeben* und *Ablehnen*. Geben Sie im Beschreibungsfeld die Anweisungen zur Entscheidungsfindung an: **Geben Sie den angehängten Report frei oder lehnen Sie ihn ab**.

source: Adding a description to a task form that now shows *Approve* and *Reject* buttons
de: Die Entscheidung zeigt nun die Buttons *Freigeben* und *Ablehnen* an.
