Repository: effektif/user-docs
Catalog: docs/_locale/*/LC_MESSAGES/variables.po
Languages: de

source: Variables reference
de: Variablen-Übersicht

source: See :ref:`variables` for an introduction.
de: Eine Einführung finden Sie unter :ref:`variables`.

source: Case variable
de: Fallvariable

source: The *Case* variable contains the data that starting a case creates. This variable has several fields. You cannot change most of this data, except for the case name and due date.
de: Die *Fallvariable* enthält die Daten, die durch einen beginnenden Fall erstellt werden. Diese Variable hat mehrere Felder. Außer den Fallname und Fälligkeit, können Sie diese Variablen nicht ändern.

source: An email has a composite type, with the following properties.
de: Emails enthalten die folgenden Felder:

source: Property
de: Eigenschaft

source: Type
de: Typ

source: Description
de: Beschreibung

source: Case ID
de: Fall-ID

source: Unique identifier
de: Einzigartiger Identifikationsstring

source: Entered or generated editable name
de: Eingegebener oder generierter Name

source: Case number
de: Fallnummer

source: Sequential case number
de: Sequentielle Fallnummer

source: Creator
de: Ersteller

source: User who created the case
de: Der Nutzer, der den Fall erstellt hat

source: Start date
de: Startdatum

source: Date and time the *Creator* started the case
de: Datum und Zeit der Fallerstellung

source: Due date
de: Fälligkeit

source: Optional editable due date
de: Optionales, editierbares Fälligkeitsdatum

source: Priority
de: Priorität

source: Case priority - values ``'0'`` (high) to ``'3'`` (low)
de: Fall-Priorität - Werte ``’0’`` (hoch) bis ``’3’`` (niedrig)

source: Case link
de: Fall-Link

source: URL of the case page in Signavio Workflow Accelerator
de: URL zur Seite des Falls in Signavio Workflow Accelerator

source: Cycle time
de: Durchlaufzeit

source: The duration the case has been open
de: Die aktuelle Öffnungsdauer des Falls

source: Milestone
de: Meilenstein

source: The last milestone the case has passed
de: Der letzte Meilenstein, den der Fall passiert hat

source: The case variable's *ID* uniquely identifies this case among cases for all processes.
de: Die *ID* der Fallvariable identifiziert diesen Fall unter allen Prozessfällen eindeutig.

source: The *Name* field stores the name that either the :ref:`case-creator` entered manually, or that Workflow Accelerator generated. Case participants can edit this name. You might use the case name variable in a :ref:`send-email` action configuration, to send emails that clearly identify their context by prefixing the subject line with the case name.
de: Das *Name*-Feld Speicher den Namen, der entweder vom :ref:`case-creator` manuell eingegeben oder von Signavio Workflow Accelerator generiert wurde. Fallbeteiligte können diesen Namen editieren. Sie können die Fallnamen-Variable in einer :ref:`send-email`-Aktivität verwenden, um Emails zu versenden, die den Kontext über den Fallnamen als Präfix der Betreffzeile genau angeben.

source: You can update the case name in a :ref:`JavaScript action <case-updates>` by assigning a value to ``_case.name``.
de: Sie können den Namen des Falls in einer :ref:`JavaScript-Aktion <case-updates>` ändern, in dem Sie den Parameter ``_case.name`` setzen.

source: The *Number* field stores a sequential case number. Each process uses a separate case number sequence for its cases. In a *Handle customer order* process, you could use the case number as a generated order reference, for example.
de: Das *Fallnummer*-Feld enthält eine fortlaufende Fallnummer. Jeder Prozess besitzt eine eigene Fallnummer-Sequenz für seine Fälle. In einem *Bestellungsverarbeitungsprozess* können Sie die Fallnummer zum Beispiel als Bestellnummer verwenden.

source: The *Creator* field records the Workflow Accelerator user who started the case. The :ref:`type-user` type includes name and email address fields, so you can use the case creator to configure a :ref:`send-email` action that automatically notifies the requestor of an approval process’ result.
de: Das *Ersteller*-Feld enthält Informationen über den Signavio Workflow Accelerator-Nutzer, der den Fall gestartet hat. Der :ref:`type-user` enthält die Name- und Emailadresse-Felder. So können Sie den *Ersteller* des Falles dazu verwenden, um eine :ref:`send-email` Aktion zu erstellen, die den Anfragenden automatisch über den Ausgang eines Approval-Prozesses informiert."

source: The *Start date* records when the :ref:`case-creator` started the case. In an order process, for example, you could use this as the order date.
de: Das Feld *Startdatum* enthält Informationen darüber, wann der :ref:`case-creator` einen Fall erstellt hat. In einem Bestellprozess können sie dies z.B. als Bestelldatum verwenden.

source: The *Due date* field stores the due date that case participants can set on the case view. Unlike the other case variables, the due date does not always have a value.
de: Das Feld *Fälligkeit* enthält das Fälligkeitsdatum, das Fallbeteiligte in der Fallübersicht setzen können. Im Gegensatz zu den anderen Fallvariablen, besitzt dieses Feld nicht immer einen Wert.

source: You can update the case due date in a :ref:`JavaScript action <case-updates>` by assigning a value to ``_case.dueDate``.
de: Sie können das Fälligkeitsdatum des Falls in einer :ref:`JavaScript-Aktion <case-updates>` ändern, in dem Sie den Parameter ``_case.dueDate`` setzen.

source: The *Link* field stores the URL of the case page in Workflow Accelerator. You can include this link in the body of email you send using a :ref:`send-email` action, so that the recipient can immediately open the case in Workflow Accelerator. Workflow Accelerator includes this link its own built-in :ref:`email notifications <notifications>`.
de: Das *Link*-Feld enthält die Webadresse der Fallseite in Signavio Workflow Accelerator. Sie können diesen Link in eine Email einfügen, die sie über eine :ref:`send-email` Aktion versenden. So kann der Empfänger den Fall sofort in Signavio Workflow öffnen. Signavio Workflow fügt diesen Link eigenständig in E-Mails ein, die über die eingebaute :ref:`Benachrichtigungsfunktion <notifications>` versendet werden."

source: Trigger email variable
de: Auslöser-E-Mail Variable

source: The *Trigger email* variable contains the email that started the case, for processes that have an :ref:`email-trigger`. You can use this variable to use information from the email that started the case during the process, and to send email to the sender.
de: Die *Auslöser-E-Mail* Variable enthält in Fällen mit :ref:`E-Mail-Auslöser <email-trigger>` die E-Mail, die den Fall ausgelöst hat. Sie können diese Variable verwenden, um Informationen aus der Auslöser-E-Mail im Prozess zu nutzen, z.B. um eine Email zum Sender der Auslöser-E-Mail zu schicken.

source: This variable has the fields that the :ref:`type-email` type defines. You cannot change their values.
de: Die Felder dieser Variable werden durch den :ref:`type-email` definiert. Sie können daher ihre Werte nicht ändern.

source: Data types
de: Datentypen

source: Variables store workflow information. Each variable has a user-defined name and a type. A type can represent a single value, like text or an email address. ‘Composite’ types such as user, file or email consist of several values.
de: Variablen enthalten Workflow-Information. Jede Variable hat einen nutzerdefinierten Namen und Typen. Ein Typ kann ein einzelner Wert sein, wie Text oder eine E-Mail Adresse. Zusammengesetzte Typen, wie Nutzer-, Datei- oder E-Mail-Typen, besitzen mehrere Werte Zusammengesetzte Typen bestehen aus Listen mit Feldern.

source: Composite types have a list of fields, each with its own (possibly composite) type. The table of fields includes the JavaScript name that you use to access a field in JavaScript code.
de: Zusammengesetzte Typen enthalten eine List von Feldern mit wiederum eigenen (möglicherweise wieder zusammengesetzten) Typen.

source: When using expressions or configuring some action, you refer to workflow data. This can use references to variables, or to fields inside composite variables. The user interface guides you and shows the options you have.
de: Wenn Sie Aktionen konfigurieren, referenzieren Sie Workflowdaten. Dies können Referenzen zu Variablen selbst oder Feldern innerhalb der Variablen sein. Die Nutzeroberfläche hilft Ihnen bei dieser Auswahl und zeigt jeweils alle verfügbaren Optionen auf.

source: Choice
de: Auswahl

source: The *Choice* type stores a text value from a fixed list of configured options.
de: Der *Auswahl*-Typ enthält einen Text-Wert aus einer festgelegten Liste konfigurierter Optionen

source: Date
de: Datum

source: The *Date* type stores a date, or a date and a time of day.
de: Der *Datumstyp* enthält ein Datum, oder ein Datum und eine Tageszeit.

source: Duration
de: Dauer

source: The *Duration* type stores the length of a period of time, such as *2 weeks*. In the user interface, you can select from different time units. In JavaScript actions, *Duration* values store a number of seconds.
de: Der *Dauer*-Typ speichert die Länge einer Zeitspanne, wie zum Beispiel *2 Wochen*. In der Nutzeroberfläche können Sie zwischen verschiedenen Zeiteinheiten wählen. In JavaScript-Aufgaben werden die *Dauer*-Werte als Anzahl der Sekunden gespeichert.

source: The *email type* stores an email, which the email trigger uses. A variable stores the email that triggers the process. You can use the email’s data fields, such as *from address* or the attachments, later in the process.
de: Der Typ *E-Mail* enthält alle Informationen über eine bestimmte Email. Dieser Typ wird zum Beispiel vom Email-Auslöser verwendet um Daten über die eingetroffene Email zur Verfügung zu stellen. Dadurch können Informationen, wie zum Beispiel der Absender oder die Anhänge im Workflow verwendet werden.

source: An email has a composite type, with the follow properties.
de: Emails setzen sich aus den folgenden Feldern zusammen:

source: The unique identifier for this email
de: Der individuelle Identitätscode für diese Email

source: From
de: Von

source: The sender email address
de: Die Email-Adresse des Senders

source: From name
de: Absendername

source: The sender’s display name (optional)
de: Der angezeigte Name des Senders (optional)

source: To
de: Zu

source: :ref:`type-list` of :ref:`type-email-address`
de: :ref:`List <type-list>` vom :ref:`type-email-address`

source: The email addresses of the recipients
de: Die Email-Adressen der Empfänger

source: Reply to
de: Antworten an

source: The email address to send replies to (optional)
de: Die E-Mail-Adresse, an die geantwortet werden soll (optional)

source: Email addresses that receive a copy of the message (optional)
de: E-Mail-Adressen in CC (optional)

source: Subject
de: Betreff

source: The subject of the email (optional)
de: Die Kopfzeile der E-Mail (optional)

source: The plain text message (optional)
de: Die Klartextnachricht (optional)

source: Body HTML
de: HTML-Body

source: The HTML code for an HTML email (optional)
de: Der HTML-formatierte Inhalt der E-Mail (optional)

source: Attachments
de: Dateianhänge

source: :ref:`type-list` of :ref:`type-file`
de: :ref:`type-list` oder :ref:`type-file`

source: The files to attach to the email (optional)
de: Die an die E-Mail anzuhängenden Dateien (optional)

source: Email address
de: Email-Adresse

source: The *email address* type stores an email address.
de: Der Typ *E-Mail-Adresse* enthält E-Mail-Adressen.

source: File
de: Datei

source: The *file* type stores a reference to a file. JavaScript actions can use an API for :ref:`reading file contents <files-api>`.
de: Der *Datei*-Datentyp enthält eine Referenz zu einer Datei. JavaScript-Aktionen können die API zum :ref:`Auslesen von Dateiinhalten <files-api>` verwenden.

source: Content type
de: Inhaltstyp

source: The file’s `media type <https://en.wikipedia.org/wiki/Media_type>`_
de: Der `Medientyp <https://de.wikipedia.org/wiki/Internet_Media_Type>`_ der Datei.

source: File name
de: Dateiname

source: The file’s name
de: Der Name der Datei

source: Owner
de: Inhaber

source: The user who uploaded the file
de: Der Nutzer, der die Datei hochgeladen hat

source: An ID has special kind of string type. Workflow Accelerator creates these IDs to identify objects; they have no other meaning. An ID string looks like ``53fae958036471cea136ea83``.
de: Ins werden genutzt um Ressourcen eindeutig identifizieren zu können. Sie werden ausschließlich von Signavio Workflow Accelerator erzeugt und haben keine weitere Bedeutung. Ein Beispiel für eine ID ist ``53fae958036471cea136ea83``.

source: The *Link* type stores an Internet address (URL), such as a web site address.
de: Der *Link*-Typ enthält eine Internetadresse (URL), wie z.B. die Adresse einer Website.

source: List
de: Liste

source: A list simply represents a collection of values. The list has an order and all elements have a single specified type.
de: Eine Liste fasst mehrere Objekte zusammen. Listen sind immer sortiert und beinhalten Elemente eines bestimmten Typs.

source: Money
de: Geldbetrag

source: The *Money* type stores a currency amount for a particular currency.
de: Der *Geldbetrag*-Typ enthält eine Währungsmenge für eine bestimmte Währung.

source: Number
de: Nummer

source: The *Number* type stores a number.
de: Der *Zahl*-Typ beinhaltet eine Zahl

source: Object types
de: Objekt-Typen

source: Objects have a composite type, with a list of named fields. For example: a user has an object type, with fields such as ``firstName``, ``lastName``, ``mailAddress``.
de: Objekt-Typen sind zusammengesetzte Typen, die verschiedene Felder beinhalten. Ein Nutzer ist zum Beispiel ein Objekt mit Felder wie ``firstName``, ``lastName`` und ``mailAddress``.

source: The *Text* type stores plain text.
de: Der *Text*-Typ speichert Klartext.

source: User
de: Nutzer

source: A variable of type *user* refers to a user in your organization. A user has an object type, with the following properties.
de: Variablen vom Typ *Nutzer* referenzierten Nutzer innerhalb Ihrer Organisation. Nutzer-Variablen haben erhalten die folgenden Felder:

source: The unique identifier for this user
de: Der einzigartige Identifikator für diesen Nutzer

source: The user’s email address
de: Die E-Mail-Adresse des Nutzers

source: First name
de: Vorname

source: The user’s first name
de: Der Vorname des Nutzers

source: Last name
de: Nachname

source: The user’s last name
de: Der Nachname des Nutzers

source: Yes/No Checkbox
de: Ja/Nein Checkbox

source: The *Yes/No Checkbox* type stores a single value that represents either *Yes* or *No*.
de: Der *Ja/Nein Checkbox*-Typ enthält einen einfachen Wert, der *Ja* oder *Nein* repräsentiert.
